[{
    "title": "දැත දරා",
    "singer": [
        "රිද්ම  වීරවර්දන",
        "ධනිත් ශ්‍රී",
        "මෙතුන් එස්කේ",
        "සුපුන් පෙරේරා",
        "දිනෙශ් ගමගේ"
    ],
    "lyricist": ["නිසල් ගමගේ"],
    "composer": ["රිද්ම  වීරවර්දන"],
    "album": "දැත දරා",
    "year": "2020",
    "lyrics": "  දෑත දරා ඇවිදින් ආදරයෙන් මා වෙනුවෙන්  හිඳිනා අයුරු  මිදෙමි දැහැනෙන් හැඟුමන් පාමුල  හිත් වාරු බිඳේවී  ඔබ ලඟ මියුරූ   සේද වළා ඇතුරාලා සඳපායා ඇති රෑ  තුරුලේ ගෙවමූ  මා පැතු ඒ යුග නෙත් ආදර හිත් ආදරයෙන් හමුවීමයි හිමිවූ   මනහාරී නුරාවී නෙතු මානේ සිනාසී  තව ලං වී  පෙමින් දම් ගොතමී….  ගිම්ගානේ තුහීන ගෙනා ඔබෙන් මා නිවෙමී  සදා කල් හිදිමි  තරු යායේ පුරා හඳ වාගේ  වළාවක මාගේ ආලේ ලියමී ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "මිදෙමි දැහැනෙන් හැඟුමන් පාමුල",
            "target": "හැඟීම්",
            "interpretation": "හැඟීම් විවෘත"
        },
        {
            "domain": "ආදරය",
            "source": "සේද වළා ඇතුරාලා සඳපායා ඇති රෑ",
            "target": "රාත්‍රී අහස",
            "interpretation": "පහදිලි රාත්‍රී අහස"
        },
        {
            "domain": "ආදරය",
            "source": "පෙමින් දම් ගොතමී",
            "target": "කතා කිරීම",
            "interpretation": "අදරයෙන් කතා කිරීම"
        },
        {
            "domain": "ආදරය",
            "source": "ගිම්ගානේ තුහීන ගෙනා",
            "target": "සැනසීම",
            "interpretation": "අමාරු කාලයේ සැනසීම"
        },
        {
            "domain": "ආදරය",
            "source": "තරු යායේ පුරා හඳ වාගේ",
            "target": "කාන්තාව",
            "interpretation": "විශේෂ"
        }
    ]
},
{
    "title": "අනන්තේ පුරා",
    "singer": ["ධනිත් ශ්‍රී"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["මහෙශ් කන්කනිගෙ", "ධනිත් ශ්‍රී"],
    "album": "ආලෝකවර්ෂ",
    "year": "2021",
    "lyrics": " ලයේ සතපා මා බාලයේ හොවා සිතේ දුක් සාගරේ දරා මා නිසා කාලයක් ගෙවී දැඩි වූවත් මගේ සිතින් දරන්න බෑ නොමැති නම් ළඟ මගේ පවසන්නම් ඉතින් ඇසෙයි නම් හඬ මගේ දරා වේදනා මා කුසයේ දරාලා නුඹ සිටියා මගේ අම්මේ සදා මාලිගා මා හර්දේම හංගා නුඹ සිටියා මගේ තාත්තේ නුඹේ පැතුමන් මා නිසා පසෙක ලා මගේ මුළු ලෝකයේ පුරා හැඩකලා නොසෙල්වී මහා පොළවේ පය ගසා සිටින්නේ නුඹේ මහමෙරක් ගුණ නිසා වසන්තේ මගෙයි නුඹ මගේ ළඟ නිසා දරා වේදනා මා කුසයේ දරාලා නුඹ සිටියා මගේ අම්මේ සදා මාලිගා මා හර්දේම හංගා නුඹ සිටියා මගේ තාත්තේ ලෝකේ දුටුවා මා මිනිසුන් හඳුනයි මා බැඳීමෙන් මගේ මිදී යන්න දැන් අනන්තේ පුරා අනන්තේ පුරා",
    "metaphors": [{
            "domain": "මවුපිය ගුණ",
            "source": "සදා මාලිගා",
            "target": "සැප සම්පත්",
            "interpretation": "හැම සැප සම්පතක්ම"
        },
        {
            "domain": "මවුපිය ගුණ",
            "source": "මුළු ලෝකයේ පුරා හැඩකලා",
            "target": "ජීවිතයම",
            "interpretation": "ජීවිතයම සුන්දර කිරීම"
        },
        {
            "domain": "මවුපිය ගුණ",
            "source": "වසන්තේ මගෙයි",
            "target": "ජීවිතය",
            "interpretation": "සාර්ථක ජීවිතය"
        },
        {
            "domain": "මවුපිය ගුණ",
            "source": "බැඳීමෙන් මගේ මිදී යන්න දැන් අනන්තේ පුරා",
            "target": "මවුපිය අනාගතය",
            "interpretation": "නිවන ලබාගන්න"
        }
    ]
},
{
    "title": "සදගනාව",
    "singer": [" ධනිත් ශ්‍රී,"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["සන්ජුල හිමාල"],
    "album": "සදගනාව",
    "year": "2019",
    "lyrics": "  උදුල තරු මේ අහස් තලයෙන් වසන් වී වාගේ.. මාර සේනා හදට කැන්දන යාමෙ ලං වූයේ.. මේඝ වර්ශා ගලා හැලුනේ සේද යහනාවේ.. දෝරෙ යන මේ හැගුම් ගoගා ඔහේ සැලුනාවේ..   සදගනාවට සදලුතල සිප.. සුව දෙන යාමයේ.. උණුහුමේ ගිරි තුඩට මීපැණි.. ගෙනේවී රාත්‍රියේ ආයේ..   කාලෙකින් මං ආවෙ නැත්තේ පහල ගං තීරේ.. ඉවුරු තල සිප ගන්න අවසර දේද හිත කීවේ.. ගෙවී යන මේ භවේ, ජීවිත ගානෙ සංසාරේ… මගෙම වී පතිනිය නුඹේ දිවි ගෙවේවා නිබදේ..   සදගනාවට සදලුතල සිප.. සුව දෙන යාමයේ.. උණුහුමේ ගිරි තුඩට මීපැණි.. ගෙනේවී රාත්‍රියේ ආයේ.. ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "උදුල තරු මේ අහස් තලයෙන් වසන් වී වාගේ",
            "target": "රාත්‍රිය",
            "interpretation": "පිරුණු හඳ පෑයු රාත්‍රිය"
        },
        {
            "domain": "රාගය",
            "source": "මාර සේනා හදට කැන්දන යාමෙ",
            "target": "සරාගී සිතුවිලි",
            "interpretation": "සරාගී සිතුවිලි හදේ පිරෙන"
        },
        {
            "domain": "රාගය",
            "source": "දෝරෙ යන මේ හැගුම් ගoගා ඔහේ සැලුනාවේ",
            "target": "හැගීම්",
            "interpretation": "හැගීම් වලට ඉඩකඩ"
        },
        {
            "domain": "රාගය",
            "source": "සදලුතල",
            "target": "පියයුරු",
            "interpretation": "පියයුරු"
        }
    ]
},
{
    "title": "දිගැසියේ",
    "singer": [" ධනිත් ශ්‍රී,"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["ධනිත් ශ්‍රී"],
    "album": "ආලෝකවර්ෂ",
    "year": "2021",
    "lyrics": "   දිගැසියේ දිගැසියේ කොපුල් තෙමා හිටි හැටියේ ඈ ඇවිද ගියා තරු පලසේ හීන මවාලා ඈත ගියා දැන් මා මිය යයි හද ගැස්මේ කොපුල් තෙමා හිටි හැටියේ ඈ ඇවිද ගියා තරු පලසේ හීන මවාලා ඈත ගියා දැන් මා මිය යයි හද ගැස්මේ මායාවන් හංගමි සේයාවක් වත් නොදී ඇගෙ රූ මා ඈතින් වින්දෙමි රූපයේ මන බන්දනී ප්රේමයේ අනුරාගිනී වේදනාවේ මා තනිවෙමි දිගැසියේ දිගැසියේ දිගැසියේ දිගැසියේ රූ අඳුන් ගල්වන්නියේ මා හැඟුම් රිදවන්නියේ රූපයෙන් මන මා මත්වෙමි රාත්රියේ සඳවන් මුවේ නිල් නුවන් සිපගන්නෙමි මේ සිහිනේ මා නවතිමි දිගැසියේ දිගැසියේ දිගැසියේ දිගැසියේ දිගැසියේ දිගැසියේ",
    "metaphors": [{
            "domain": "විරහව",
            "source": "කොපුල් තෙමා",
            "target": "විරහව",
            "interpretation": "ඇඩීම"
        },
        {
            "domain": "විරහව",
            "source": "ඇවිද ගියා තරු පලසේ",
            "target": "වෙන්වීයාම",
            "interpretation": "සරල බවින් මිදීම"
        },
        {
            "domain": "කාන්තාව",
            "source": "සඳවන් මුවේ",
            "target": "මුහුන",
            "interpretation": "පරිපූර්න මුහුන"
        },
        {
            "domain": "ආදරය",
            "source": "සිහිනේ මා නවතිමි",
            "target": "මතකයෙ",
            "interpretation": "මතකයෙ රැදවී"
        },
        {
            "domain": "කාන්තාව",
            "source": "රූපයෙන් මන මා මත්වෙමි",
            "target": "රූපයට",
            "interpretation": "රූපයට ආකර්ශනය වී"
        }
    ]
},
{
    "title": "පන්දම",
    "singer": ["ධනිත් ශ්‍රී"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["ධනිත් ශ්‍රී"],
    "album": "පන්දම",
    "year": "2018",
    "lyrics": "පන්දම රැගෙන යන්න එන්න මා හදවතට නෙතු දැහැන් බිඳිනා රන් සලුව ඇඳ ලියතඹර ලෙලවා හද මඬල යට දෙන්න මැණිකෙ මගෙ පපුවට ගින්දර මේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතී රුවකට නෙත ගැටුණේ කතරක වැසි වැටෙනා දැනේ හදවත පතුලේ යකු බෙර වැයුණේ තම්දෙන තානේනේ නා අනේ මගේ යකුනේ නටපන් හනිකේ තම්දෙන තානේනේ තානේනේ තානානේ   ඉණ වට බැන්දා වූ මුතු පොට සැලෙනකොට පන්දම දැවෙනවා හද ගිනි ලවාගෙන වැහි කළුව එනවා නුඹ නැති දාට සිත් අහසම පුරවා අන්ධකාරෙක මේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතී රුවකට නෙත ගැටුණේ කතරක වැසි වැටෙනා දැනේ මේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතී රුවකට නෙත ගැටුණේ කතරක වැසි වැටෙනා දැනේ හදවත පතුලේ යකු බෙර වැයුණේ තම්දෙන තානේනේ නා අනේ මගේ යකුනේ නටපන් හනිකේ තම්දෙන තානේනේ තානේනේ තානානේ අනේ මගේ යකුනේ නටපන් හනිකේ තම්දෙන තානේනේ තානේනේ තානානේ ",
    "metaphors": [{
            "domain": "රාගය",
            "source": "නෙතු දැහැන් බිඳිනා රන් සලුව",
            "target": "සම",
            "interpretation": "රන් පැහැ සම"
        },
        {
            "domain": "රාගය",
            "source": "දෙන්න මැණිකෙ මගෙ පපුවට ගින්දර",
            "target": "ආදරය",
            "interpretation": "ආදරය බලාපොරොත්තුවීම"
        },
        {
            "domain": "ආදරය",
            "source": "කතරක වැසි වැටෙනා දැනේ",
            "target": "ආදරය",
            "interpretation": "දුර්ලභ සිදුවීම"
        },
        {
            "domain": "ආදරය",
            "source": "හදවත පතුලේ යකු බෙර වැයුණේ",
            "target": "සිතුවිලි",
            "interpretation": "ආදරයෙන් බැදීම"
        },
        {
            "domain": "ආදරය",
            "source": "වැහි කළුව එනවා නුඹ නැති දාට සිත් අහසම පුරවා අන්ධකාරෙක",
            "target": "පාලුව",
            "interpretation": "මුලු සිතම"
        }
    ]
},
{
    "title": "ආලෝකවර්ෂ ගනන්",
    "singer": [" ධනිත් ශ්‍රී"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["ධනිත් ශ්‍රී"],
    "album": "ආලෝකවර්ෂ",
    "year": "2021",
    "lyrics": "  ආලෝකවර්ෂ ගනන් ආලෝකවර්ෂ ගනන් දුර පේන දෑස වසන් දැහැනින් අද මා මුදවන් දිගු නීල දෑස යොමන් නුඹ ආවා මා හීනයේ නවතා   ජීවිතේ ප්‍රාර්ථනා අහසින් තියා නුඹ ගියා හිත් ආකහේ නිල් තාරුකා දෑතින් මගේ විසිරුනා   ආලෝකවර්ෂ ගනන් ආලෝකවර්ෂ ගනන්   ආලෝකවර්ෂ ගනන් ආලෝකවර්ෂ ගනන් දුර පේන දෑස වසන් දැහැනින් අද මා මුදවන් දිගු නීල දෑස යොමන් නුඹ ආවා මා හීනයේ නවතා   ජීවිතේ ප්‍රාර්ථනා අහසින් තියා නුඹ ගියා හිත් ආකහේ නිල් තාරුකා දෑතින් මගේ විසිරුනා   ආලෝකවර්ෂ ගනන් ආලෝකවර්ෂ ගනන් ආලෝකවර්ෂ ගනන් ආලෝකවර්ෂ ගනන්   ජීවිතේ ප්‍රාර්ථනා අහසින් තියා නුඹ ගියා හිත් ආකහේ නිල් තාරුකා දෑතින් මගේ විසිරුනා ",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "ආලෝකවර්ෂ ගනන් දුර පේන දෑස වසන්",
            "target": "බුද්ධිය",
            "interpretation": "කිසියම් දෙයක් පරතරයටම  හැදැරීම"
        },
        {
            "domain": "ජීවිතය",
            "source": "හිත් ආකහේ නිල් තාරුකා දෑතින් මගේ විසිරුනා",
            "target": "සාර්ථකත්වය",
            "interpretation": "සාර්ථකත්වය සුන්වීම"
        }
    ]
},
{
    "title": "එහෙම දේවල් නෑ හිතේ මගේ",
    "singer": ["ධනිත් ශ්‍රී,"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["ධනිත් ශ්‍රී"],
    "album": "එහෙම දේවල් නෑ හිතේ මගේ",
    "year": "2020",
    "lyrics": "  එක රැයකට නුඹ මගේ කරගෙන.. කාසි වලට මං කොහොම මනින්නද.. නුඹව හඬවන නුඹව රිද්දන.. එහෙම දේවල් නෑ හිතේ මගේ..   කරකාර බැඳගෙන මගේ කරගෙන.. නුඹ සිරකරගෙන හීන මවන්නට.. මං වෙනුවෙන් තටු සිඳදාලන්නට.. එහෙම දේවල් නෑ හිතේ මගේ..   අයිතිවාසිකම් නැති නිවහල් වූ.. සෙනෙහස ගලනා මනසක් ඇති වූ.. මිනිසුන් බිහිවූ පොලොවක් නම් මෙය.. කාසි වලට නුඹ දෙන්නේ කොහොමද… ආදරෙ කියලා හිත පිළිගන්නට.. නුඹ තනිකර මගේ වෙන්නම ඕනෙද.. තණ්හා,ආශා නුඹගැන මොකටද.. එහෙම දේවල් නෑ හිතේ මගේ.. ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "තටු සිඳදාලන්නට",
            "target": "නිදහස",
            "interpretation": "නිදහස අහිමි කිරීම"
        },
        {
            "domain": "ආදරය",
            "source": "කාසි වලට නුඹ දෙන්නේ කොහොමද",
            "target": "කාන්තාව",
            "interpretation": "අනාචාරයේ යේදීම"
        }
    ]
},
{
    "title": "ආදරියේ",
    "singer": [" ධනිත් ශ්‍රී,"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["ධනිත් ශ්‍රී"],
    "album": "ආදරියේ",
    "year": "2020",
    "lyrics": "   නුඹගේ චායා රූ අතරේ මා හා ඇදීලා මතකේ පුරා විසිරී ගියා සිත මා සොඳුරේ නුඹ මා දෙස නොබලා බලා ගියදා සසරේ පුරා නුඹ මගෙම තමා සිතුණා ආදරියේ ආදරියේ ආදරියේ ආදරියේ නුඹවේ චන්දා තරු අතරේ පායා දිලෙනා නොදොඩා ගියදා නෙත් අඳුරේ වර්ෂා හැලුනා සැනෙකින් බැඳෙනා සිත මන්මත් කරනා අඟනා නුඹ රූ වරුනා නැත ලොවෙහී කිසිදා දැක මා ආදරියේ ආදරියේ ආදරියේ ආදරියේ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "නුඹවේ චන්දා තරු අතරේ පායා දිලෙනා",
            "target": "ආදරවන්තිය",
            "interpretation": "රූමත්"
        },
        {
            "domain": "විරහව",
            "source": "නෙත් අඳුරේ වර්ෂා හැලුනා",
            "target": "දුක",
            "interpretation": "ඇඩීම"
        }
    ]
},
{
    "title": "වේදිකාවෙ",
    "singer": ["ධනිත් ශ්‍රී"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["මහෙශ් කන්කනිගෙ", "ධනිත් ශ්‍රී"],
    "album": "ආලෝකවර්ෂ",
    "year": "2021",
    "lyrics": "වේදිකාවේ මේ රාත්‍රී යාමේ නුඹ ගැන මතකේ අවදි කලා පාලු යාමේ මදු මී පෙවෙන්නේ නුඹ නැති ලෝකේ තනිව මෙමා ජීවිතේට නුඹ ආව දිනයේම ලංවෙන්න සිතුනාට රෑ මා එක්ක පියමැන්න සිපගත්ත නුඹේ අතගන්න දිවිදෙන්න සිතුනත් මට නුඹ නෑ නෑ අද ළඟ වේදනාවේ මා ගිලෙන්නේ දෙනෙතින් තෙමී කඳුළැල් සලා මං මුලාවේ තනි වී තැවෙන්නේ නුඹ නැති හීනේ උරුම නිසා ජීවිතේට නුඹ ආව දිනයේම ලංවෙන්න සිතුනාට රෑ මා එක්ක පියමැන්න සිපගත්ත නුඹේ අතගන්න දිවිදෙන්න සිතුනත් මට නුඹ නෑ නෑ අද ළඟ",
    "metaphors": [{
            "domain": "විරහව",
            "source": "මදු මී පෙවෙන්නේ",
            "target": "මද්යපානය",
            "interpretation": "මද්යපානය"
        },
        {
            "domain": "විරහව",
            "source": "දෙනෙතින් තෙමී",
            "target": "හැඩීම",
            "interpretation": "නොනවතින හඩමින්"
        }
    ]
},
{
    "title": "නිවාලන්න මා",
    "singer": ["ධනිත් ශ්‍රී,"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["ධනිත් ශ්‍රී"],
    "album": "ආලෝකවර්ෂ",
    "year": "2021",
    "lyrics": "  නිවාලන්න මා.. නිවාලන්න මා..   හිමිවීමක් නැති.. නිමාවක් නැති.. ජීවිතේ පුරා.. කාටවත් නැති ආලයෙන් බැඳී.. හීනයේ නුඹේ.. එක බැල්මක් ඇති..   නිවාලන්න මා.. නිවාලන්න මා.. නිවාලන්න මා.. නිවාලන්න මා..   මා ලය තුරා වැතිරී.. ඈ ගිමන්හරී.. හීනයක්ද මේ.. තාම දන්නැති.. මතකයෙන් ඇදී.. නුඹ හා ගෙවූ දිනේ.. එක මොහොතකුත් ඇති..   නිවාලන්න මා.. නිවාලන්න මා.. නිවාලන්න මා.. නිවාලන්න මා.. ",
    "metaphors": [{
        "domain": "ආදරය",
        "source": "කාටවත් නැති ආලයෙන් බැඳී",
        "target": "ආදරය",
        "interpretation": "බොහො සෙයින් ආදරය"
    }]
},
{
    "title": "ලෝක සිතියම",
    "singer": ["මෙතුන් එස්කේ", "ධනිත් ශ්‍රී"],
    "lyricist": ["මෙතුන් එස්කේ"],
    "composer": ["මෙතුන් එස්කේ", "ධනිත් ශ්‍රී"],
    "album": "ලෝක සිතියම",
    "year": "2022",
    "lyrics": "   Bro, හ්ම් මොනවද අලුත් ප්රශ්න? හ්ම්-ම්ම් හ්ම්-ම්ම් හ්ම්-ම්ම් හ්ම්-ම්ම් හෝ-හෝ හෝ-හෝ හෝ-හෝ හෝ-හෝ ලෝක සිතියම තට්ට තනියම පීරුවා මම ඇත්ත හොය හොය ලෝකෙ කෙලවර දන්නෙ නැතිවම පෙරලුනා ලෝකාන්තයකට වර්ගයා නසාගෙන ස්වර්ගයා හොයා යන මුර්ගයන් ඉන්න ලෝකෙක සොයනවා අපි වසන්තය වේදනා දැකලා හේතුවක් සොයලා වේදනා නැති ලෝකෙක මං සොයා යනවා වේදනා දැකලා හේතුවක් සොයලා වේදනා නැති ලෝකෙක මං සොයා යනවා මල් නෙලාගෙන තුට්ටු දෙක තුන සොයනවා රෑ කෑම වේලට පහු කරන් යන වන්දනා නඩ සොයනවා සුව ආධ්යාත්මික ප්රාන්තේ ඇති වේදනාවට අනන්තේ දුර යන්නෙ මොකටද? වසන්තේ අග මල් පිපෙනකන් නිරන්තරයේ දුක් විඳින්නද? වේදනා දැකලා හේතුවක් සොයලා වේදනා නැති ලෝකෙක මං සොයා යනවා වේදනා දැකලා (වේදනා දැකලා) හේතුවක් සොයලා (හේතුවක් සොයලා) වේදනා නැති ලෝකෙක මං සොයා යනවා වේදනා දැකලා හේතුවක් සොයලා වේදනා නැති ලෝකෙක මං සොයා යනවා වේදනා දැකලා හේතුවක් සොයලා වේදනා නැති ලෝකෙක මං සොයා යනවා කරගහන් එන හේතු ඵල ටික ගෙවනවා තව එකතු කරගෙන ",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "සොයනවා අපි වසන්තය",
            "target": "ජීවිතය",
            "interpretation": "සතුට සෙවීම"
        },
        {
            "domain": "ජීවිතය",
            "source": "වසන්තේ අග මල් පිපෙනකන් නිරන්තරයේ දුක් විඳින්නද",
            "target": "සතුට",
            "interpretation": "ලද දෙයින් සතුටු වීම"
        }
    ]
},
{
    "title": "රෝජා",
    "singer": ["ධනිත් ශ්‍රී"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["සන්ජුල හිමාල", "ධනිත් ශ්‍රී"],
    "album": "ආලෝකවර්ෂ",
    "year": "2021",
    "lyrics": "  රෝජා නුඹ අද හවසත් එනවද රෝජා නුඹ මා තනිකර යනවද රෝජා තව එක බැල්මක් දෙනවද රෝජා නුඹයි ආලේ මාගේ   ආකාසයෙන් ආ ලඳේ.. දෙව්දූකවන් රූපෙ මාගේ.. දෝරේ ගලයි ආදරේ..   මේ රැය නුඹ මා ළඟ නැති හන්දා.. නුඹ ගැන මතකය සිහිනෙක රන්දා.. මා තනියම වින්දේ..   මේ රැය නුඹ මා ළඟ නැති හන්දා.. නුඹ ගැන මතකය සිහිනෙක රන්දා.. මා තනියම වින්දේ..   කඳුරැල්ලේ ලන්දේ පායා සිනාසේ.. මල් වාරේ ඇවිදින් මෙහේ.. දෙකොපුල් විලේහී හසරැල් පිපේවී.. හැඟුමන් හදේ යාවෙවී.. ආලේ හැඟුම්.. ප්‍රේමේ පැතුම්.. ඇතිරූ සිතින් මා මෙහේ.. හිඳිමී ඉතින්.. නෙතුකැන් පියන්.. එයිදෝ සොයා මා කෙරේ..   රෝජා නුඹ තනියම අද එනවද.. රෝජා අද නුඹ මාගේ වෙනවද.. රෝජා නුඹ තව ඈතට යනවද.. රෝජා නුඹයි ආලෙ මාගේ..   ආකාසයෙන් ආ ලඳේ.. දෙව්දූකවන් රූපෙ මාගේ.. දෝරේ ගලයි ආදරේ..   මේ රැය නුඹ මා ළඟ නැති හන්දා.. නුඹ ගැන මතකය සිහිනෙක රන්දා.. මා තනියම වින්දේ..   මේ රැය නුඹ මා ළඟ නැති හන්දා.. නුඹ ගැන මතකය සිහිනෙක රන්දා.. මා තනියම වින්දේ.. ",
    "metaphors": [{
            "domain": "කාන්තාව",
            "source": "දෙව්දූකවන් රූපෙ",
            "target": "රූපය",
            "interpretation": "ලස්සන"
        },
        {
            "domain": "ආදරය",
            "source": "මල් වාරේ ඇවිදින් මෙහේ",
            "target": "ආදරය",
            "interpretation": "ආදර හැගීම් ඇතිවීම"
        },
        {
            "domain": "කාන්තාව",
            "source": "දෙකොපුල් විලේහී හසරැල් පිපේවී",
            "target": "සිනාව",
            "interpretation": "ලස්සනට සිනාසීම"
        }
    ]
},
{
    "title": "පාවී",
    "singer": [" ධනිත් ශ්‍රී,"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["ධනිත් ශ්‍රී"],
    "album": "ආලෝකවර්ෂ",
    "year": "2021",
    "lyrics": "  පාවී යන්න ආකාගේ වැදීලා ලංවී ඉන්න මා හා වෙලීලා ඈගේන් මිදීලා   මේ ගීතේ තාලේ ඇය තැලු හිත නිවා කාලේ අවකාශෙන් මා මුදා ඈතින් ඈතට විසිකලා   නෑසී නුඹ ගිය දා මා දමා අදුරේ කාසී නැතුවට මා ලග දූවිලි සේ මා පිසදමා   මේ ගීතේ තාලේ ඇය තැලූ හිත නිවා කාලේ අවකාශෙන් මා මුදා ඈතින් ඈතට විසිකලා ",
    "metaphors": [{
        "domain": "විරහව",
        "source": "දූවිලි සේ මා පිසදමා",
        "target": "අතහැරීම",
        "interpretation": "ඉක්මනින් අතහැරීම"
    }]
},
{
    "title": "නෞකාවේ",
    "singer": [" ධනිත් ශ්‍රී"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["ධනිත් ශ්‍රී"],
    "album": "නෞකාවේ",
    "year": "2018",
    "lyrics": "  ඇදී යන්නේ  මේ දිගන්තේ මාරුතේ හැපී  මන්දාකිණි හමුවේවිදෝ  අහස් ගග තරණයේ   වසන්තේ  දුරයිදෝ  කෙසේ හෝ ලංවේවිදෝ  අනන්තේ දකියිදෝ  නිම් තෙර හමුවන තුරා   නෞකාවේ  ගමනේ  නෞකාවේ  ගමනේ   තරමක උසට වැඩුනු  හය හතරක ඇඟකට  උරුම කරුවෙකු  නොවන මගෙ පපුවට  ලොකු පොඩි හැම දෙයක්ම දැනුනා  මග බලන බලන තැන  හුස්මට දුවගෙන  තරුම හොයන් යන  මේ දිවි ගමනක  කෙළවර එක බව මට දැනුනා   වසන්තේ  දුරයිදෝ  කෙසේ හෝ ලංවේවිදෝ  අනන්තේ දකියිදෝ  නිම් තෙර හමුවන තුරා   නිමා වෙන්නේ මේ ජීවේ  රිද්මයකට හුරු වූ  හඹා යන්නේ මායාවේ  අතීතයම රැවටු   වසන්තේ  දුරයිදෝ  කෙසේ හෝ ලංවේවිදෝ  අනන්තේ දකියිදෝ  නිම් තෙර හමුවන තුරා   ගමනේ  නෞකාවේ  ගමනේ  නෞකාවේ  ගමනේ   නෞකාවේ  ගමනේ  ඇදී යන්නේ  මේ දිගන්තේ  මාරුතේ හැපී ",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "ඇදී යන්නේ  මේ දිගන්තේ මාරුතේ හැපී",
            "target": "ජීවිතය",
            "interpretation": "බාදක සහිත ජීවිතය"
        },
        {
            "domain": "ජීවිතය",
            "source": "මන්දාකිණි හමුවේවිදෝ අහස් ගග තරණයේ",
            "target": "සතුට",
            "interpretation": "අවිනිශිත සතුට"
        },
        {
            "domain": "ජීවිතය",
            "source": "තරුම හොයන් යන මේ දිවි ගමනක",
            "target": "සාර්ථකත්වය",
            "interpretation": "සාර්ථකත්වය හබායෑම"
        },
        {
            "domain": "ජීවිතය",
            "source": "වසන්තේ දුරයිදෝ",
            "target": "අරමුන",
            "interpretation": "අරමුන අසීරුද"
        }
    ]
},
{
    "title": "ගින්දර",
    "singer": ["රන්දීර්", "ධනිත් ශ්‍රී"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["ධනිත් ශ්‍රී"],
    "album": "ගින්දර",
    "year": "2020",
    "lyrics": "  හීන ආකර හදට කැන්දා මගේ හදවත රැගෙන ගිය ඒ ඇගේ හැඩයම තියෙන රූබරියේ   මගේ මුවගට වැටෙන බිදුවේ හිතේ දුක් ගිනි දියව දියවේ දුවන රුධිරේ මධුවිතට පෙරලේ   ආදරේ ගීතයක්ව පාවී ආවේ රස මාරුතේක මා ගිලුනේ හැරදා ගියත් මා මේ තුන් ලෝකේ නුඹේ රහට මත්වී යමි නිවාඩුවට හඳේ   දැවෙන ගින්දර පපුව ඇතුලේ නිවාගන්නට නුඹ රැඳෙන්නේ මගේ අත උඩ නුඹ රැගුම දෙන්නේ   දුන්න තාලෙට අඩිය තැබුවේ මගේ වන්නමේ නමක් නැත්තේ හිතේ දුක නෑ මට ඉතිරි වෙන්නේ   ආදරේ ගීතයක්ව පාවී ආවේ රස මාරුතේක මා ගිලුනේ හැරදා ගියත් මා මේ තුන් ලෝකේ නුඹේ රහට මත්වී යමි නිවාඩුවට හඳේ ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "හීන ආකර",
            "target": "බලාපොරොත්තු",
            "interpretation": "බලාපොරොත්තු රැසක්"
        },
        {
            "domain": "විරහව",
            "source": "යමි නිවාඩුවට හඳේ",
            "target": "අසිහිය",
            "interpretation": "විරහව නිවාගැනීමට මත්ධ්‍රව‍ය යොදා ගැනීම"
        },
        {
            "domain": "විරහව",
            "source": "ආදරේ ගීතයක්ව පාවී ආවේ",
            "target": "මතක",
            "interpretation": "මියුරු මතක ආවර්ජනය"
        },
        {
            "domain": "ආදරය",
            "source": "රස මාරුතේක මා ගිලුනේ",
            "target": "මතක",
            "interpretation": "මියුරු මතක රසවිදීම"
        }
    ]
},
{
    "title": "දාම්",
    "singer": ["ධනිත් ශ්‍රී"],
    "lyricist": ["නිලර් එම්. කාසීම්"],
    "composer": ["පේශල රවින්දු"],
    "album": "දාම්",
    "year": "2020",
    "lyrics": "  ගලා යයි දැන් හිනා ගගුල වසන්තයේ මල් පිපී මනරම්   මගේ දූ නම් මලක්මයි මටනම්   මලක් වීමට තිබෙන අන්දම කියා දුන්නේ උදා ඉර නම් තාත්තා එහි ඉර තමයි රන්වන්   ආදරේ අහසක් තරම් බව නේද කීවේ ඒත් අම්මා නැතිව කොහොමද හිතාගන්නේ   ආදරේ අහසේ උදා වෙන බව හදයි දන්නේ   දූගේ අම්මා තමයි හද මත හිනා වෙන්නේ   හැන්ගි මුත්තම් සෙල්ලමත් මට එපා වේවී   එන්න අම්මේ මාව අමතක වෙලාවේ දූගේ අම්මා හීනෙනුත් තුරුලුව හිදීවී හෙටත් රහසින් බලං ඉමු හාදුවක් දී   ගලා යයි දැන් හිනා ගගුල වසන්තයේ මල් පිපී මනරම්   මගේ දූ නම් මලක්මයි මටනම්   මලක් වීමට තිබෙන හන්දම කියා දුන්නේ උදා ඉර නම් තාත්තා එහි ඉර තමයි රන්වන් ",
    "metaphors": [{
            "domain": "ලමයින්",
            "source": "ගලා යයි දැන් හිනා ගගුල",
            "target": "සිනසී",
            "interpretation": "දිගටම සිනසී සිටීම"
        },
        {
            "domain": "ලමයින්",
            "source": "මගේ දූ නම් මලක්මයි",
            "target": "දුව",
            "interpretation": "සුන්දරයි"
        },
        {
            "domain": "ආදරය",
            "source": "ආදරේ අහසක් තරම්",
            "target": "ආදරය",
            "interpretation": "අසීමාන්තික ආදරය"
        }
    ]
},
{
    "title": "කොල්ලනෙ යන්",
    "singer": ["බ්ලොක් ඩිනො", "ධනිත් ශ්‍රී"],
    "lyricist": ["ධනිත් ශ්‍රී", "ඩිනො කොරේරා", "ගෙහාන් බ්ලොක්"],
    "composer": ["මහෙශ් කන්කනිගෙ", "ධනිත් ශ්‍රී"],
    "album": "ලොක කුසලානය",
    "year": "2020",
    "lyrics": "  ජය ටැබ කරා අබිමන් දරා එක හදවතින් පියමන් තියා අපි ඉදිරියටම යමු දැන්   කොල්ලනේ ප්ලාස්ටික් බෝතල් විසි කරන්නෙපා   පැරදුම ඇතී දිනුමක් නැතී රෙදි නැති අතීතයට තිත තියා   අපි ඉදිරියටම යමු දැන් කොල්ලනේ   ප්ලාස්ටික් ස්ට්රෝස් බිම දාන්නෙපා   පන්දු යවන්න පොලු ගැලවෙන්න හෙට සිට යං ජය අරගන්න පවතින්නැති ජය පැරදුම එකයි කීවට   ඉඩක් නෑ දැන් නම් පරදින්න මේ යං ඉදිරියටම යං ඒකාලේ වගේ ආයේ නම්බර් 1 වෙනකල් ඉගිලෙන්න   තටු නැතුවට අපේ කොල්ලොන්ට බෝලෙයි බැට් එකයි ඇති මේ ලෝකේ ජයගන්න   හරි දනිත් ඇති ප්ලාස්ටික් ගැන කතා කරමු අපි යන යන තැන ප්ලාස්ටික් විසි කරන ජරා ගති කුනු බාල්දිය පෙනි පෙනි බිම දාන සක්කිලි   අම්මා ගහයි බැට් එකෙන් මෙහෙම ගියොත් තොපි කොල ඉදුල් ප්ලාස්ටික් එකට මික්ස් කරන කොට ඒවා එකතු වෙන්නේ මේ මහ පොලවට   වතුරට ඇල දොල ගං මුහුදට මෙහෙම ගියොත් ප්ලාස්ටික්මයි කන්න වෙන්නේ තොට   ජය ටැබ කරා අබිමන් දරා එක හදවතින් පියමන් තියා අපි ඉදිරියටම යමු දැන්   යෝගට් කාල හැදි කප් වෙරලට දාන්නෙපා   පැරදුම ඇතී දිනුමක් නැතී රෙදි නැති අතීතයට තිත තියා   අපි ඉදිරියටම යමු දැන් කොල්ලනේ   කොන්ඩම්ස් හොදයි හැබැයි ඒවා විසිකරන්න එපා   මුලු ලෝකෙත් එක්ක කරට කර සිංහයෝ රග දෙනවා පිටිය මැද 2022 අද ජය කනුව ලග සිංහ කොඩිය ගහනවා අනිවාර්‍යෙන්ම මොකද ශ්‍රී ලංකන් කොල්ලෝ හරිම වසයි යකඩ බෝල 2 3 4 පලයි එක පිට එක බැට කෑවත් ඊයේ ලමයි අඩියෙන් අඩිය තියලා හරි නැගිටිනවා මයි   ආයුබෝවන් සියලුම ක්‍රිකට් ෆෑන්ස් ලට අපි ආදරෙයි ජෙන්ඩ්ල්මන්ස් ක්‍රීඩාව අතීතයේ ප්‍රොඋඩ මතක් වෙනවා නේ තාමත් ආයේත් තියමු එක අකුරක් නෑරම   ටීම් එක ඇති ජර්සිය ගැන කතා කරමු අපි රීසයිකල්ඩ් ප්ලාස්ටික් වලින් මහලා පට්ට ගති බෝතල් 30000ක් පොලිඑස්ටර් කලා පටි   එහෙම තමයි ගැහුවේ ගේම හිතට ගොඩක් හතී වෙනස් වෙන්න ඕන කියලා වෙනස වෙමූ අපි   මදර් නේචර්ට මල පැන්නොත් කන්න වෙන්නේ ටොපි ප්ලාස්ටික් ඇති ටීම් එකට සප් එක දෙමු අපි මෙන්න දුන්නා බැට් එක ගහපහං දනිත් සිරි   ශ්‍රී නොට් සිරි අම්මටසිරි සොරි   කොල්ලනේ යං ඒකාලේ වගේ අයෙමත් නම්බර් 1 වෙනකන් ප්ලාස්ටික් පාවිච්චි කරන්නේපා වර්ල්ඩ් කප් එක දිනන්න හැබයි ප්ලාස්ටික් පාවිච්චි කරන්නෙපා   ජය ටැබ කරා අබිමන් දරා එක හදවතින් පියමන් තියා අපි ඉදිරියටම යමු දැන් කොල්ලනේ   පැරදුම ඇතී දිනුමක් නැතී රෙදි නැති අතීතයට තිත තියා   අපි ඉදිරියටම යමු දැන් කොල්ලනේ ",
    "metaphors": [{
        "domain": "දේශය",
        "source": "රෙදි නැති අතීතයට",
        "target": "අතීතය",
        "interpretation": "ලෑජ්ජාශිලී අතීතය"
    }]
},
{
    "title": "ලක්මවුනි",
    "singer": ["ධනිත් ශ්‍රී", "රිද්ම", "සුපුන් පෙරේරා", "මිහින්දු", "කාන්චනා"],
    "lyricist": ["සවින්ද්‍ර මදුශාන්", "ඉන්දුමිනි සිරිවර්දන", "කිශව්න්"],
    "composer": ["රන්ග වීරසේකර"],
    "album": "ලක්මවුනි",
    "year": "2021",
    "lyrics": "  [රිද්ම] විකසිත වී නිති එකමුතු වී සවිබල පා සැම එඩිතර වී  රුහිරය දී දිනු ලක් මව්නී ගරුකල සේ නුඹ සෙවනෙ හිදී දරුකැල සේ නුඹ සෙවනේ හිදී    පියමනිනා රළු මාවත දිගේ ජය ටැබ වේ දද බදීනා දිනේ   [සුපුන් පෙරේරා] නිම නොවෙනා හද මඩලේ සෙනේ නිති සැදුනේ එක මව්නේ   [කාන්චනා] බිද දමලා රළු පවුරු බැදී මිතුදම වේ අප අතරෙ සැදී   [සුපුන් පෙරේරා] මනු දෙරණේ නොම නොගැටි අපී ලොව දිනමූ සිහ ජය ගොස දී   [රිද්ම ; කාන්චනා] ලොව දිනමූ සිහ ජය ගොස දී    පියමනිනා රළු මාවත දිගේ ජය ටැබ වේ දද බදීනා දිනේ   නිම නොවෙනා හද මඩලේ සෙනේ නිති සැදුනේ එක මව්නේ    රතු රුහිරේ ලයෙ සැරුවේ අපේ කුමකට දෝ පිල් බෙදිලා මෙසේ    ලග දකිනා නෙතු පිසදාලා    අපි සැවොමා එක රැහැනේ වෙලී    අපි සැවොමා එක රැහැනේ වෙලී   පිය මනිනා ජය මාවත දිගේ අපි සැවොමා එක් වී ",
    "metaphors": [{
            "domain": "දේශය",
            "source": "නිම නොවෙනා හද මඩලේ සෙනේ",
            "target": "ආදරය",
            "interpretation": "අසීමාන්තික ආදරය"
        },
        {
            "domain": "දේශය",
            "source": "බිද දමලා රළු පවුරු",
            "target": "වෙනස්කම්",
            "interpretation": "වෙනස්කම් අමතක කර"
        }
    ]
},
{
    "title": "ප්‍රාතිහාරි",
    "singer": ["සුපුන් පෙරේරා"],
    "lyricist": ["ශෙහාන් ගලහිටියාව"],
    "composer": ["සේනන්ග දිස්සානායක"],
    "album": "ප්‍රාතිහාරි",
    "year": "2019",
    "lyrics": "  ප්‍රාතිහාරී නුරා ගේනා  මීන දෑසේ මවා ආශා  රූපසාරි මැවී පේනා  චන්ද්‍රශෝභා රසේ පානා  මනආශා රටා පානා  හිත පෑහී සොබා ගේනා   නේත්‍රා මානනා  සිත පාරා පෑ සිනා  සීමා නෑ සිතා  ඉඟි පානා දෑසිනා  සිහින යායේ සරා මා හා  එනවාදෝ මවා සේයා  ප්‍රේම හීනේ සොබා ගේනා   සේයා රෑගෙනා  නිම නේනා කාරණා  ඡායා රූ මවා  නෙතු පේනා රෑ දිවා  සිහින යායේ සරා මා හා  එනවාදෝ මවා සේයා  ප්‍රේමහීනේ සොබා ගේනා ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සිහින යායේ සරා මා හා",
            "target": "කාන්තාව",
            "interpretation": "සිහිනෙන් පෙනෙන"
        },
        {
            "domain": "ආදරය",
            "source": "නෙතු පේනා රෑ දිවා ",
            "target": "කාන්තාව",
            "interpretation": "නිරතුරු සිහිවෙන"
        }
    ]
},
{
    "title": "මහමායා",
    "singer": ["සුපුන් පෙරේරා", "චරිත අත්තලගේ"],
    "lyricist": ["චන්ද්‍රසේන තලන්ගම"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "මහමායා",
    "year": "2020",
    "lyrics": "  නිස්සාර වූ සංසාරයේ දුක් වේදනා මිදෙනා නියා..  පුතුනූ අපේ හැරදා ගියේ යසෝදරා හා බිළිඳු පුතා..   කම්පා නොවන් සඳ මහාමායා..කුමාරයා හැරදා ගියා..  තුන්ලෝ උතුම් බුදු පදවි පතා..  කුමාරයා හැරදා ගියා   මහාමායා…   රුදු සසර ගිනී  බුදු ඇසට පෙනී  ගිනි නිවන මෙනී  වැසි වසිනු වැනී..   අඩුවක් වුනාදෝ ජීවිතේ  ඉසුරින් පිරී මේ මාලිගේ  ගැටුමක් ඇතැයි සිතුනා සිතේ  හැරදා ගියේ ඇයි මාලිගේ..   සදහම් අමා වැහී හෙලනා රඟේ  නොසැලී බලන් මහාමායා…  සසරින් මිදී පුතූ වඩිනා රඟේ  නොසැලී බලන් මහාමායා..   මහාමායා… මහාමායා…  කම්පා නොවන් මහාමායා…  මහාමායා… මහාමායා…  කම්පා නොවන් මහාමායා…  ",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "රුදු සසර ගිනී",
            "target": "දුක් දොම්නස්",
            "interpretation": "නිම නොවෙන දුක් දොම්නස්"
        },
        {
            "domain": "ජීවිතය",
            "source": "වැසි වසිනු වැනී",
            "target": "සත්‍ය",
            "interpretation": "සත්‍ය අවබෝධයෙන් ලැබෙන නිදහස"
        }
    ]
},
{
    "title": "මා ප්‍රාර්තනාවේ",
    "singer": ["සුපුන් පෙරේරා"],
    "lyricist": ["සුපුන් පෙරේරා"],
    "composer": ["සුපුන් පෙරේරා"],
    "album": "හතේ හත",
    "year": "2022",
    "lyrics": "  ඔබ ගීයක් වී ආවේ වස්සාන කාලේ හද මාරුතේ ගිනි නිවා සිත සිහිලැල් වූ යාමේ රෑ තාරකාවේ අපෙ ආදරේ එහි ලියා   මා ප්‍රාර්ථනාවේ ඈ දෑස දැල්වේ ලැමැදේ මගේ ඈ හොවා ඈ ප්‍රාර්ථනාවේ මා මුවඟ ගොලුවේ දුරකින් දුකින් මා දවා   පෑ එදා ආලවන්තයේ සිනා දෑසින් රහසින්ම යා වුණා පෑ එදා ආලවන්තයේ දෑසින් රහසින්ම යා වුණා දිවුරා කියන්නම් ස්නේහේ නමින් අරමුණ මගේ ඔබ වුණා   මා ප්‍රාර්ථනාවේ ඈ දෑස දැල්වේ ලැමැදේ මගේ ඈ හොවා   රෑ පුරාම හීන පීරලා නෑනේ තාම අපිව හමුවෙලා හාදු එව්වේ සුලඟේ දවටලා   හංග හංග උන්නු කාරණා නින්ද නේන රෑක එලිවුණා ආපු දුරක මතකේ සිහිවුණා   පාර කියපු ගීතේ තනුව මා සදා වුණා   මා ප්‍රාර්ථනාවේ ඈ දෑස දැල්වේ ලැමැදේ මගේ ඈ හොවා ඈ ප්‍රාර්ථනාවේ මා මුවඟ ගොලුවේ දුරකින් දුකින් මා දවා ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "ඔබ ගීයක් වී ආවේ වස්සාන කාලේ",
            "target": "මිහිරක්",
            "interpretation": "සොදුරු ආදරය"
        },
        {
            "domain": "ආදරය",
            "source": "ඈ දෑස දැල්වේ",
            "target": "බලපොරොත්තු",
            "interpretation": "බලපොරොත්තුවලින් පිරීම"
        },
        {
            "domain": "ආදරය",
            "source": "දෑසින් රහසින්ම යා වුණා",
            "target": "ආකර්ෂණය",
            "interpretation": "නොදැනී ආකර්ෂණය"
        },
        {
            "domain": "ආදරය",
            "source": "හාදු එව්වේ සුලඟේ දවටලා",
            "target": "ප්‍රේමය",
            "interpretation": "අප්‍රකාශිත ප්‍රේමය"
        }
    ]
},
{
    "title": "නාදෙන්",
    "singer": ["කාන්චනා අනුරාදි", "සුපුන් පෙරේරා"],
    "lyricist": ["දුලන්ජ අල්විස්"],
    "composer": ["චමත් සන්ගීත්"],
    "album": "නාදෙන්",
    "year": "2022",
    "lyrics": "  නෑ නෑ නැවතුන මේ හිත නුඹ ළඟ වෙනතක නතර වෙලා.. මා හා ඉඟිබිඟි පානා නුඹෙ නෙත දැක හිත ඔකඳ වෙලා..   හද නිම් නාදෙන් නාදෙන් නාදෙන් නාදෙන් නාදෙන් මත් වෙන්නා.. හැඟුමන් ආ දෙන් ⁣යා වෙම් නුඹේම වෙලා..ලා ලලා   හද නිම් නාදෙන් නාදෙන් නාදෙන් නාදෙන් නාදෙන් මත් වෙන්නා.. හැඟුමන් ආ දෙන් ⁣යා වෙම් නුඹේම වෙලා..ලා ලලා   දෙවඟන ඈ.. රැවකට නැවතී මා පෙර නෑ නාහෙට නාහන මේ හද නෑ.. සිහියක හිඳවනු බෑ දැක නාරී නාරී නාරී (දේහේ ඈ)   දිනකර ඈ මන පිනිබිඳුවකි මා ළග ඈ සිලුවකි ගිනි දවනා ගත රෑ.. සමවැද හිදිනට බෑ මිදි දෑනෙන් දෑනෙන් දෑනෙන් ආයේ..   දේවී ප්‍රේමී හැඟුමන් පා වේවී හෘදේ ලැගුමන් මා.. මේ නෙත් මානෙන් නොම යන් මාගෙන් මාගෙන් මාගෙන්   දේවී ප්‍රේමී හැඟුමන් පා වේවී හෘදේ ලැගුමන් මා.. මේ නෙත් මානෙන් නොම යන් මාගෙන් මාගෙන් මාගෙන්   හද නිම් නාදෙන් නාදෙන් නාදෙන් නාදෙන් නාදෙන් මත් වෙන්නා.. හැඟුමන් ආ දෙන් ⁣යා වෙම් නුඹේම වෙලා..ලා ලලා..   හද නිම් නාදෙන් නාදෙන් නාදෙන් නාදෙන් නාදෙන් මත් වෙන්නා.. හැඟුමන් ආ දෙන් ⁣යා වෙම් නුඹේම වෙලා..ලා ලලා..   දේවී ප්‍රේමී හැඟුමන් පා වේවී හෘදේ ලැගුමන් මා.. මේ නෙත් මානෙන් නොම යන් මාගෙන් මාගෙන් මාගෙන්   දේවී ප්‍රේමී හැඟුමන් පා වේවී හෘදේ ලැගුමන් මා.. මේ නෙත් මානෙන් නොම යන් මාගෙන් මාගෙන් මාගෙන්   නෑ නෑ නැවතුන මේ හිත නුඹ ළඟ වෙනතක නතර වෙලා.. මා හා ඉඟිබිඟි පානා නුඹෙ නෙත දැක හිත ඔකඳ වෙලා ",
    "metaphors": [{
            "domain": "කාන්තාව",
            "source": "දෙවඟන ඈ",
            "target": "කාන්තාව",
            "interpretation": "ලස්සන"
        },
        {
            "domain": "කාන්තාව",
            "source": "දිනකර ඈ",
            "target": "කාන්තාව",
            "interpretation": "ලස්සන"
        },
        {
            "domain": "ආදරය",
            "source": "සිලුවකි ගිනි දවනා ගත රෑ",
            "target": "සිතුවිලි",
            "interpretation": "උද්යෝගිමත් සිතුවිලි"
        }
    ]
},
{
    "title": "ලටින් කන්කාරියා",
    "singer": ["චරිත අත්තලගේ", "හශානි වාසනා"],
    "lyricist": ["ප්‍රතාප් එශ්"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "ලටින් කන්කාරියා",
    "year": "2021",
    "lyrics": " නුඹට පානා හනික කෝපේ නමට පමණා කරුම දීගේ පිපිණු තිසරුන් මගදි දුටුවැයි පැලුණු ඒ උකුල් නොදැක කොහොමැයි පිරිමි ඔහොමයි මුගුර නරකයි උකස් දුන් හෘදේ නුඹටා ඇහැට ගැටෙනා තැනක මානේ ගැහැණු අගුණා මෙමට කීවේ ඇති හොඳටම බේගලේ ලොකු කෑදරේ නොදන්නවා නොවේ කෝ ඔය බොරු ආදරේ රෑ කාමරේ ඉහ උඩ හෙලු මාලිගේ අන්තඃපුරේ උඩැක්කියක් නොවේ මා බිසවකි කඳුකරේ ඒ රජපෙලේ ගැහැණු රවටා බෝමා කැටුව ආ දා මා පණට සේමා නුඹට ප්රේමේ පණට පණ හා සේමා ගැහැණු බෝමා කනට කර මා මටලු ප්රේමේ ඇති දැන් මගෙ දේසනේ ගත බීසනේ ගිනි ගන්නවා වගේ බෝ අවුලයි පෑ සෙනේ හද ආසනේ අව්වැහි වැටෙනා ලෙසේ ධර්මේ ලොවේ පිරිමින් යටයි කොහේ කාටත් ඇති කෑදරේ රති සාගරේ මගේ පෙරදා පවටා නුඹේ පිනටා දෙගුරු රවටා එන්ට ආවේ දෙගුරු පෙරදා රවටා දුගී පැලටා එන්ට කියලා ඇයිද කීවේ නුඹට පානා හනික කෝපේ පිපිණු තිසරුන් මගදි දුටුවැයි පැලුණු ඒ උකුල් නොදැක කොහොමැයි පිරිමි ඔහොමයි මුගුර නරකයි උකස් දුන් හෘදේ නුඹටා ඇහැට ගැටෙනා තැනක මානේ ගැහැණු අගුණා මෙමට කීවේ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "උකස් දුන් හෘදේ නුඹටා",
            "target": "ආදරය",
            "interpretation": "ආදරය නොඅඩුව ලබාදීම"
        },
        {
            "domain": "ආදරය",
            "source": "ඉහ උඩ හෙලු මාලිගේ",
            "target": "බලාපොරොත්තු",
            "interpretation": "බලාපොරොත්තු රැසක්"
        },
        {
            "domain": "ආදරය",
            "source": "ගත බීසනේ ගිනි ගන්නවා",
            "target": "කේන්තිය",
            "interpretation": "කේන්තිය දැවීම"
        },
        {
            "domain": "ආදරය",
            "source": "අව්වැහි වැටෙනා ලෙසේ",
            "target": "හැගීම් වෙනස්වීම",
            "interpretation": "හැගීම් ඉක්මන් වෙනස්වීම"
        }
    ]
},
{
    "title": "හදිසිද මන්දා",
    "singer": ["කාන්චනා අනුරාදි"],
    "lyricist": ["ධනිත් ශ්‍රී"],
    "composer": ["ධනිත් ශ්‍රී", "කාන්චනා අනුරාදි"],
    "album": "හදිසිද මන්දා",
    "year": "2021",
    "lyrics": "  සුන් විච්ච හද ගැස්ම පාරා නැගේ හද ගිනි ජාලා අහිමි නුඹ සිහි කලා මා අනිසියී දැන් පෙම් ආශා   කන්නගී නම් මා වියෝ දුකින් හද පරදා ඇවිලී ශාපයෙන් ගම් නැසුනා අනේ මං හදිසිද මන්දා   හිස් වෙච්ච මනු ලෝක දුටු දා දැනේ නැතිවීම සපුරා තනිවී සිතමී මා පෙරලා කොහෙදෝ මහදේ අනුකම්පා   කන්නගී නම් මා වියෝ දුකින් හද පරදා ඇවිලී ශාපයෙන් ගම් නැසුනා අනේ මං හදිසිද මන්දා ",
    "metaphors": [{
        "domain": "විරහව",
        "source": "හද ගිනි ජාලා",
        "target": "දුක",
        "interpretation": "දැවෙන දුක"
    }]
},
{
    "title": "රචනය",
    "singer": [" දිනෙශ් ගමගේ,"],
    "lyricist": ["දිනෙශ් ගමගේ"],
    "composer": ["විරෙශ් කූරෙ"],
    "album": "රචනය",
    "year": "2019",
    "lyrics": "  නහර වෙලෙන මේ අව්ව දව්ව රත්කරගෙන යන්න පවුල කවුද කැඩුවෙ කවුද හැදුවේ රවුම වට රවුම හවුලේ කද්දී කැවුම මුං කැවුම   හා හා පහු වෙද්දී මට විනිමත් කලන්තේ වගෙ මං අල්ලන්න කවුරුත්ම නෑ තව දුරද කොළඹ පෙනි පෙනිම හා යන්නෙ මං තදකරන් හිත තද හා   මගේ රචනය මම මයි ලිව්වෙ මගේ රචනය මම මයි හැදුවේ මගේ රචනය මම මයි බැලුවේ තරුවක් නෑ බීජය දුන්නෙ තරු පෙනෙන්න සමාජ දුන්නෙ කන පිරෙන්න මොනවද ඇහුනේ   නුවරඑළියෙන් ආවා වංගු දිග වැඩි හින්දා කොළඹ පැතලිද මන්දා නුවරඑළියෙන් ආවා වංගු දිග වැඩි හින්දා කොළඹ පැතලිද මන්දා   ගියා ටවුන් හෝල් සෙනග අතරේ පීරල හෙව්ව කොන්ඩෙ දිග ඇය කෝ රැය කෝ රිය කෝ නෑයෝ කෝ නෑයෝ කෝ කලාව මගේ වෙලාව මගේ කතාව ලියද්දී හිනාව මගේ පනාව වගේ මනාව පැහැදිලි කරගත්තේ වටිනාකම මගේ   හා හා සල්ලී සල්ලී මෙහෙ පිස්සු නටයි දැන් මල්ලී මල්ලී ලේන් එකෙ යන්නෙ දැන් ලේන් එකෙ දැන් ලේන් එකෙ දැන් ලේන් එකෙ දැන්   මගේ රචනය මම මයි ලිව්වෙ මගේ රචනය මම මයි හැදුවේ මගේ රචනය මම මයි බැලුවේ තරුවක් නෑ බීජය දුන්නෙ තරු පෙනෙන්න සමාජ දුන්නෙ කන පිරෙන්න මොනවද ඇහුනේ     ",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "රචනය",
            "target": "ජීවිතය",
            "interpretation": "අපට හැකි අයුරින් වෙනස් කල හැකි ජීවිතය"
        },
        {
            "domain": "ජීවිතය",
            "source": "තරුවක් නෑ බීජය දුන්නෙ",
            "target": "උරුමයක්",
            "interpretation": "ධන සම්පත් උරුමයක් නැත"
        },
        {
            "domain": "ආදරය",
            "source": "කන පිරෙන්න මොනවද ඇහුනේ",
            "target": "බනිනවා",
            "interpretation": "නොඅඩුව බනිනවා"
        }
    ]
},
{
    "title": "හිතන තරම්",
    "singer": ["ගයාන් පෙරේරා", "චරිත අත්තලගේ"],
    "lyricist": ["ගයාන් පෙරේරා"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "හිතන තරම්",
    "year": "2022",
    "lyrics": "  හිතන තරම් මගෙ හිත හඩන තරම් ඔබ මට කීයූ වදන් මට අහෙන තරම් නිල් අහස බලන් සිහින අපි මැව්ව තරම් දිව්රුවේ මියෙදෙන්නට නම් වෙන කෙනෙකු ඇයි තුරුලු කරන්   මගෙ ලේ දහඩියෙන් පොළව තෙමුවා මුලු දිවියම කැප කෙරුවා   ඔබට ඔබට ඔබට මතක නැතිද   ඔබට ඔබට ඔබට මතක නැතිද උඹ ඇවිත් ගිය සැනින් මගේ ළයමඩලම පාරා කලා සංකරයක් ඒ මොහොත කල්පයක් කල, කාලය!! උඹෙත් නෑ සංවරයක් අපේ මතකයන් මැදියමේ ලුහු බඳී බැඳ ගනින් උඹ යන්තරයක් හෘදසාක්ෂිය පහර දෙයි සොඳුර හොයාගනින් දැන් බංකරයක්   මගේ තුරුලෙම ඉඳන් වෙන තුරුලකට කෝම පුරුදු වෙලා සඳ උඹේ, රැයේ තැවරුණු වළාබැමි දහවල පෙනෙයි මට කිලිටු වෙලා උඹ අතරමං කරපු කඳුලැලි පවා හොයයි ගලන්න මංමාවත් උදුරාගෙන ගියා මගේ පියාපත් සුනු විසුනුව ගැටුනා උඹ සප්ත කන්‍යාවක්   සුන්බුන් වුනු හද මගේ අතු ගාල දැම්ම උඹ පෑල දොරෙන් මගේ දහදියේ කිමිදිලා වෙනකෙකු එක්ක උඹ නෑවත් හොරෙන්   අපි ගැන්න තරු, තකහනිකයක් විත් කේලම් කිව්වේ උඹව අඳුනාගෙන සඳ සයනක ගත වෙද්දී මුලු රැයක් ඇවිලෙන්නේ හිරු කරබාගෙන   උඹ උදුරගත්තේ මගේ සේසත බිඳලයි පපු කැටයෙන් ඔය දෑසම උඹේ තීරණ ගැන දොස් කිව්වා මා එක්ක සැකයෙන්  එදා මා ලියූ දුක් ගැනිවිලි කොලවල, සදාදර උඹේ මතක ඔතන් මෙහෙ අදිනවා මං, යදිනවා උඹේ සයනට වැහි අකුණු කොටන්   වැහි අකුණු කොටන් සුලග එයි ඔබේ සුවඳ අරන් දුක් ගිනි හදේ දරන් ඔබව සෙව්වා හතර වරන්   කඳුළු සැලෙයි පිටාර ගලන් දෙවියෝ නෑ මට දෙන්නේ සවන් එක් මොහොත කල්පයක් තරම් හැගෙයි ඔබ ගිය දිනය පටන්   මගෙ ලේ දහඩියෙන් පොළව තෙමුවා මුලු දිවියම කැප කෙරුවා   ඔබට ඔබට ඔබට මතක නැති ද   ඔබට ඔබට ඔබට මතක නැතිද   මගේ තුරුලෙම ඉඳන් වෙන තුරුලකට කෝම පුරුදු වෙලා සඳ උඹේ, රැයේ තැවරුණු වළාබැමි දහවල පෙනෙයි මට කිලිටු වෙලා උඹ අතරමං කරපු කඳුලැලි පවා හොයයි ගලන්න මංමාවත් උදුරාගෙන ගියා මගේ පියාපත් සුනු විසුනුව ගැටුනා උඹ සප්ත කන්‍යාවක් ",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "මගෙ ලේ දහඩියෙන් පොළව තෙමුවා",
            "target": "මහන්සිය",
            "interpretation": "කැපවීමෙන් වැඩ කිරීම"
        },
        {
            "domain": "ජීවිතය",
            "source": "සුන්බුන් වුනු හද මගේ",
            "target": "බලාපොරොත්තු",
            "interpretation": "බලාපොරොත්තු නැති වීම"
        },
        {
            "domain": "ජීවිතය",
            "source": "දෙවියෝ නෑ මට දෙන්නේ සවන්",
            "target": "පිහිට",
            "interpretation": "පිහිට වීමට කවුරුත් නැ"
        },
        {
            "domain": "ජීවිතය",
            "source": "උදුරාගෙන ගියා මගේ පියාපත්",
            "target": "නිදහස",
            "interpretation": "නිදහස නැති වීම"
        },
        {
            "domain": "විරහව",
            "source": "යදිනවා උඹේ සයනට වැහි අකුණු කොටන්",
            "target": "හැරගිය කාන්තාව",
            "interpretation": "අයහපතක් ප්‍රාර්ථනා කරනවා"
        }
    ]
},
{
    "title": "දුර ආකහෙ",
    "singer": ["චරිත අත්තලගේ", "රවි ජේ"],
    "lyricist": ["චන්ද්‍රසේන තලන්ගම"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "දුර ආකහෙ",
    "year": "2020",
    "lyrics": "   හිටි හැටියේම ඇද හැලුණු වැස්ස වගෙයි ඔබ හමුවූයේ කවදාද මතක නැතෙයි ඒ හැමදේම සිහිවෙද්දී හිතට දුකයි අප හමුවූයේ මොනවටද කියලා හිතෙයි අප හමුවූයේ මොනවටද කියලා හිතෙයි අප හමුවූයේ මේ හඳපාන, මේ තරු රෑන මේ හඳපාන, මේ තරු රෑන හඳපාන තරු රෑන ඔච්චම් කලයි මට ඔච්චම් කලයි හැමදාම ඔය මුහුණ මතකේ තියෙයි මට මතකේ තියෙයි දුර ආකාහේ රෑ හැමදාම දුර ආකාහේ රෑ හැමදාම දුර බලං අපි අපිව හෙව්වා දිලිසෙන තරුවල අපිව මැව්වා අර තරුව නුඹ, අර තරුව මම ඈත බලාගෙන නුඹ ආකාසෙට කිව්වා, ඒත් නුඹ මා හා පරතරය අතරක ඇති දුර අලෝක වර්ෂ නුඹ දකින්නෙ අද, මගෙ අතීතය නිවි-නිවි දැවෙන්නෙ මගෙ අතීතය මතකෙට ඒනා මතකේ වියෝවක් වන බව දැන උන්නා මගදි මං කෝමත් ගැලපෙන තෙක් බලා උන්නා මෙතෙක් දුරට ඒත් අපෙ හිත් ගැලපුනෙ නැතේ හැමදේම වෙන්නෙ ආදරේකට වඩා දෙන්නෙක් අතර ඇති අවබෝධෙ මත මම හෙව්වෙ මාව ඔයා මාව හොයාගනිද්දි දුර තරුවෙලා කලුකුහර හඳපාන තරු රෑන ඔච්චම් කලයි මට ඔච්චම් කලයි හැමදාම ඔය මුහුණ මතකේ තියෙයි මට මතකේ තියෙයි හිටි හැටියේම ඇද හැලුණු වැස්ස වගෙයි ඔබ හමුවූයේ කවදාද මතක නැතෙයි ඒ හැමදේම සිහිවෙද්දී හිතට දුකයි අප හමුවූයේ මොනවටද කියලා හිතෙයි අප හමුවූයේ මොනවටද කියලා හිතෙයි අප හමුවූයේ දුර ආකාහේ රෑ හැමදාම දුර ආකාහේ රෑ හැමදාම ඔයා ගැන මං මැව්ව ඔයා වෙනුවෙන් කිව්ව ඔයා ගැන විඳගන්න ප්රසංගයට එන්න ඔයා වෙනුවෙන් මැව්ව ඔයා ගැන මම කිව්ව ඔයා ගැන විඳගන්න ප්රසංගයට එන්න",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "හිටි හැටියේම ඇද හැලුණු වැස්ස",
            "target": "ආදරය",
            "interpretation": "අනපේක්ශිත ආදරය"
        },
        {
            "domain": "විරහව",
            "source": "තරුවෙලා කලුකුහර",
            "target": "බලාපොරොත්තු",
            "interpretation": "කඩවුනු බලාපොරොත්තු"
        },
        {
            "domain": "ආදරය",
            "source": "දුර බලං අපි අපිව හෙව්වා දිලිසෙන තරුවල අපිව මැව්වා",
            "target": "බලපොරොත්තු",
            "interpretation": "බලපොරොත්තු සහිත අනාගත සැලැස්ම"
        }
    ]
},
{
    "title": "දොලෙ",
    "singer": ["චරිත අත්තලගේ"],
    "lyricist": ["චන්ද්‍රසේන තලන්ගම"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "දොලෙ",
    "year": "2020",
    "lyrics": "  ගහපං මල්ලියේ  ඩෝලෙ අරන් තාලෙටා  විදින්න සිංදුව  ආලේ බැදේ ප්‍රාණේ ටා   ගහපං මල්ලියේ  ඩෝලෙ අරන් තාලෙටා  විදින්න සිංදුව  ආලේ බැදේ ප්‍රාණේ ටා   කකියන ආලේ හොයන  හිටගෙන හීන මවන  කකියන ආලය  හිටගෙන හීනය නුඹ  හිමිහිට සිංදු කියනවා  බොරුවට රවලා බලනවා   කකියන ආලේ හොයන  හිටගෙන හීන මවන  කකියන ආලය  හිටගෙන හීනය නුඹ  හිමිහිට සිංදු කියනවා  බොරුවට රවලා බලනවා  බොරුවට රවලා බලනවා   ගහපං මල්ලියේ  ඩෝලෙ අරන් තාලෙටා  විදින්න සිංදුව  ආලේ බැදේ ප්‍රාණේ ටා   ගහපං මල්ලියේ  ඩෝලෙ අරන් තාලෙටා  විදින්න සිංදුව  ආලේ බැදේ ප්‍රාණේ ටා   ඉග සුග සැලෙන ලෙලෙන  යන එන ගමන බිමන  ඉග සැලෙන ලෙලෙන  යන ගමන බිමන නුඹේ  ඇස් දෙක ගිනි විසි වෙනවා  නොකියන රහස කියනවා   ඉග සුග සැලෙන ලෙලෙන  යන එන ගමන බිමන  ඉග සැලෙන ලෙලෙන  යන ගමන බිමන නුඹේ  ඇස් දෙක ගිනි විසි වෙනවා  නොකියන රහස කියනවා  නොකියන රහස කියනවා   ගහපං මල්ලියේ  ඩෝලෙ අරන් තාලෙටා  විදින්න සිංදුව  ආලේ බැදේ ප්‍රාණේ ටා   ගහපං මල්ලියේ  ඩෝලෙ අරන් තාලෙටා  විදින්න සිංදුව  ආලේ බැදේ ප්‍රාණේ ටා     ",
    "metaphors": [{
        "domain": "ආදරය",
        "source": "ඇස් දෙක ගිනි විසි වෙනවා",
        "target": "ආශාව",
        "interpretation": "ඉවසීම නැති ආශාව"
    }]
},
{
    "title": "ප්‍රකම්පිත",
    "singer": ["සුපුන් පෙරේරා"],
    "lyricist": ["ශෙහාන් ගලහිටියාව"],
    "composer": ["නිමෙශ් කුලසින්ඝ"],
    "album": "දරනි",
    "year": "2020",
    "lyrics": "  ප්‍රකම්පිත චිත්තා ශක්තිනී අකම්පිත මාතා භක්තිනී මන සාර චිත්තාකර්ශනී ධරක ප්‍රේමිණී   අග්නි වර්ශා දිවිය අවුරා පුරා සඳ විලසින් පැහැදුල් මන නොසැලේ සලිත නොවෙමින් මනසින් පවා සරතැස දරයි මන ගැඹුරේ   සුසුම් උහුලා රිදුම් ඉවසා දරා ළය පතුලින් දිවි ගිම් දිවිකතරේ අචල හැඟුමින් පියවර තබා විදසුන් වඩයි දිවි මාරුතේ   ප්‍රකම්පිත චිත්තා ශක්තිනී අකම්පිත මාතා භක්තිනී මන සාර චිත්තාකර්ශනී ධරක ප්‍රේමිණී ධරණී     ",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "අග්නි වර්ශා දිවිය",
            "target": "දුශ්කරතා",
            "interpretation": "දැඩි දුශ්කරතා"
        },
        {
            "domain": "ජීවිතය",
            "source": "ගිම් දිවිකතරේ අචල හැඟුමින් පියවර තබා",
            "target": "අධිශ්ඨානය",
            "interpretation": "නොසෙල්වෙන අධිශ්ඨානය"
        }
    ]
},
{
    "title": "දුවෙ",
    "singer": ["චරිත අත්තලගේ"],
    "lyricist": ["චන්ද්‍රසේන තලන්ගම"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "දුවෙ",
    "year": "2021",
    "lyrics": "   දේස දීපංකරේ පේන තෙක් මානයේ වාලුකාවේ දැවී කාසි හොයනා නගේ පුංචි පැටවු නුඹේ නැද්ද සිහිපත් උනේ උන්ට උඹමයි අගේ කාසි පොදි නම් නොවේ සමාවෙයන් දුවේ සමාවෙයන් දුවේ මින් මතුවට වෙන්නැතේ සමාවෙයන් දුවේ සමාවෙයන් දුවේ මින් මතුවට වෙන්නැතේ රෑට තුරුලේ උඹේ නින්ද ගිය හා පැටවු මට බයේ හැංගිලා නිදි වරා සෝ දුකින් පොඩි එවුන්ගෙ දමා උන්ගෙ අප්පත් මෙදා රහමෙරේ කිමිදිලා උන්ට අතවර කලා සමාවෙයන් දුවේ සමාවෙයන් දුවේ මින් මතුවට වෙන්නැතේ සමාවෙයන් දුවේ සමාවෙයන් දුවේ මින් මතුවට වෙන්නැතේ",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "වාලුකාවේ දැවී",
            "target": "දුශ්කරතා",
            "interpretation": "බොහො දුශ්කරතා"
        },
        {
            "domain": "ජීවිතය",
            "source": "හා පැටවු",
            "target": "දුව",
            "interpretation": "අහින්සක"
        }
    ]
},
{
    "title": "වැහි බින්දු වැටෙනවානම්",
    "singer": [" දිනෙශ් ගමගේ,"],
    "lyricist": ["මනුරන්ග විජේසේකර"],
    "composer": ["දිනෙශ් ගමගේ"],
    "album": "වැහි බින්දු වැටෙනවානම්",
    "year": "2022",
    "lyrics": "  රෑපානේ තරුවක් දිස්වෙන්නේ නුඹ කෝ කියා ඇසුවා එදා මා ගාවින් තනියයි වැලපෙන්නේ කදුලින් සදා මල් දම් ගොතා හිරි වැටුනු සද සේයා නිදි වරපු රෑ මාහා තනිවෙන්න හදවත් දැන් හිගයි... වැහිබිදු වැටෙනවා නම් සුළගක් සැලෙනවා නම් මොහොතක් තනිවී හිදිමී ආදරේ... ලංවී ඉන්න මා නම් රහසක් කියනවා නම් මොහොතක් තනිවී සොයමී ආදරේ... මන ලෝලරංග සේනා හාදේ සියුම්ව දහරා නැවතිලා නැවතිලා නේ... නුඹ රහසේ කියන ගීතා සෙමින් ඇසෙන්නේ මාත්‍රා පැටලිලා පැටලිලා නේ... හිරි වැටුනු සද සේයා නිදි වරපු රෑ මාහා තනිවෙන්න හදවත් දැන් හිගයි... වැහිබිදු වැටෙනවා නම් සුළගක් සැලෙනවා නම් මොහොතක් තනිවී හිදිමී ආදරේ... ලංවී ඉන්න මා නම් රහසක් කියනවා නම් මොහොතක් තනිවී සොයමී ආදරේ...",
    "metaphors": [{
            "domain": "විරහව",
            "source": "තනියයි වැලපෙන්නේ",
            "target": "පාලුව",
            "interpretation": "දුක්බර පාලුව"
        },
        {
            "domain": "ආදරය",
            "source": "මන ලෝලරංග සේනා හාදේ සියුම්ව දහරා",
            "target": "හැඟීම්",
            "interpretation": "ආදරනීය හැඟීම්"
        }
    ]
},
{
    "title": "lu",
    "singer": [" තරින්දු දම්සර"],
    "lyricist": ["රුහුනුකෙත දම්මදෙව"],
    "composer": ["තරින්දු දම්සර"],
    "album": "lu",
    "year": "2019",
    "lyrics": " නුඹ නොමැති දිහාවක තල කොයිද සඳළු කටු මතින් ඇවිද යමි මතක වන වදුලු උහුලන්න බැරි තරම් සිහිනයන් සිඳලු ලස්සනම තැන්වලයි තියෙන්නෙම කඳුළු රැයක මැදියම අරන් ගළවමි දෑස්වල ඇබේ එතැන් සිට ගලන්නේ මොනවාද ඉබේ ඉතින් නුඹ තබාගිය සිනාවන් තැනින් තැන තිබේ අතීතය සිහි කරන් හොඳටෝම මං රිද්දගනු ලැබේ කාගෙ කාගෙත් දෑස් කෙළවර ශේෂ කඳුළක් තියෙනවා බැරිම තැන්වල එහෙම ඒවා ගලාගෙන බිම හැලෙනවා හිමිනොවූත් සමහරක් මල් අහිමි වන තැන බැඳෙනවා සදාකාලික ප්රේමයක් නම් කවදාහරි අත්හැරෙනවා",
    "metaphors": [{
            "domain": "විරහව",
            "source": "කටු මතින් ඇවිද යමි",
            "target": "වේදනාව",
            "interpretation": "දැඩි වේදනාව"
        },
        {
            "domain": "විරහව",
            "source": "මතක වන වදුලු",
            "target": "අතීතය",
            "interpretation": "දිගු අතීතය"
        },
        {
            "domain": "විරහව",
            "source": "ශේෂ කඳුළක් තියෙනවා",
            "target": "විරහව",
            "interpretation": "කිසියම් දුකක්"
        },
        {
            "domain": "විරහව",
            "source": "හිමිනොවූත් සමහරක් මල්",
            "target": "ආදරය",
            "interpretation": "අහිමි ආදරය"
        }
    ]
},
{
    "title": "නැසුනා",
    "singer": ["දිනෙශ් ගමගේ"],
    "lyricist": ["දුලන්ජ අල්විස්"],
    "composer": ["චමත් සන්ගීත්"],
    "album": "නැසුනා",
    "year": "2020",
    "lyrics": "  රුව නෙතග ගැටුනු දා දැනුනු හැගුම හද පුරා ඔය නෙතබ දෙස බලා සිහිය අතරමග තියා දුර දුරක මම ගියා නොදැනි ලොව නතර වෙලා මුදු සිහිනයකි නුරා හිදිමි නුබේ ලග මෙමා   නෑසුනා සේ ඉවත බලා ගියා සුදූ නුඹටම තේරිලා නුඹ ගෙන ගිය හිත මහිත මහිත මා   නෑසුනා සේ ඉවත බලා ගියා සුදූ නුඹටම තේරිලා නුඹ ගෙන ගිය හිත මහිත මහිත මා   මහිත ගත්ත ඒ සුරංගනාවී දකින්න යලිත් දෙනුවන් හඩාවී මනස පුරා ඒ රුව ගලාවී හීනෙන් දුන් ආදරේ සුව පතාවී   එන්න පමාවී මත් වෙන්න මනාලී ආදර අමුර්තේ තෙමෙමු මනාලී ආයෙත් හිද ගන්නේ නෑවිත් සෆාරී දැවටී නැවතී ඉන්න මං ගාවින්ම   අදරේ වැඩ්වෙලා තවත් කවදාවත් නෑ ඇතිවෙලා මාව කුනාටුවකට මැදි වෙලා වගේ මගේ පාලනේ නැති වෙලා   ඔයාගේ දාංගලේ දැක්ක දා ඉදං මං රාගය පැටලිලා ඔය උන්මාදයෙන් නැලවිලා කොහොමද ඉන්නේ කාමයෙක් වැලකිලා   නෑසුනා සේ ඉවත බලා ගියා සුදූ නුඹටම තේරිලා නුඹ ගෙන ගිය හිත මහිත මහිත මා   නෑසුනා සේ ඉවත බලා ගියා සුදූ නුඹටම තේරිලා නුඹ ගෙන ගිය හිත මහිත මහිත මා   නෑසුනා සේ ඉවත බලා ගියා සුදූ නුඹටම තේරිලා නුඹ ගෙන ගිය හිත මහිත මහිත මා   නෑසුනා සේ ඉවත බලා ගියා සුදූ නුඹටම තේරිලා නුඹ ගෙන ගිය හිත මහිත මහිත මා ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "මනස පුරා ඒ රුව ගලාවී",
            "target": "සිහිවීම",
            "interpretation": "නිතර සිහිවීම"
        },
        {
            "domain": "ආදරය",
            "source": "ආදර අමුර්තේ තෙමෙමු මනාලී",
            "target": "ආදරය",
            "interpretation": "ආදර වන්තයන් වෙමු"
        },
        {
            "domain": "ආදරය",
            "source": "සිහිය අතරමග තියා",
            "target": "කාන්තාව",
            "interpretation": "කාන්තාව නිසා වෙනම ලොකෙකට යාම"
        }
    ]
},
{
    "title": "මුදු උවන පින්බරයි",
    "singer": ["දිනුපා කොදගොඩ"],
    "lyricist": ["කාන්ති අමරසිරි"],
    "composer": ["නදික වෙලිගොඩපොල"],
    "album": "මුදු උවන පින්බරයි",
    "year": "2021",
    "lyrics": "  මුදු උවන පින් බරයි බෝ බැතින් හිත පිරෙයි පන්කුලියේ හිමි ඔබයි ගුණ කඳ දිසෙන රුවයි හදේ සතුට පිරෙයි හිතේ බිය මග හැරෙයි කළුගඟ නිසලව ගලා බසී.. නිසලව ගලා බසී..   සඳ රේණු බිම හැලෙයි තරු කෙඳිති මනහරයි බෝ සෙවන ඉන් පිරෙයි හදේ සතුට පිරෙයි.. අවිදු ඝණඳුරින් මිදී කෙලෙසුන් කෙරෙන් සොඳුරු බණ සිසිලසින් කළුගඟ නිසලව ගලා බසී.. නිසලව ගලා බසී..   නිසල සෙල බිඳේ සමිඳුගේ රුව මැවේ බැති සිත දෑතින් නිමැවේ.. නිවන් යන මග දුරයි නමුදු සිත හිමි ළඟයි සසර කෙටි වනු හැඟේ කළුගඟ නිසලව ගලා බසී.. නිසලව ගලා බසී.. ",
    "metaphors": [{
            "domain": "ආගම",
            "source": "ගුණ කඳ දිසෙන රුවයි",
            "target": "හිමියන්",
            "interpretation": "බොහො ගුනවත්"
        },
        {
            "domain": "ආගම",
            "source": "පන්කුලියේ හිමි",
            "target": "හිමියන්",
            "interpretation": "මනා ගති පැවතුම්"
        }
    ]
},
{
    "title": "සන්සාරයේ මා",
    "singer": ["චරිත අත්තලගේ", "රිද්ම වීරවර්දෙන", " දිනුපා කොදගොඩ"],
    "lyricist": ["චන්ද්‍රසේන තලන්ගම"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "සන්සාරයේ මා",
    "year": "2017",
    "lyrics": " සංසාරයේ මා හමුවී තියේදෝ දෑසේ ඉනාවේ මා මත් වුනාදෝ මේ හුදකලාවේ සීතල සැඳෑවේ ඔබ හමුවුනේ මා ගං තීරයේදී මේ මල් තුරුල්ලේ ඔබ මල් කිරිල්ලී මාගේ සිනා මැවේ අද රෑ වුනාවේ, හෙට එළි වුනාවේ මිහිරේ යළි හමු වේදෝ මල් පවා ගැස්සිලා ළංවී බලාවී අප සොයා අද රැයේ තරු රංචු ගැසේවී සුරංගනාවියක්වදෝ, මලින් උපන් ලියක්වදෝ තනිවී කිමදෝ අසමි සමාවී සුරංගනාවියක් නොවේ, මලින් උපන් ලියක් නොවේ සොඳුරු හැඟුම් ඇයි සඟවන්නේ මා මේ සංසාරේ රන් රස සේමා පෑහී සැමදා ආදරයේ පෑවා ඇලේ-දොලේ, විලේ-ජලේ, ඉරේ-හඳේ, ගහේ-වැලේ ගැයුනේ අපගේ ප්රේම උදානේ ඔබේ නුවන් දිහා බලා කියන්න බෑ අහන්නෙපා ආල හැඟුම් ඇයි සඟවන්නේ මා මේ මල් යායේ මල්පෙති ගානේ ලියවේ අපගේ ආදරයේ ගීතේ සංසාරයේ මා හමුවී තියේදෝ දෑසේ ඉනාවේ මා මත් වුනාදෝ මේ හුදකලාවේ සීතල සැඳෑවේ ඔබ හමුවුනේ මා ගං තීරයේදී මේ මල් තුරුල්ලේ ඔබෙ මල් කිරිල්ලී මා... සිනා මැවේ අද රෑ වුනාවේ, හෙට එළි වුනාවේ මිහිරේ යළි හමු වේදෝ මල් පවා ගැස්සිලා ළංවී බලාවී අප සොයා අද රැයේ තරු රංචු ගැසේවී",
    "metaphors": [{
            "domain": "කාන්තාව",
            "source": "මේ මල් තුරුල්ලේ ඔබ මල් කිරිල්ලි",
            "target": "කාන්තාව",
            "interpretation": "ලස්සන"
        },
        {
            "domain": "කාන්තාව",
            "source": "මල් පවා ගැස්සිලා ළංවී බලාවී",
            "target": "කාන්තාව",
            "interpretation": "ලස්සන"
        },
        {
            "domain": "ආදරය",
            "source": "අප සොයා අද රැයේ තරු රංචු ගැසේවී",
            "target": "යුවළ",
            "interpretation": "ගැලපෙන යුවළ"
        },
        {
            "domain": "කාන්තාව",
            "source": "මලින් උපන් ලියක්වදෝ",
            "target": "කාන්තාව",
            "interpretation": "ලස්සන"
        }
    ]
},
{
    "title": "අම්මා වගෙ",
    "singer": ["කාන්චනා අනුරාදි"],
    "lyricist": ["කාන්චනා අනුරාදි"],
    "composer": ["අමිත් ගුරු"],
    "album": "අම්මා වගෙ",
    "year": "2021",
    "lyrics": "  මාගෙන් ඈතට යනවාදෝ නුඹ ස්නේහයේ මුදු පළඳා හදේහී නැගෙනා හැගුමන් බෝමා පවසනු බෑ නුඹ හා   අම්මා වගේ දුන් ආදරේ රකිමී සදා සංසාරයේ අම්මා වගේ දුන් ආදරේ රකිමී සදා සංසාරයේ   දෙව් දූ නුඹමයි මල් වැහි වෑහෙයි කුමරුන්ගේ තුරුලේ නිවෙනා මා පිය සෙනෙහේ නුඹෙ හිස පළඳා වැජබේවා… සැමදා   අම්මා වගේ දුන් ආදරේ රකිමී සදා සංසාරයේ අම්මා වගේ දුන් ආදරේ රකිමී සදා සංසාරයේ ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "ස්නේහයේ මුදු පළඳා",
            "target": "විවාහ වෙනවා",
            "interpretation": "විවාහ වෙනවා"
        },
        {
            "domain": "මවුපිය ගුණ",
            "source": "දෙව් දූ නුඹමයි",
            "target": "අම්මා",
            "interpretation": "විශ්වාස කළ හැකි"
        },
        {
            "domain": "ජීවිතය",
            "source": "මල් වැහි වෑහෙයි",
            "target": "සතුට",
            "interpretation": "නොඅඩු සතුට"
        }
    ]
},
{
    "title": "ඔබමයි ආලොකෙ",
    "singer": ["සුපුන් පෙරේරා"],
    "lyricist": ["දිල්මින් පෙරේරා"],
    "composer": ["දිල්මින් පෙරේරා"],
    "album": "ඔබමයි ආලොකෙ",
    "year": "2021",
    "lyrics": "  මේ ප්‍රේම චායාවේ මල් පිපෙන හෝරාවේ සිප ගත්ත රෑ යාමේ සොඳුරේ   ඒ සිහින රේඛාවේ ඉගිලෙන්න සැනසිල්ලේ ‍රෝසමල් යහනාවේ සොඳුරේ   ආදරේ සිතේ සාගරේ වගේ මට කීව කීව පෙම් කතන්දරේ ශෝකගිම් නිවී ප්‍රේමියේ මගේ තාරුකා වගේ දිලෙයි අහසේ…   ඔබමයි ආලෝකේ ඔබමයි මා සිහිනේ ඔබමයි මා ජීවේ..ප්‍රේමියේ.. ඔබමයි ආලෝකේ ඔබමයි මා සිහිනේ ඔබමයි මා ජීවේ..ප්‍රේමියේ… සංසාර සරනාවී ප්‍රේමයේ සනසාවී ආදරෙන් මට ලංවී මාගේ කෝල මනමාලී…   මේ ප්‍රේම චායාවේ සිත රැඳුණු මදහාසේ ඔබේ රුවමයි මට සිහිවෙන්නේ ඔබෙ නෙත් දුටුවාවේ හදේ මල් පිපුනාවේ ප්‍රේමරැල් නැගුනාවේ හදේ..   ආදරේ සිතේ සාගරේ වගේ මට කීව කීව පෙම් කතන්දරේ ශෝකගිම් නිවී ප්‍රේමියේ මගේ තාරුකා වගේ දිලෙයි අහසේ…   ඔබමයි ආලෝකේ ඔබමයි මා සිහිනේ ඔබමයි මා ජීවේ..ප්‍රේමියේ… ඔබමයි ආලෝකේ ඔබමයි මා සිහිනේ ඔබමයි මා ජීවේ..ප්‍රේමියේ… සංසාර සරනාවී ප්‍රේමයේ සනසාවී ආදරෙන් මට ලංවී මාගේ කෝල මනමාලී…   ආදරේ සිතේ සාගරේ වගේ මට කීව කීව පෙම් කතන්දරේ ශෝකගිම් නිවී ප්‍රේමියේ මගේ තාරුකා වගේ දිලෙයි අහසේ…   සංසාර සරනාවී ප්‍රේමයේ සනසාවී ආදරෙන් මට ලංවී මාගේ කෝල මනමාලී… ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "මල් පිපෙන හෝරාවේ",
            "target": "කාලය",
            "interpretation": "හොඳ කාලයන්"
        },
        {
            "domain": "ආදරය",
            "source": "ආදරේ සිතේ සාගරේ වගේ",
            "target": "ආදරය",
            "interpretation": "නිමාවක් නෑ ආදරය"
        },
        {
            "domain": "ආදරය",
            "source": "ප්‍රේමියේ මගේ තාරුකා වගේ දිලෙයි",
            "target": "ආදරවන්තිය",
            "interpretation": "විශේෂ ආදරවන්තිය"
        },
        {
            "domain": "ආදරය",
            "source": "ඔබමයි ආලෝකේ",
            "target": "ආදරවන්තිය",
            "interpretation": "මගපෙන්වීම"
        },
        {
            "domain": "ආදරය",
            "source": "හදේ මල් පිපුනාවේ",
            "target": "සතුට",
            "interpretation": "නොඅඩු සතුට"
        },
        {
            "domain": "ආදරය",
            "source": "ප්‍රේමරැල් නැගුනාවේ",
            "target": "ආදරය",
            "interpretation": "ආදරය වැඩි වැඩියෙන් දැනෙනවා"
        }
    ]
},
{
    "title": "බුත්තල නත්තල",
    "singer": ["සාදර බන්ඩාර"],
    "lyricist": ["නුවන් ජුඩ් ලියනගේ"],
    "composer": ["සාදර බන්ඩාර"],
    "album": "බුත්තල නත්තල",
    "year": "2020",
    "lyrics": "  ගිනිකොන දිග ගිනි හුළඟ හමා එන ඌවේ දෙසැම්බරේ.. සඳ එළියේ කුරගාමින් ඇදෙනා ජුසේගේ ට්‍රැක්ටරේ තිත්ත රසට උස ගිය මස් ගස් ඇති උක් දඬු වනන්තරේ නත්තල මැද්දේ බුත්තල ඉපදුණු ජේසුගේ කතන්දරේ..   කට පුංචාගෙන් ඉඳහිට වෙඩි හඬ ඇහුණා එඬේරු නැති ගොම්බානක ගෙජ්ජි බැඳලා තිබුණා තරු නම් හිස් අහසේ ඔනේ තරම් දිලුණා බිළිඳු හඬට මුලු වෙල්ලසම නිවුණා..   ගව මඩුවේ ඉපදුනත් රජ මැදුරේ ඉපදුනත් ගොයම් යායේ ඉලුක් ගාලේ වනන්තරේ ඉපදුනත් මේ ලෝකෙට ඉපදෙන්නේ දෙවියන්ගේ දේව පුතෙක්   හැම මොහොතම නත්තලක් හැම දිවියම ගවලෙනක් හැම මොහොතම නත්තලක් හැම දිවියම ගවලෙනක් හැම මොහොතම නත්තලක් හැම දිවියම ගවලෙනක් ",
    "metaphors": [{
            "domain": "ලමයින්",
            "source": "කට පුංචාගෙන් ඉඳහිට වෙඩි හඬ ඇහුණා",
            "target": "බිලිදෙකු ඇඩීම",
            "interpretation": "බිලිදෙකු තියුනු ඇඩීම"
        },
        {
            "domain": "ලමයින්",
            "source": "බිළිඳු හඬට මුලු වෙල්ලසම නිවුණා",
            "target": "නව බිලිදෙකු",
            "interpretation": "නව බිලිදෙකු වෙත මිනිසුන්ගේ ඇති ආදරය"
        }
    ]
},
{
    "title": "සකුරා",
    "singer": ["චරිත අත්තලගේ"],
    "lyricist": ["චරිත අත්තලගේ"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "සකුරා",
    "year": "2021",
    "lyrics": "  සකුරා මලේ අද මා ලග හඩා වැටී   සකුරා මලේ වෙනදා මෙන් සුවද නැතේ   හිමි නොවෙනා ප්‍රේමේ ලුහු බදිනා ප්‍රේමේ   සකුරා මලේ අද මා ලග හඩා වැටී   දෙන්න මට පලා යන්න දෙන්න මට පලා යන්න දෙන්න මට පලා යන්න දෙන්න මට පලා යන්න   පරසතු සුවදක් මම නොම වින්දෙමි සකුරා යායේ   පරසතු කුසුමක් මම නොම වින්දෙමි සකුරා යායේ   සකුරා පෙති ගිලිහෙන මහා කහට මම දැන් වින්දේ   සකුරා මලේ පෙති ගිලිහී හඩා වැටේ   කදුලු පිලියමක් නුඹට වියැකෙන හල් මිටි සමාජේ අනියම දායි නුඹගේ කර පිටින්   සිනමා හිරේ අපගේ යතාර්ථයක් කනපිටින් පදාර්ථයේ පිටපතක් කුසේ උබේ පනපිටින්   යදින්නෙපා විද සිදලන්න බැරි දොලදුකක්   උඹේ කාලේ පාරේ උඹේ භාර්‍යාව ගැරහුවත්   මගේ රහසක රිදී නිම්නයක කලබල නියන්පත් කිනම් ඩිම්බයක   ගිනි තියන් උබේ නෙගටිව් පටි ඔය හැසිරීම මට ගබ්සා දොරටු අරී   වීරයන්ට දැන් උඹේ ආතමාර්තකාමි වග නොකියන්න ජාතකේට මා ප්‍රාර්ථනාවී   තිබුනට කඩතුරා ගැබක් උඹ දාරාගෙන   උඹේ පරාජය ලතවෙන්නෙ ලය පලාගෙන වෛයිරය වේද මහ මතකයන් පලා යන දෙන්න මට සැලොන සිහිනෙට මගේ පලා යන්න   හිමි නොවෙනා ප්‍රේමේ ලුහු බදිනා ප්‍රේමේ   සකුරා පෙති ගිලිහෙන මහා කහට මම දැන් වින්දේ   සකුරා මලේ අද මා ලග හඩා වැටී   සකුරා මලේ පෙති ගිලිහී හඩා වැටේ   සකුරා මලේ පෙති ගිලිහී හඩා වැටේ   නිබද දෙව් දූ සියත වලා බැමි මුහුරස උර දැක්මේ කඩා වැටී මා දළු රෝස පලයට හඩා වැටී පුරා සකුරා සිසිරේ පතනවා ඇති   චරිත මානසික් වෙස්ට්නාහිර ",
    "metaphors": [{
            "domain": "විරහව",
            "source": "පරසතු කුසුමක්",
            "target": "ආදරයක්",
            "interpretation": "අන්සතු ආදරයක්"
        },
        {
            "domain": "ජීවිතය",
            "source": "හල් මිටි සමාජේ",
            "target": "අදහස්",
            "interpretation": "පටු අදහස්"
        },
        {
            "domain": "ආදරය",
            "source": "පදාර්ථයේ පිටපතක් කුසේ උඹේ පණපිටින්",
            "target": "ගැබිනි",
            "interpretation": "ගැබිනි"
        }
    ]
},
{
    "title": "පැදපල්ලා",
    "singer": ["සාදර බන්ඩාර"],
    "lyricist": ["සාදර බන්ඩාර"],
    "composer": ["සරිත එදිරිසින්ඝෙ"],
    "album": "පැදපල්ලා",
    "year": "2020",
    "lyrics": "  රෑ අහසේ තරු දිළෙද්දී සීත සුළං රැල් ගත දැවටෙයි සැඩ පහරට නැව ගැස්සෙද්දී සුසිනිඳු පහසක අඩුව දැනෙයි මධු බඳුන් ඈ ගෙන එද්දී ඉන් මගේ උමතු දුරුවී මධු විතින් ගත නැළවෙද්දී මා වැළඳගන්න සොඳුරී   නෙත් කොනින් ඉඟි කරයි ඈ රත් තොල් වලින් බිඟි කරයි ලැසි ගමනෙදි බඳ සලයි ඈ රෑ යහනට ඇරයුම් කරයි   ඇගෙ පහසින් ගත ගිනිගද්දී තව කුමට මට රන් රිදී මැරුණාවේ මා මැරුණාවේ ඇගෙ ළමැදෙ හුස්ම හිරවී   පැදපල්ලා පැදපල්ලා පැදපල්ලා පැදපල්ලා අර වෙරළ බලා   අපි එනවා අපි එනවා අපි එනවා කෙල්ලො සොයා   මධු විතින් ගත නැළවෙද්දී මා වැළඳගන්න සොඳුරී   මැරුණාවේ මා මැරුණාවේ ඇගෙ ළමැදෙ හුස්ම හිරවී   පැදපල්ලා පැදපල්ලා පැදපල්ලා අර වෙරළ බලා   අපි එනවා අපි එනවා අපි එනවා කෙල්ලො සොයා   ඕඕඕ වෙරළ බලා අපි එනවා අපි එනවා අපි එනවා කෙල්ලො සොයා ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සුසිනිඳු පහසක අඩුව දැනෙයි",
            "target": "කාන්තාව",
            "interpretation": "කාන්තාව නැති පාලුව"
        },
        {
            "domain": "ආදරය",
            "source": "තව කුමට මට රන් රිදී",
            "target": "කාන්තාව",
            "interpretation": "කාන්තාවගෙන් සෑහීමට පත්වීම"
        }
    ]
},
{
    "title": "හීන මකා",
    "singer": [" හර්ශදෙව අරියසින්හ"],
    "lyricist": ["චරිත අත්තලගේ"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "හීන මකා",
    "year": "2020",
    "lyrics": "  තැවෙනා ඒ සිත නොදැනී වගේ… වැටෙනා කදුලු නොදැනී වගේ… දැවෙනා ඒ දුක නොදැනී වගේ…   මං ආවා…   ඒ සිත සගවන් මෙසේ… වැටෙනා කදුලු සගවන් මෙසේ… දැවෙනා ඒ…දුක සගවන් මෙසේ…   මං ආ..වා…   හීන මකා… හංගාලා… මං ආවා…   රවටාලා… මුමුනා සගවා…   මං ආවා….   හීන මකා… හංගාලා… මං ආවා…   ඒ…රවටාලා… මුමුනා සගවා… මං ආවා….    මා ගැන හිතනා මගෙ උණුහුම හොයනා නිදි යහනට වෙලා මං එනකං නොනිදා මගෙ භාරියට හොරා… ඇගෙ ලොවෙ තනි කරලා… යටිහිත රවටලා… උඩු හිත මං ආවා…   ඇත නිමකෙරුමට මුදුනට ගොඩගැසි බොරු රාජකාරි   නුඹෙ ඇමතුම එද්දී ආවරන කලාපෙන් මං බැහැරව යාවී…   හැමදා කන රස ඇති වෙලා පිටින් කමි සද මං පමාවේවි…   ගත මගෙ ඇය මත නුඹෙ හිතෙ මං ගැන නොදනී මං ද්‍රොහී…   කාමය ඇවිලෙන්නෙ ආදරෙ මත හදින් හද එකවෙන තැන   ඒ හිත තැන තැන යනවනං ආලෙයි කාමෙයි එක වෙන්නෙ කෙසේද ? මට දෙකක් ඒ දෙක…   තාවකාලික හිතක තාවකාලික කුමරා වෙන එක වෙනම රසකි   උගුරට හොරා බොන බෙහෙතක දැනෙන සැප විදින එක නුඹ නොදනී වගෙ ඉන්න සද මතුවට එන දින යන්න වෙනකොට මේ කයෙන් ගැලවිලා වෙන්න බෑ පසුතැවෙන්න බෑ එදින බෑ හිතෙන්න මා හිතට මං වින්දෙ මොනවද ජීවිතෙ අවසානෙට   නුඹ ඔතන මං මෙතැන විදිනවා ඈ එක්ක මත රාගය   යටි හිත රවටලා මං ආවා උඩුහිත ඉල්ලන අන් සැපට…    තැවෙනා ඒ සිත නොදැනී වගේ… වැටෙනා කදුලු නොදැනී වගේ…   දැවෙනා ඒ දුක නොදැනී වගේ…   මං ආවා…   සගවන් මෙසේ… වැටෙනා කදුලු සගවන් මෙසේ… දැවෙනා ඒ…දුක සගවන් මෙසේ…   මං ආවා…   හීන මකා… හංගාලා… මං ආවා…   රවටාලා… මුමුනා සගවා…   මං ආවා….   හීන මකා… හංගාලා… මං ආවා…   රවටාලා… මුමුනා සගවා…. මං ආවා…    මා ගැන හිතනා මගෙ උණුහුම හොයනා නිදි යහනට වෙලා මං එනකං නොනිදා මගෙ භාරියට හොරා… ඇගෙ ලොවෙ තනි කරලා… යටිහිත රවටලා… උඩු හිත මං ආවා…   ඇත නිමකෙරුමට මුදුනට ගොඩගැසි බොරු රාජකාරි   නුඹෙ ඇමතුම එද්දී ආවරන කලාපෙන් මං බැහැරව යාවී…   හැමදා කන රස ඇති වෙලා පිටින් කමි සද මං පමාවේවි…   ගත මගෙ ඇය මත නුඹෙ හිතෙ මං ගැන නොදනී මං ද්‍රොහී… ",
    "metaphors": [{
            "domain": "විරහව",
            "source": "හීන මකා හංගාලා",
            "target": "බලාපොරොත්තු",
            "interpretation": "බලාපොරොත්තු අත්හැර"
        },
        {
            "domain": "ජීවිතය",
            "source": "උගුරට හොරා බොන බෙහෙතක",
            "target": "වැරැද්ද",
            "interpretation": "සත්‍යෙන් සැගවීම"
        },
        {
            "domain": "ආදරය",
            "source": "තාවකාලික හිතක තාවකාලික කුමරා",
            "target": "සම්බන්ධතාව",
            "interpretation": "අනියම් සම්බන්ධතාව"
        }
    ]
},
{
    "title": "උදුරාවී",
    "singer": [" කාන්චනා අනුරාදි"],
    "lyricist": ["කාන්චනා අනුරාදි"],
    "composer": ["ධනිත් ශ්‍රී"],
    "album": "උදුරාවී",
    "year": "2020",
    "lyrics": "  සබඳේ පැතුවා සේ හමුවේදෝ ආයේ……..   කුණාටුවක හසුවී මගේ සිත ඇදී තිබේ නොමැකීම ඇගේ රුව අ හහ් ඇගේ රුව අ හහ්   මේ සැඳෑවේ ගං තෙරේදී රන් රුවේ මා නුඹ දකීවී හීන ගානේ මා ඇදේවී චන්ද්‍රයාමේ නින්ද නේවී   උදුරාවී මාගේ ආලේ මැවු හීනේ නුඹ නොවෙදෝ අනේ මා හදේ නුඹේ රුව නොමැකේ දෝ ආයේ   නලල කුංකුම රූ අඳීවී හාදු අමුනා ගෙල බදීවී ස්නේහ වර්ශා වැටෙන වේලේ දමා යනු බෑ සඳේ වෙන්වී   උදුරාවී මාගේ ආලේ මැවු හීනේ නුඹ නොවෙදෝ අනේ මා හදේ නුඹේ රුව නොමැකේ දෝ ආයේ   කුණාටුවක හසුවී මගේ සිත ඇදී තිබේ නොමැකීම ඇගේ රුව අ හහ් ඇගේ රුව අ හහ් ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "කුණාටුවක හසුවී මගේ සිත",
            "target": "ආදරය",
            "interpretation": "ආදරය නිසා සිත කලබල"
        },
        {
            "domain": "ආදරය",
            "source": "ස්නේහ වර්ශා වැටෙන වේලේ",
            "target": "ආදර කතා කියමින්",
            "interpretation": "දිගටම ආදර කතා කියමින්"
        }
    ]
},
{
    "title": "තනියම",
    "singer": ["මෙතුන් එස්කේ", "කාන්චනා අනුරාදි"],
    "lyricist": ["මෙතුන් එස්කේ", "කාන්චනා අනුරාදි"],
    "composer": ["මෙතුන් එස්කේ"],
    "album": "තනියම",
    "year": "2020",
    "lyrics": "  රාත්‍රියක ඇති අරුමය කිමැයි සිතා බලා හිටියා මම තනියම අහස දිහා අන්ධකාරේ පහසේ තුරුලු වෙලා හද එළිය වින්දේ තනියම තරු ගනන් කෙරුවේ තනියම ඉන්න බැරි තැන එකම මොහොතක ඔබ මතක් කෙරුවේ තනියම   ආත්ම දහසක උරුමය ඔබයි සිතා බලා හිටියා තව භවයක් ඇතැයි කියා මංමුලාවූ හැගුමක තුරුලු වෙලා ගව් ගනන් දුර ආවේ තනියම දිනගනන් කෙරුවේ තනියම එදින නොඑනා බවද දැනගෙන කදුළු බිදුවක් වැටුනේ තනියම   රාත්‍රියක ඇති අරුමය කිමැයි සිතා බලා හිටියා අපි දෙතැනක අහස දිහා අන්ධකාරේ පහසේ තුරුලු වෙලා හද එළිය වින්දේ තනියම තරු ගනන් කෙරුවේ තනියම ඉන්න බැරි තැන එකම මොහොතක ඔබ මතක් කෙරුවේ තනියම     ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "අන්ධකාරේ පහසේ",
            "target": "තනිකම",
            "interpretation": "නිදහස් තනිකම"
        },
        {
            "domain": "ආදරය",
            "source": "එදින නොඑනා",
            "target": "විරහව",
            "interpretation": "එක්වීමක් නැති"
        }
    ]
},
{
    "title": "ඇය කියල නැ",
    "singer": ["චරිත අත්තලගේ"],
    "lyricist": ["ගයාන් පෙරේරා", "මනුරන්ග විජේසේකර"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "ඇය කියල නැ",
    "year": "2020",
    "lyrics": "  ඇය කියලා නෑ මට ආදරෙයි ආදරෙයි කියා මටත් හොරෙන් මගේ සිගරට් අරගෙන කීතු කිතු කරලා කුනු බක්කියකට විසි කරලා තිබුනා එය ඇය කියලා නෑ නෑ සත්තයි වටහා ගන්නට බෑ සිර කුටියක් වූ සිතේ සගවන් සිතුවිලි ඇගේ තව දුරටත් දුක ගෙනෙනා මෙයදෝ ආදරේ කියන්නේ කියා ඈ සිතන්නේ නොකියා ඈ කරන්නෙ කරානම් නොකීවේ මා සිතින් පෙලෙන්නේ   ආදරේ කියන්නේ කියා ඈ සිතන්නේ නොකියා ඈ කරන්නෙ කරානම් නොකීවේ මා සිතින් පෙලෙන්නේ ඇය කියලා නෑ   මගේම ලග මගේ ලොවම වී ඉන්නවැයි කියා තනිවන හැම මොහොතකදී ලැබුනා උනුහුම නොඅඩුව ඇයගෙන් ඒ පහසින් මා මත් වී සිටියට කවදත් ඇය කියලා නෑ නෑ සත්තයි වටහා ගන්නට බෑ සිර කුටියක් වූ සිතේ සගවන් සිතුවිලි ඇගේ තව දුරටත් මා රවටනා මෙයදෝ ආදරේ කියන්නේ   කියා ඈ සිතන්නේ නොකියා ඈ කරන්නෙ කරානම් නොකීවේ මා සිතින් පෙලෙන්නේ   ආදරේ කියන්නේ කියා ඈ සිතන්නේ නොකියා ඈ කරන්නෙ කරානම් නොකීවේ මා සිතින් පෙලෙන්නේ ඇය කියලා නෑ ඇය කියලා නෑ ඇය කියලා නෑ ඇය කියලා නෑ     ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සිර කුටියක් වූ සිතේ",
            "target": "සිතුවිලි",
            "interpretation": "සැගවුනු සිතුවිලි"
        },
        {
            "domain": "ආදරය",
            "source": "පහසින් මා මත් වී",
            "target": "ආදරය",
            "interpretation": "නොඅඩුව ආදරය"
        }
    ]
},
{
    "title": "ශ්‍රි ලන්කා මාතා",
    "singer": ["අනුශ්ක උදාන", "දිනෙශ් ගමගේ"],
    "lyricist": ["දිනෙශ් ගමගේ"],
    "composer": ["දිනෙශ් ගමගේ"],
    "album": "ශ්‍රි ලන්කා මාතා",
    "year": "2020",
    "lyrics": "  නැගිටිමු යලිත්  නැවතුනු තැනින්  ලක් මෑණියේ  නුඹේ අත අල්ලමින්   නැගිටිමු යලිත්  වැරදුනු තැනින්  ලක් මෑණියේ  දිනු දේශය නමින්   ශ්‍රී ලංකා මාතා  ශ්‍රී ලංකා මාතා  නමදිමු අපි සැමදා  ශ්‍රී ලංකා මාතා  ප්‍රාණය සේ මාතා  රැකගමු අපි සැවොමා   එකමුතු කම්  නැතිවුනු තැන්  හදමුද අපි වෙහෙස වීලා  අපේ නමින් ඒ විරුවන්  දිවිදුන් නය බේරා   යලි ගෙනෙමු සිංහ සේයා  හඩනගමූ සිංහ සේනා  මව් රකිමු  අප නැගෙමු සදා   ශ්‍රී ලංකා මාතා  ශ්‍රී ලංකා මාතා  නමදින්නම් සැමදා  ශ්‍රී ලංකා මාතා  නෑ සීමා සාදා  රැකගන්නම් සැමදා   ශ්‍රී ලංකා මාතා  ශ්‍රී ලංකා මාතා  නෑ සීමා සාදා  රැකගන්නම් සැමදා   ශ්‍රී ලංකා මාතා  ශ්‍රී ලංකා මාතා  නමදින්නම් සැමදා  ශ්‍රී ලංකා මාතා  නෑ සීමා සාදා  රැකගන්නම් සැමදා   ශ්‍රී ලංකා මාතා  ශ්‍රී ලංකා මාතා  නමදින්නම් සැමදා  ශ්‍රී ලංකා මාතා  නෑ සීමා සාදා  රැකගන්නම් සැමදා     ",
    "metaphors": [{
        "domain": "දේශය",
        "source": "හඩනගමූ සිංහ සේනා",
        "target": "දස්කම්",
        "interpretation": "දස්කම් විදහා දැක්වීම"
    }]
},
{
    "title": "මගේ",
    "singer": ["කාන්චනා අනුරාදි"],
    "lyricist": ["දුලන්ජ අල්විස්"],
    "composer": ["චමත් සන්ගීත්"],
    "album": "මගේ",
    "year": "2022",
    "lyrics": "  හද මඩලම දුනි පවරා සදේ නුඹ නැතුවම බැරි තැන මා   නෙතු බර කර නුඹ බලනා අනේ මම හද අවනත නැතුවා   මගේ ආලේ ඉල්ලන්න දෑසේ යාවී ඉන්නම් මා ආනේ මාහිත් ආයේ ඉගි මරනා   මගේ ආලේ ඉල්ලන්න දෑසේ යාවී ඉන්නම් මා ආනේ මාහිත් ආයේ ඉගි මරනා   ඒ හැගුමේම පාවීලා මා නොදැනිම බැදිලා මේ උතුරන ස්නේහේ කිම සගවනු මා   නෑ යන්නේ නෙතු තෙමලා මා ඉන්නේ අද පේවීලා මේ සසරේම ඒවී නුබේ දෑතේ වෙලිලා   හද මඩලම දුනි පවරා සදේ නුඹ නැතුවම බැරි තැන මා   නෙතු බර කර නුඹ බලනා අනේ මම හද අවනත නැතුවා   මගේ ආලේ ඉල්ලන්න දෑසේ යාවී ඉන්නම් මා ආනේ මාහිත් ආයේ ඉගි මරනා   මගේ ආලේ ඉල්ලන්න දෑසේ යාවී ඉන්නම් මා ආනේ මාහිත් ආයේ ඉගි මරනා   හද මඩලම දුනි පවරා හද මඩලම දුනි පවරා සදේ නුඹ නැතුවම බැරි තැන මා   මගේ ආලේ ඉල්ලන්න දෑසේ යාවී ඉන්නම් මා ආනේ මාහිත් ආයේ ඉගි මරනා   මගේ ආලේ ඉල්ලන්න දෑසේ යාවී ඉන්නම් මා ආනේ මාහිත් ආයේ ඉගි මරනා",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "හද මඩලම දුනි පවරා",
            "target": "ආදරය ලබාදීම",
            "interpretation": "ආදරය නොඅඩුව ලබාදීම"
        },
        {
            "domain": "විරහව",
            "source": "නෙතු බර කර",
            "target": "විරහව",
            "interpretation": "හඩමින්"
        }
    ]
},
{
    "title": "ගලන ගන්ග",
    "singer": ["චරිත අත්තලගේ", "රවි ජේ"],
    "lyricist": ["චරිත අත්තලගේ"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "ගලන ගන්ග",
    "year": "2018",
    "lyrics": "   නීල දෑස හා දොඩවන්නම් වළලු හඬට මම මත් වෙන්නම් නීල වරල මා සිඹ ගන්නම් හීන මවා මට කතා කරන් ගලන ගඟක රළ වාගේ නිමාවක් නෑ නේ ඔබෙ රූ වරුනේ ක්ෂිතිජයක ඉමක් ගානේ නිමාවක් නෑ නේ ඔබෙ රූ වරුනේ ලෞකික සැප කාලය කාදැමීමක් නිබ්බාණෙට පිවිසෙන්න පංචස්කන්ධයක අස්ථිර ගතිය මෙනෙහි මෙනෙහි මං තපසෙක්ම විය නුඹ දකින්න පෙර ඔයාගෙ ළපටි තඹර දෙකොපුල තුහින වැටි දිළිසෙයි ඝණ අඳුර මත ඇසට නොපෙනෙන පර්වතෙක සුන්දර බව විඳපු මට ඔයාගෙ රුව දැක බිඳුනා මගෙ සමවැදි සිටි දැහැන මෙතුකලක් කැළඹිලා සම්මාදිට්ඨිය මගෙ අද නතරවෙලා ඔයාගෙ නෙතුමුල, මගෙ හේතුඵල ගොළුවෙලා අන්ධව අතර මග කිමද ඝන්ධකුටියෙන් හිමිට බැස සීලය පසෙක දමා විදනසින් වැද රූපයක සොබා එතෙර වෙන්න මං ගිය සසර මග පෙරට ඔයා ඇවිත් අද තෘෂ්ණාවක් වෙලා නීල දෑස හා දොඩවන්නම් වළලු හඬට මම මත් වෙන්නම් නීල වරල මා සිඹ ගන්නම් හීන මවා මට කතා කරන් ගලන ගඟක රළ වාගේ නිමාවක් නෑ නේ ඔබෙ රූ වරුනේ ක්ෂිතිජයක ඉමක් ගානේ නිමාවක් නෑ නේ ඔබෙ රූ වරුනේ",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "ගලන ගඟක රළ වාගේ",
            "target": "ජීවිතය",
            "interpretation": "නිමාවක් නෑ"
        },
        {
            "domain": "ජීවිතය",
            "source": "ක්ෂිතිජයක ඉමක්",
            "target": "සන්සාරය",
            "interpretation": "නිමාවක් නෑ"
        },
        {
            "domain": "ජීවිතය",
            "source": "ඇසට නොපෙනෙන පර්වතෙක සුන්දර",
            "target": "නිර්වානය",
            "interpretation": "නිර්වානයේ ආධ්‍යාත්මික සුවය"
        },
        {
            "domain": "ජීවිතය",
            "source": "සසර මග පෙරට ඔයා ඇවිත්",
            "target": "බාධාවක්",
            "interpretation": "සීලය බිදවැටෙනවා"
        }
    ]
},
{
    "title": "කාකි වහලුනි",
    "singer": ["සාදර බන්ඩාර"],
    "lyricist": ["ලියනගහවෙල පග්න්ග්නසෙකර"],
    "composer": ["සෙනිත් ජයමහ"],
    "album": "කාකි වහලුනි",
    "year": "2022",
    "lyrics": "  කපා ඇති බැව් දැන දැනත් උන් පරපුරක ඉගිළෙන තටූ තරු හිඟා කන කාකි වහළුනි රසද එතරම් මස් කටූ   රසද එතරම්, රසද එතරම්, රසද එතරම් මස් කටූ තරු හිඟා කන කාකි වහළුනි රසද එතරම් මස් කටූ   හිතට එකඟව හැකිද කියපන් රකින්නට තව රජ පුටූ කාකි වහළුනි කාකි වහළුනි රසද එතරම් මස්කටු   කෙළෙසනා’යුරු දැක දැකත් උන් නීතියේ දෙවඟන ගරූ පපුව මැද්දට කුමට වහළුනි රතු ලෙයින් නෑවුනු තරූ   රතු ලෙයින්, රතු ලෙයින්, රතු ලෙයින් නෑවුනු තරූ පපුව මැද්දට කුමට වහළුනි රතු ලෙයින් නෑවුනු තරූ   හොරුන් අභියස නමන්නේ තොපි යුක්තියට නොනැමෙන කොඳු කාකි වහළුනි කාකි වහළුනි රසද එතරම් මස්කටු ",
    "metaphors": [{
            "domain": "දේශය",
            "source": "කපා ඇති බැව් දැන දැනත් උන් පරපුරක ඉගිළෙන තටූ",
            "target": "නිදහස",
            "interpretation": "නිදහස අහිමි කිරීම"
        },
        {
            "domain": "දේශය",
            "source": "කාකි වහළුනි",
            "target": "පොලිස්කරුවන්",
            "interpretation": "දූෂිත පොලිස්කරුවන්"
        }
    ]
},
{
    "title": "අකිකරු පෙම් කතාවක්",
    "singer": [" කාන්චනා අනුරාදි"],
    "lyricist": ["ලක්මි ප්‍රභා රත්නායක"],
    "composer": ["පසන් ලියනගෙ"],
    "album": "අකිකරු පෙම් කතාවක්",
    "year": "2019",
    "lyrics": "  සීත හිම මත වතාවක් නිම උනා පෙම් කතාවක් අරුත සඟවා ඔහේ ලියැවුණු අකීකරු පෙම් කතාවක්   නින්ද නැති මැදියම පුරා හැඬූවත් දෙතැනට වෙලා නොදැන සිටියා නොවෙයි නුඹ මා දිනක් එන බව වෙන් වනා   අතීතය මා ලඟ තියා හිතේ තරහක් නෑ කියා ළඟින් ළඟ එන වසන්තය වෙත යන්න හිම කවුළුව වසා ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "වසන්තය වෙත",
            "target": "සතුට",
            "interpretation": "නොඅඩු සතුට සොයා"
        },
        {
            "domain": "විරහව",
            "source": "කවුළුව වසා ",
            "target": "අතීතය",
            "interpretation": "අතීතය අමතක කර"
        }
    ]
},
{
    "title": "සෙනෙහස් අවාරේ",
    "singer": ["සුපුන් පෙරේරා"],
    "lyricist": ["සජිත් අක්මීමන"],
    "composer": ["යසස් මැදගෙදර"],
    "album": "සෙනෙහස් අවාරේ",
    "year": "2022",
    "lyrics": "  රෑ හීන ගානේ නුඹ පෙනේවී හුස්මක් පවා දුර යයි සිතේවී මා ආදරේ නුඹගෙන් දකීවී සංසාරයේ හමුවී තියේවී   සෙනෙහස් අවාරේ කුලුදුල් තුෂාරේ ඔබමයි ගෙනාවේ මගේ දිවිතුරා අනුහස් විමානේ සිපගත් නුරාවේ සදකැන් ගලා ඒ් හදේ ගිම් නිවා   මුදු වලා අතරේ පාවෙලා අප සිනා නිතර යාවෙලා දැනෙන්නේ මේ ආදරය දෝ විහගුනේ ගයන ගීතිකා උනුහුමේ විදින චාරිකා ඔබ මැවුනේ මා වෙනුවෙන්ම දෝ   සෙනෙහස් අවාරේ කුලුදුල් තුෂාරේ ඔබමයි ගෙනාවේ මගේ දිවිතුරා අනුහස් විමානේ සිපගත් නුරාවේ සදකැන් ගලා ඒ් හදේ ගිම් නිවා   හදවතේ මියුරු කාරණා නුඹ ගෙනා මතක පාරනා කොදුරන් හදට ආරාධනා නුඹ මගේ හිතම සාදනා ආදරේ අකුරු තෝරනා ඔබමයි හීන හැබැහින් ගෙනා   සෙනෙහස් අවාරේ කුලුදුල් තුෂාරේ ඔබමයි ගෙනාවේ මගේ දිවිතුරා අනුහස් විමානේ සිපගත් නුරාවේ සදකැන් ගලා ඒ් හදේ ගිම් නිවා",
    "metaphors": [{
            "domain": "විරහව",
            "source": "හුස්මක් පවා දුර යයි",
            "target": "වෙන්වීම",
            "interpretation": "මදක් වෙන්වීම"
        },
        {
            "domain": "විරහව",
            "source": "සෙනෙහස් අවාරේ",
            "target": "අහිමිවීම",
            "interpretation": "යලි හමුවනතුරු අහිමිවීම"
        },
        {
            "domain": "ආදරය",
            "source": "කුලුදුල් තුෂාරේ",
            "target": "ප්‍රේමය",
            "interpretation": "ප්‍රථම ප්‍රේමය"
        },
        {
            "domain": "ආදරය",
            "source": "අනුහස් විමානේ",
            "target": "සැප සම්පත්",
            "interpretation": "සැප සම්පත් නොඅඩුව ලැබෙන"
        },
        {
            "domain": "ආදරය",
            "source": "මුදු වලා අතරේ පාවෙලා",
            "target": "ආදරය",
            "interpretation": "සැහැල්ලුව"
        },
        {
            "domain": "ආදරය",
            "source": "ආදරේ අකුරු තෝරනා",
            "target": "ප්‍රේමය",
            "interpretation": "ප්‍රථම ප්‍රේමය"
        }
    ]
},
{
    "title": "සෙන්කඩගල නුවරට",
    "singer": ["දිනෙශ් ගමගේ"],
    "lyricist": ["මනුරන්ග විජේසේකර"],
    "composer": ["ගයාන් පෙරේරා"],
    "album": "සෙන්කඩගල නුවරට",
    "year": "2022",
    "lyrics": "  සෙංකඩගල නුවරට වහින වැස්ස හවස නුඹ ගැන මතක අහුරු දුන්නා පෙර ලෙසම සුන්දර වැව රවුමට යන්නෙ නෑනෙ තවම ඇවිලෙන මතකය මට ගන්න බැනෙ හිතට   ඔබගේ තුරුලේ ගිලිහී පරවූ මලකී සුළගේ පාවූ අහසත් කලු වෙයි අකුණුත් බොද වී කදුලේ පැටලී තනිවී   සෙංකඩගල නුවරට වහින වැස්ස හවස නුඹ ගැන මතක අහුරු දුන්නා පෙර ලෙසම   අත්වැල් පටලාගෙන පියඹුව හන්තාන තවමත් උන්නු ලෙසට ඉන්නවානේ තවම වැව් දිය නිසල වෙලා මගේ හදවත වගේම දළදා සමිදු පිහිට විතරයි අද හිතට අහසත් කලු වෙයි අකුණුත් බොද වී කදුලේ පැටලී තනිවී   සෙංකඩගල නුවරට වහින වැස්ස හවස නුඹ ගැන මතක අහුරු දුන්නා පෙර ලෙසම   රොබරෝසියා වැටුනු අසුනක් ලග හවස පරවුනු ප්‍රේමය අප දෙදෙනාගෙන් මිදුන ඉදහිට පහු වෙනකොට තවමත් වැව රවුම ඇස් දෙක වසන් යන්නේ එය පමණයි සරණ සෙංකඩගල නුවරට වහින වැස්ස හවස නුඹ ගැන මතක අහුරු දුන්නා පෙර ලෙසම     ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "මතක අහුරු දුන්නා",
            "target": "ආවර්ජනය",
            "interpretation": "අතීත ආවර්ජනය"
        },
        {
            "domain": "ආදරය",
            "source": "තුරුලේ ගිලිහී පරවූ මලකී",
            "target": "ප්‍රේමය",
            "interpretation": "අවසන්වු ප්‍රේමය"
        },
        {
            "domain": "ආදරය",
            "source": "වැව් දිය නිසල වෙලා මගේ හදවත වගේම",
            "target": "කනගාටුව",
            "interpretation": "කනගාටුව"
        }
    ]
},
{
    "title": "අමුඩ සෙල්ලම",
    "singer": ["සාදර බන්ඩාර"],
    "lyricist": ["ජානක මාරපන"],
    "composer": ["සාදර බන්ඩාර"],
    "album": "ළියිෆ් ස්ටොරීස්",
    "year": "2020",
    "lyrics": "  ප්‍රවේණිය යැයි කිව හැකි යට ඇඳුම් කොට යුගලකි නීල සහ කොළ වර්ණැති මාරු කර කර ඇන්දැකී නාසයට කර ඉම්බැකී අඩු ම ගඳ එක ඇන්දැකී යලිත් පසුදා ඉම්බැකී අනිත් එක ගෙන ඇන්දැකී…   අපිට පමණක් උ රුමැතී… මෙවන් ඇඳුමක් අරුමැතී වෙනස් නොකලොත් ළඟ ඇතී සියළු දෑ කුණු වී යතී…   නොපිට පෙරළා බැලුවැකී කිළිටි අඩු එක ඇන්දැකී නොපිට ඉබලා බැලුවැකී ගඳින් අඩු එක ඇන්දැකී දිනෙන් දින තව ගත වෙතී එයින් දුගඳ ම නික්මෙතී අඩු දුඟද ඇඟලා ගතී එයින් සතුටින් ඉපිලෙතී   අපිට පමණක් උරුමැතී… මෙවන් ඇඳුමක් අරුමැතී වෙනස් නොකලොත් ළඟ ඇතී සියළු දෑ කුණු වී යතී… ",
    "metaphors": [{
            "domain": "දේශය",
            "source": "යට ඇඳුම් කොට යුගලකි",
            "target": "දේශපාලන ක්‍රමය",
            "interpretation": "හුවමාරු දේශපාලන ක්‍රමය"
        },
        {
            "domain": "දේශය",
            "source": "ගඳ",
            "target": "දූශන",
            "interpretation": "නොඅඩු වන්චා දූශන"
        },
        {
            "domain": "දේශය",
            "source": "සියළු දෑ කුණු වී යතී",
            "target": "රට",
            "interpretation": "රට විනාශවීම"
        }
    ]
},
{
    "title": "සීමා",
    "singer": ["කාන්චනා අනුරාදි"],
    "lyricist": ["නිසල් ගමගේ"],
    "composer": ["රිවින්දු වන්නිආරච්චි"],
    "album": "සීමා",
    "year": "2022",
    "lyrics": "  මොහොතක් දැවටී මාව සිඹිනා සුළගක් ඇවිදින් මා සොයා හුරු වේදනා සාදලා දුර යාවී දැන් මා දමා   නොරැදී බිදුවක් ඈත ඇදෙනා නුඹගෙන් සැනසුම් කෝ කියා හිත පෑරෙනා රෑ පුරා තාමත් මං හොයනවා   සීමා බිඳදාලා සිසිරා සිසිරා එනවා නම් මා සොයලා සොයලා කඳුලැල් මල් මාලා ගොතලා ගොතලා පිසඳා ගන්නම් සිතාලා සිතාලා   ඉහිලුම් සෝ සුසුමන් රිදුමන් එහෙනම් නෑ හීනෙන් පුරා ඔබ හා මා   රිදවූ මතකේ දෑස වසලා කදුලක් ඇවිදින් මා සොයා මගෙමැයි කියා කී කතා දෙසවන් මත ඇහෙනවා   යහනේ තනිකම් හීන රිදවා ඇවිලේ සුසුමන් මා දවා හිත පෑරේනා රෑ පුරා අරුතක් මං සොයනවා   සීමා බිඳදාලා සිසිරා සිසිරා එනවා නම් මා සොයලා සොයලා කඳුලැල් මල් මාලා ගොතලා ගොතලා පිසඳා ගන්නම් සිතාලා සිතාලා   ඉහිලූ සෝ සුසුමන් රිදුමන් එහෙනම් නෑ ඔබ හා මා සිසාරා සිසාරා එනවා නම් මා සොයලා සොයලා කඳුලැල් මල් මාලා ගොතලා ගොතලා පිසඳා ගන්නම් සිතාලා සිතාලා   සීමා බිඳදාලා සිසිරා සිසිරා එනවා නම් මා සොයලා සොයලා කඳුලැල් මල් මාලා ගොතලා ගොතලා පිසඳා ගන්නම් සිතාලා සිතාලා",
    "metaphors": [{
            "domain": "විරහව",
            "source": "මොහොතක් දැවටී මාව සිඹිනා සුළගක් ඇවිදින් මා සොයා",
            "target": "ප්‍රේමය",
            "interpretation": "තාවකාලික ප්‍රේමය"
        },
        {
            "domain": "විරහව",
            "source": "කඳුලැල් මල් මාලා ගොතලා",
            "target": "ඇඩීම",
            "interpretation": "දිගටම ඇඩීම"
        }
    ]
},
{
    "title": "රහත් හිමිවරුන්",
    "singer": ["රවි ජේ", "දයාන් හෙවගෙ"],
    "lyricist": ["චන්ද්‍රසේන තලන්ගම"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "රහත් හිමිවරුන්",
    "year": "2020",
    "lyrics": "  රහත් හිමිවරුන් උඩින් වඩිනවා වී පැදුරට හෙවනැල්ල වැටෙනවා සිරිමහ බෝපත් බුදු බණ ලියැවී පාවී යනවා වැව් සුළඟේ   කහ මල් පොකුරු වගේ… රන් මැලි සෑ රදුනේ…   මහා විහාරේ මහ සඟ රුවනේ මුවින් නැගේ බුදු ගුණ වරුණාවේ තව කප් දහසක් අප හට පිහිටයි දොරින් දොරට පිඬු සිඟා වඩිනු මැන   කහ මල් පොකුරු වගේ… රන් මැලි සෑ රදුනේ…   දෑස වසාගත්තා මං මනසින් හොයන්න නිමාවක් මාර සේනා වලකනකාං ඇත්ත හොයාගෙන යනවා මිසිදෙටුවෙකු වෙයිද මං මිසිදෙටුවෙකු නෙමෙ මං ඇත්ත මට වැටහෙනකාං ඇත්ත හොයාගෙන යමි ම⁣ං   බුදුන් දැක නිවන් දකින්න මේ සසරින් දැක්ක පමණින් යන්නෙ කෙසේද නිවනෙ සැණෙකින් සැප රථෙන් එකෙන් ඇවිත්.. අතහැරීම ගැන දෙසුවෙ බණ අපෙ සාදු නිවං දුර නිසාද? මම ලෙඩ ඇදේ … මරණෙ ඉන්නෙ ගන්න බලං අම්ම අඩන්නෙ ඇයි මේ පිලිමෙට වැදං අඹපු රෑපෙට දැනේද අම්මගෙ හිතේ දුක දුකෙ හේතුව අපිව ඉපදුන එක නේද? සෙත් පතා මා අත බැන්ද පිරිත් නූල දුටිමි මස්කඩේ මුදලාලි අතේද ප්රාණගාතෙ පවක්නං මරැවෙක් ඇයි නූලක් බැදං ආරක්ෂා වෙන්න ඕනෙ ප්රාණේ ඒ මරැවගෙන් නේද? හිතෙ කහටක් නැත්තං කාටවත් ගිනි දෙන් නැත්තං ඉන්නකං හොදින්නං ඇයි මං යන්නේ පන්සල් ගන්න සිල්, ඇත්ත ඇති සැටියෙන් දකින්න සිවුරක් ඕනෙමද? මේ මනසින් ගැලවෙන්න … මනසක්. හිතන්නයි ඕණ…. ",
    "metaphors": [{
            "domain": "ආගම",
            "source": "වී පැදුරට හෙවනැල්ල වැටෙනවා",
            "target": "දහම් දේශනාව",
            "interpretation": "සමානාත්මතාවයෙන් යුතු දහම් දේශනාව"
        },
        {
            "domain": "ආගම",
            "source": "පාවී යනවා වැව් සුළඟේ කහ මල් පොකුරු වගේ",
            "target": "දහම් දේශනාව",
            "interpretation": "නිර්මල"
        },
        {
            "domain": "ආගම",
            "source": "මාර සේනා වලකනකාං",
            "target": "නිර්වානය",
            "interpretation": "නිර්වානය"
        }
    ]
},
{
    "title": "zd8",
    "singer": ["චරිත අත්තලගේ"],
    "lyricist": ["කසුන් එදිරිසින්ඝ"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "zd8",
    "year": "2022",
    "lyrics": "  කොහොඹ කණුවේ රැහැයියො ඉන්නවා උන් රෑ මගෙ තනිකම මකනවා නුඹ තාමත් දොරකඩ ඉන්නවා දැනෙනවා   රෑ හීනෙන් ඇවිදින් ඉන්නවා උඹ කකුලෙන් අදිනවා දැනෙනවා මම දන්නේ නැතිවම කඳුලක් වැටෙනවා   ඒත් අසලින් ඇවිදින් ඉන්නවා මට ඒ බව ඉඳහිට දැනෙනවා නුඹ තාමත් ගෙපිලේ ඉන්නව හැඟෙනවා   රෑට හීනෙන් ඇවිදින් ඉන්නවා නුඹ කෙනිත්තුවා මට දැනුනා රැහැයියො නාඩන් හාමිනෙ තවමත් ඉන්නවා   සුදු පාටින් නෑ සිල් රෙදි කහ පාටට හැරිලා සේපාලිකා මල් සංකාවෙන් තනියම පිපිලා පිපුණු පැණිකොමඩු මල් එතැනම පරවී වැටිලා මගේ පොඩී එකී තුන් මාසෙන් පසු ගම යනවා   ගේ මැද පාළුයි මතකය පෑරෙයි යන එන හැම තැන නුඹ මැවිල පෙනෙයි ඉරිඟු හේන මහා ඔත්පල වෙනවා මගෙ ඇතින්නියේ නුඹ මහ ඇල අරගෙන යනවා   හතර පෝයට නුඹ සිල් ගන්නවා උරබන්දිය විස්තර අහනවා නුඹ තාමත් දොරකඩ ඉන්නවා දැනෙනවා   වැඳපු දෙවිවරු නෑ අද වඩිනවා නුඹ මඟහැරලා උන් ඉන්නවා මම දන්නේ නැතිවම කඳුලක් වැටෙනවා   හවස් යාමෙට නුඹෙ කවි ඇහෙනවා මම දෑස් වසාගෙන අහනවා නුඹ තාමත් ගෙපිලේ ඉන්නව හැඟෙනවා   වැරදිකාරයෝ මුනිවත රකිනවා දඬුවම් නැති බව උන් දන්නවා නුඹ උදුරාගිය ඇල තවමත් ගලනවා   රෑට හීනෙන් ඇවිදින් ඉන්නවා නුඹ කෙනිත්තුවා මට දැනුනා රැහැයියො නාඩන් හාමිනෙ තවමත් ඉන්නවා   “ඉමං භික්ඛං සපරික්ඛාරං ඉමස්මී..නසින්නස්ස භික්ඛු සංඝස්ස දේම….” පාලි පාඨයෙහි සිංහල අර්ථය : මේ මතක වස්ත්‍රය සඟ සතු කොට පූජා කරනු ලැබේ.     ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සුදු පාටින් නෑ සිල් රෙදි කහ පාටට හැරිලා",
            "target": "මරණය",
            "interpretation": "තවදුරටත් භාවිතා නොවේ"
        },
        {
            "domain": "ආදරය",
            "source": "මගෙ ඇතින්නියේ",
            "target": "බිරිඳ",
            "interpretation": "ශක්තිමත් බිරිඳ"
        }
    ]
},
{
    "title": "ලන්ග ලනග",
    "singer": ["දිනෙශ් ගමගේ "],
    "lyricist": ["දුලන්ජ අල්විස්"],
    "composer": ["චමත් සන්ගීත්"],
    "album": "ලන්ග ලනග",
    "year": "2022",
    "lyrics": "  දැකලා ඒ රුව ආයේ සසල වේ හද මාගේ නෙතම කියවා පෑ ඒ නුරාවේ   හද නතුම නොවේවි වාගේ වශියක් ආලෙම ඈගේ හදට දුන්න ඉනාවේ බැඳුනාවේ   ඒ ළඟ ළඟ ළඟ ළඟ දැවටෙන් හිත මගේ දව දව දව දව රඟදෙන් වත නුබේ දැක දැක දැක දැක ඇවිලෙම් සිහිනෙක බැඳි මට කෙල්ලේ නැත ඉවසුම්   ඒ ළඟ ළඟ ළඟ ළඟ දැවටෙන් හිත මගේ දව දව දව දව රඟදෙන් වත නුබේ දැක දැක දැක දැක ඇවිලෙම් සිහිනෙක බැඳි මට කෙල්ලේ නැත ඉවසුම්   කෙල්ලේ කෙල්ලේ වෙනස කලා මාව පිස්සෙක් ඇස් අරින්න දෙන්නෑ මට ඒ ඇස් වල දිස්නේ සරාගී රහසක් දෙතොල් වලින් දිස්වෙයි ඇ මුමුනාවී සම පුරාම රාගී හැගුමන් ඇවිස්සේයි   තාලෙකට ඇගේ රන හසුන් ඉස්සෙයි උතුරම සවිදිය මදු බදුන් හිස්වෙයි මං ආස පස්සෙන් එන්න රෑ තිස්සේ ඈ තුවාල කලා ඒක ආදර කිනිස්සෙන්   නොදැන නෙවෙයි දැන දැනම මම ගිහින් පැටලුනා මායම් දැලක සිර වෙලා ඇගේ සිරුරේ ගැබුරු තැනක ‍රුංගාර රස විදිමි අකුණු සැරක   ආසම සැරට වශීවෙලා වගේ මම ඇවිදින හැඩට තොල් තදකරන් ඒ රෝස තොල් මැදට ඉන්න තිබුනොත් ඇති වෙන මුකුත් එපා දැනට   ඒ ළඟ ළඟ ළඟ ළඟ දැවටෙන් හිත මගේ දව දව දව දව රඟදෙන් වත නුබේ දැක දැක දැක දැක ඇවිලෙම් සිහිනෙක බැඳි මට කෙල්ලේ නැත ඉවසුම්   ඒ ළඟ ළඟ ළඟ ළඟ දැවටෙන් හිත මගේ දව දව දව දව රඟදෙන් වත නුබේ දැක දැක දැක දැක ඇවිලෙම් සිහිනෙක බැඳි මට කෙල්ලේ නැත ඉවසුම්   ඒ ළඟ ළඟ ළඟ ළඟ දැවටෙන් හිත මගේ දව දව දව දව රඟදෙන් වත නුබේ දැක දැක දැක දැක ඇවිලෙම් සිහිනෙක බැඳි මට කෙල්ලේ නැත ඉවසුම්   නොදැන නෙවෙයි දැන දැනම මම ගිහින් පැටලුනා මායම් දැලක සිර වෙලා ඇගේ සිරුරේ ගැබුරු තැනක ‍රුංගාර රස විදිමි අකුණු සැරක   ආසම සැරට වශීවෙලා වගේ මම ඇවිදින හැඩට තොල් තදකරන් ඒ රෝස තොල් මැදට ඉන්න තිබුනොත් ඇති වෙන මුකුත් එපා දැනට ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "හදට දුන්න ඉනාවේ",
            "target": "ආකර්ෂණය",
            "interpretation": "නොඅඩු ආකර්ෂණය"
        },
        {
            "domain": "ආදරය",
            "source": "තුවාල කලා ඒක ආදර කිනිස්සෙන්",
            "target": "ආකර්ෂණය",
            "interpretation": "නොඅඩු ආකර්ෂණය"
        },
        {
            "domain": "ආදරය",
            "source": "පැටලුනා මායම් දැලක සිර වෙලා",
            "target": "ආදරය",
            "interpretation": "නොඅඩු ආකර්ෂණය"
        }
    ]
},
{
    "title": "අදරයේ අරගලයි",
    "singer": ["දිනෙශ් ගමගේ"],
    "lyricist": ["මනුරන්ග විජේසේකර"],
    "composer": ["දිනෙශ් ගමගේ"],
    "album": "අදරයේ අරගලයි",
    "year": "2022",
    "lyrics": "  ඔබත් එන්න මිතුරේ අපිත් එක්ක ගමනේ ආදරයේ අරගලය යි මේ   හෙටක් සොයන සටනේ ඇරඹුම මේ බිමනේ ආදරයේ අරගලයයි මේ   කතිරෙන් කරපු හොරකම් තව බෑ ඉන්න ඉවසන්   ඇසුනාද දැනුනාද මිනිසුන් ලග එනවා ජයගන්න සුළගක් වාගේ පොදු හීන ඇති හීන මිනිසුන් ඇහැරෙනවා   ඔබත් එන්න මිතුරේ අපිත් එක්ක ගමනේ ආදරයේ අරගලය යි මේ   හෙටක් සොයන සටනේ ඇරඹුම මේ බිමනේ ආදරයේ අරගලයයි මේ   කතිරෙන් කරපු හොරකම් තව බෑ ඉන්න ඉවසන්   පරදා කරුම ජඩකම් යමුදැන් උන්ව පෙරලන් කතිරෙන් කරපු හොරකම් තව බෑ ඉන්න ඉවසන්   පරදා කරුම ජඩකම් යමුදැන් උන්ව පෙරලන් කතිරෙන් කරපු හොරකම් තව බෑ ඉන්න ඉවසන්   ඔබත් එන්න මිතුරේ අපිත් එක්ක ගමනේ ආදරයේ අරගලය යි මේ   හෙටක් සොයන සටනේ ඇරඹුම මේ බිමනේ ආදරයේ අරගලයයි මේ   ඔබත් එන්න මිතුරේ අපිත් එක්ක ගමනේ ආදරයේ අරගලය යි මේ   හෙටක් සොයන සටනේ ඇරඹුම මේ බිමනේ ආදරයේ අරගලයයි මේ     ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "ගමනේ",
            "target": "අරමුන",
            "interpretation": "අරමුන"
        },
        {
            "domain": "ආදරය",
            "source": "කතිරෙන් කරපු හොරකම්",
            "target": "දේශපාලනය",
            "interpretation": "දූශිත දේශපාලනය"
        }
    ]
},
{
    "title": "නැවුම් කලෙ",
    "singer": ["චරිත අත්තලගේ"],
    "lyricist": ["චන්ද්‍රසේන තලන්ගම"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "නැවුම් කලෙ",
    "year": "2020",
    "lyrics": "  නැවුම් කළේ පොඩි නැවුම් කළේ උඹ  නැවුම් සුවඳ අඩු නෑ  අලුත් ළිඳේ දියවරින් පුදන්නට  කැමැත්ත දෙයි සැක නෑ   පොලෙන් ගෙනා පොඩි නැවුම් කළේ උඹ  නැවුම් සුවඳ අඩු නෑ  අලුත් ළිඳේ දියවරින් පුදන්නට  කැමැත්ත දෙයි සැක නෑ   බිතක්කනට පිටදී නිය සැපුවයි  සැරින් සැරේ ඇහැ විදුලිය කෙටුවයි  යමින් එමින් ඇඹරෙයි මගේ හිත  බාන කඩාගෙන යයි   ඇබිත්තකට හිටපං තව නොදුවා  කොනිත්තමින් ගියෙ ඇයි මට පිටුපා  දාංගලේ බොහොමයි මගෙ නංගියේ  මේං මේක අහපං ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "නැවුම් කළේ",
            "target": "ගෑනු ලමයෙක්",
            "interpretation": "පිරිසිඳු, අහිංසක, සංස්කෘතික"
        },
        {
            "domain": "ආදරය",
            "source": "අලුත් ළිඳේ දියවරින් පුදන්නට",
            "target": "ප්‍රේමය වීමට",
            "interpretation": "ප්‍රථම ප්‍රේමය වීමට"
        },
        {
            "domain": "ආදරය",
            "source": "ඇහැ විදුලිය කෙටුවයි",
            "target": "ඉගි කිරීම",
            "interpretation": "ඉගි කිරීම"
        }
    ]
},
{
    "title": "නොලියමි",
    "singer": ["කාන්චනා අනුරාදි"],
    "lyricist": ["නිසල් ගමගේ"],
    "composer": ["අමිත් ගුරු"],
    "album": "හතේ හත",
    "year": "2022",
    "lyrics": "  නොලියමී අසුන්දරකම් ඉතින් මතකෙන් වියැකුනා වේ හිමි නැතී පෙමින් තව නම් නොවෙම් මා තොර සොදුර මාගේ   හීනයක් හීනයක් දෑස අභියස මා ලග දැන් හීනයක් හීනයක් මවනු නොහැකිව මා   අහංවර වී ඔබෙන් පැමිණී වසන්තය මල් නෑ පිපී සොවින් නොතැවී ගිමන් හරිමී අදින් පසු නවතීමී   මුවපුරා හරි ආදරෙන් ආදරෙන් ඔබ කී වදන් නෑසුනා තරමින් දුරින් මා හිදින්නේ ඈතකින්   අහංවර වී ඔබෙන් පැමිණී වසන්තය මල් නෑ පිපී සොවින් නොතැවී ගිමන් හරිමී අදින් පසු නවතීමී   රෑ පුරා දැවෙනා සුසුම් සෝසුසුම් අළුවී ගිහින් ඔබ ගෙනා උනුසුම් හැගුම් හීතලින් වියැකී ගිහින්   අහංවර වී ඔබෙන් පැමිණී වසන්තය මල් නෑ පිපී සොවින් නොතැවී ගිමන් හරිමී අදින් පසු නවතීමී ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "ඔබෙන් පැමිණී වසන්තය මල්",
            "target": "සතුට",
            "interpretation": "නොඅඩු සතුට"
        },
        {
            "domain": "විරහව",
            "source": "සෝසුසුම් අළුවී ගිහින්",
            "target": "විරහව",
            "interpretation": "අපේක්ශා බිද වැටීම"
        }
    ]
},
{
    "title": "පැනි බින්දක්",
    "singer": ["චරිත අත්තලගේ", "හශානි වාසනා"],
    "lyricist": ["කසුන් එදිරිසින්ඝ"],
    "composer": ["චරිත අත්තලගේ "],
    "album": "පැනි බින්දක්",
    "year": "2021",
    "lyrics": "  ආදරයේ පැණි බිංදක් නුබේ දෙතොලේ තිය යන්නම් දුර අහසේ ඉම සොයලා ඉගිලීලා යලි එන්නම්   පැණි බිදු හා දැවටෙන්නම් නුඹේ සුවදේ කිමිදෙන්නම් හිනැහීලා සැරසීලා මල් කුමරෝ මම ඉන්නම්   හදවත ස්නේහ වෑහෙනා පැණිබිදු නුඹටමැයි කියා රවටනු සේම නුඹව සිපගන්නම්   පැණි බිදු හාදු තවරනා වෙනසක හේතු තේරුනා නොදැනුනු සේම නුඹව සිපගන්නම්   නුඹ කලුවරට බය හැගෙයි අද රෑ තනි රකිනු සිතෙයි අලුයම සීතලේම ගුලි වෙන්නම්   මම කලුවරට බය නොවෙයි එනමුදු තනිකමක් දැනෙයි අලුයම සීතලේම සමුදෙන්නම්   නන්නාදුනන එලි දිලෙයි කුණාටුවක්ද මට බයයි නුඹ අසලින්ම සොදුර මම ඉන්නම්   දෑසට දෑස දුර හැගෙයි නුඹ අන්සතුමදැයි දැනෙයි නොදැනුන සේම සොදුර මම ඉන්නම්   නෙක මල් උයන් හමුවනා නොසොයමි ප්‍රේම ප්‍රාර්ථනා අගවනු සේම නුඹව සිපගන්නම්   මා හැම රැයක පෑරුණා දැන දැන හේතු කාරණා නොදැනුනු සේම නුඹව සිපගන්නම්   ආදරයේ පැණි බිංදක් නුබේ දෙතොලේ තිය යන්නම් දුර අහසේ ඉම සොයලා ඉගිලීලා යලි එන්නම්   පැණි බිදු හා දැවටෙන්නම් නුඹේ සුවදේ කිමිදෙන්නම් හිනැහීලා සැරසීලා මල් කුමරෝ මම ඉන්නම් ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "පැණිබිදු",
            "target": "ප්‍රාර්තනා",
            "interpretation": "මිහිරි ප්‍රාර්තනා"
        },
        {
            "domain": "විරහව",
            "source": "කුණාටුවක්ද",
            "target": "කරදර",
            "interpretation": "බොහො කරදර"
        }
    ]
},
{
    "title": "රතු තොල්",
    "singer": ["දිනෙශ් ගමගේ"],
    "lyricist": ["දිනෙශ් ගමගේ"],
    "composer": ["දිනෙශ් ගමගේ"],
    "album": "හතේ හත",
    "year": "2022",
    "lyrics": "  රතු තොල් සිපගන්නද මං ආයේ සිත තනි නෑ ඔබගේ ඇස් මානේ පැහැදුල් සිනහා අමතක කර මා ඉන්නේ සැමදා   මතකය සැමදා සිත තුල සගවා සැනසෙන්නම් මා   ඔය අත ගෙන ආයේ හොර රහසේ දුර යන්නට හිතුනා   මේ හීනයේ හැගුමන් හිතේ ගිලිහී ගියේ ආයේ ඔය අතගෙන ආයේ හොර රහසේ යන්නට හිතුනා   දෑසින් වැටෙනා කදුලක් ගානේ ඔබ දැනුනා ගෙවෙනා මොහොතක් ගානේ තනිකම් තනි මැකුවා   ජීවිතේ ආදරේ මා සොයනා හැගුමන් මතුවූවා ආදරයේ අර්ථය මා ආදරයෙන් නුඹගෙන් දුටුවා   රතු තොල් සිපගන්නද මං ආයේ සිත තනි නෑ ඔබගේ ඇස් මානේ   මේ හීනයේ මේ හීනයේ හැගුමන් හිතේ ගිලිහී ගියේ ආයේ ඔය අතගෙන ආයේ හොර රහසේ යන්නට හිතුනා ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "ඔය අත ගෙන",
            "target": "විවාහ වෙනවා",
            "interpretation": "විවාහ වෙනවා"
        },
        {
            "domain": "ආදරය",
            "source": "පැහැදුල් සිනහා",
            "target": "ආදරය",
            "interpretation": "අව්‍යාජ"
        }
    ]
},
{
    "title": "දැනෙනා තුරු මා",
    "singer": ["දිනෙශ් ගමගේ", "කාන්චනා අනුරාදි"],
    "lyricist": ["මනුරන්ග විජේසේකර"],
    "composer": ["අමිත් ගුරු"],
    "album": "දැනෙනා තුරු මා",
    "year": "2020",
    "lyrics": "  දැනෙනා තුරු මා ඉන්නද නුඹ ගාවින් මියෙනා දිනයේ කදුලක රස විදිමින්   නුඹගේ පහසේ රහසක් වූ මාගේ නොලියූ කවියේ පද එකිනෙක බිදුනේ   දැනෙනා සෙනෙහේ අයිතිය නැති මා කවුරුන්දෝ කියලා ඇසුවා   අපගේ වරදේ ගැඹුරක් දැනෙනා දවසේ මොහොතක් මං සිතුවා   නිල් පාටින් හැඩ මේ අහස ආදරේ දුක වින්දා ද   මා ගාවින් උන් ඒ හීන පාවෙලා යනවා දුර ඈත   නැවත හමු නොවේන සංසාර ගීයේ හිතක තනි මකනවා අපගේ ප්‍රේමයට පසුවදන ලිව්වේ කවුදෝ අපි සොයනවා   දැනෙනා තුරු මා ඉන්නද නුඹ ගාවින්   වෙන්වී යන බව දැන දැනම තාම හිත ඉල්ලන ඔය දෑත   අහස ගුගුරා කිව් ඒ පුවත තේරුනා මටනම් කල් ඇතිව   නැවත හමු නොවේන සංසාර ගීයේ හිතක තනි මකනවා අපගේ ප්‍රේමයට පසුවදන ලිව්වේ කවුදෝ අපි සොයනවා   දැනෙනා තුරු මා ඉන්නද නුඹ ගාවින් ",
    "metaphors": [{
            "domain": "විරහව",
            "source": "කදුලක රස විදිමින්",
            "target": "විරහව",
            "interpretation": "දුකින්"
        },
        {
            "domain": "විරහව",
            "source": "හීන පාවෙලා යනවා දුර ඈත",
            "target": "බලාපොරොත්තු නැතිවීම",
            "interpretation": "බලාපොරොත්තු නැතිවීම"
        },
        {
            "domain": "විරහව",
            "source": "ප්‍රේමයට පසුවදන",
            "target": "විරහව",
            "interpretation": "ප්‍රේමය අවසානය"
        },
        {
            "domain": "ආදරය",
            "source": "අහස ගුගුරා කිව් ඒ පුවත",
            "target": "විරහව",
            "interpretation": "නරක ආරංචියක්"
        }
    ]
},
{
    "title": "ඔයයි මමයී",
    "singer": ["දිනෙශ් ගමගේ"],
    "lyricist": ["දිනෙශ් ගමගේ"],
    "composer": ["දිනෙශ් ගමගේ"],
    "album": "ඔයයි මමයී",
    "year": "2018",
    "lyrics": "  වල ගැහුනු කම්මුල් වාගේ හිත ගෙනියන්නයි ආවේ හිරිමල් උදේ   හිනා වෙන මොහොතක් ගානේ හිත සනසයි ඈ මාගේ නොසිතු දිනේ   හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි   රෝස මල් පාට රෝස මල් අරගෙනයි ආවේ මං බල බලා අහක බල බලා ඉන්නේ ඇයි බොරු කැටයම් ඔය දෙතොලට ලං වෙලා ඔය තුරුලේ සිර වෙලා දැන් ලන් වී ඉන්න ආසයි.. සැනසී..   හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි   සීතලේ හරිම සීතලේ ආපි තෙමෙමුද වැස්සේ ආදරෙන් ලිව්ව තනුවේ මිහිර විදිමුද සිත්සේ ඔය දෙතොලට ලං වෙලා ඔය තුරුලේ සිර වෙලා දැන් ලන් වී ඉන්න ආසයි.. සැනසී..   වල ගැහුනු කම්මුල් වාගේ හිත ගෙනියන්නයි ආවේ හිරිමල් උදේ…..   හිනා වෙන මොහොතක් ගානේ හිත සනසයි ඈ මාගේ නොසිතු දිනේ…   හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි හැන්දෑවේ ඔයයි මමයි ඔයයි මමයි ඔයයි මමයි ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "වල ගැහුනු කම්මුල් වාගේ හිත ගෙනියන්නයි",
            "target": "කාන්තාව",
            "interpretation": "සුවිශේෂි කාන්තාව"
        },
        {
            "domain": "ආදරය",
            "source": "බොරු කැටයම්",
            "target": "කාන්තාව",
            "interpretation": "අහන්කාර කාන්තාව"
        }
    ]
},
{
    "title": "තමරසා",
    "singer": ["දිනෙශ් ගමගේ"],
    "lyricist": ["දිනෙශ් ගමගේ"],
    "composer": ["ලහිරු දනන්ජය"],
    "album": "තමරසා",
    "year": "2019",
    "lyrics": "  සිහිනේ පායාවි රැ….අදුරේ තනිවෙන්නෙ නෑ..  සොදුරේ අත් වැල් බැදන්….  දුර ඈතට ඉගිල යන්.. ආදරයේ සීමා සොයා  කුලුදුල් මන මාලකම් විදිමින් හරි ආදරෙන්  සගවා සො සුසුමන් පවා…..   තමරසා…..තාමරසා……  ආදරෙන් ඔබ හිනෙහුනා..  සීරුවෙන් දෑස වසා…..  තුරුලුවී ඔබ හිනෙහුනා…   සිහිනේ කියා දෙන්න ලන් වී හිදින්නම්ද මා…….  සන්සාරයේ ගීය මුමුනන්න ලන් වෙන්න මා හා…  මල් යහනා අතුරන්නම් එහි සතපා සනසන්නම්  ආදරෙන් හා…………..   කදුලේ ඔබ ඔනේ නෑ….තනි නෑ ලග ඉද්දි ඈ  සොදුරේ අත් වැල් බැදන්….  දුර ඈතට ඉගිල යන්.. ආදරයේ සීමා සොයා  කුලුදුල් මන මාලකම් විදිමින් හරි ආදරෙන්  සගවා සො සුසුමන් පවා…..   තමරසා…..තාමරසා……  ආදරෙන් ඔබ හිනෙහුනා..  සීරුවෙන් දෑස වසා…..  තුරුලුවී ඔබ හිනෙහුනා… ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සිහිනේ පායාවි රැ",
            "target": "කාන්තාව",
            "interpretation": "සිහිනෙන් පෙනේවි"
        },
        {
            "domain": "ආදරය",
            "source": "සිහිනේ කියා දෙන්න",
            "target": "කාන්තාව",
            "interpretation": "සතුට ගෙනදෙන්න"
        }
    ]
},
{
    "title": "ජනතා යුගයක්",
    "singer": ["සාදර බන්ඩාර"],
    "lyricist": ["නන්දසිරි කීමියහෙට්ටි"],
    "composer": ["අන්ඩ්‍රෙව් විතාන"],
    "album": "ළියිෆ් ස්ටොරීස්",
    "year": "2022",
    "lyrics": "  ජනතා පැතුමන් අවතැන් වෙලා හොරකම් මැරකම් ඇත රජ වෙලා ඉවසා සිටියා ඇති බල බලා ජනතා යුගයක් අරඹමු වහා   යාපා පටුනේ නඩරාජලා මාගම්පුරයේ බලදේව සිඩ්නි ෆාතිමා   වරෙව් කොල්ලෝ… වරෙව් කෙල්ලෝ වරෙව් කොල්ලෝ… වරෙව් කෙල්ලෝ   සොල්දාදුවනේ අපි එක්වෙලා යමු දුෂිතයන් දැන් හඹ හඹා අලුත් රටක් ශ්‍රී ලංකා කියා වරෙව් හදන්නට අදුරේ නොයා   යාපා පටුනේ නඩරාජලා මාගම්පුරයේ බලදේව සිඩ්නි ෆාතිමා   වරෙව් කොල්ලෝ… වරෙව් කෙල්ලෝ වරෙව් කොල්ලෝ… වරෙව් කෙල්ලෝ   හොරා කාපු චෞර හැත්ත බෙල්ල ළඟින් අල්ල ගන්න දියවන්නා ඔයේ ඔබා කුණු කූඩෙට දාල එන්න   සාරෙ උරා හපකර ගිය මේ මව්බිම බේර ගන්න යෝධ බැලැති වීර පුතුනි යදම් කඩා පෙරට එන්න   ලේ තැවරුණ දෑත් වලින් කඳුළු ගෑස් ඉල්ල ගන්න වරෙව් යමව් හොරුන් රකින මේ බංකර බිඳ හෙලන්න   එපා එපා කෑලි කඩා මේ මවුබිම විකුණ ගන්න හිඟා කන්න නොවේ අපට ඉඩක් දියව් හුස්ම ගන්න   වරෙව් කොල්ලෝ… වරෙව් කෙල්ලෝ වරෙව් කොල්ලෝ… වරෙව් කෙල්ලෝ වරෙව් කොල්ලෝ… වරෙව් කෙල්ලෝ වරෙව් කොල්ලෝ… වරෙව් කෙල්ලෝ ",
    "metaphors": [{
            "domain": "දේශය",
            "source": "ජනතා පැතුමන් අවතැන් වෙලා",
            "target": "බලාපොරොත්තු",
            "interpretation": "බලාපොරොත්තු නැතිවීම"
        },
        {
            "domain": "දේශය",
            "source": " සාරෙ උරා  හපකර",
            "target": "බලාපොරොත්තු",
            "interpretation": "බලාපොරොත්තු නැතිවීම"
        },
        {
            "domain": "දේශය",
            "source": "යදම් කඩා පෙරට එන්න",
            "target": "බාධක",
            "interpretation": "බාධක බිදදැමීම"
        }
    ]
},
{
    "title": "අලේ මල්",
    "singer": ["කාන්චනා අනුරාදි"],
    "lyricist": ["ලසිත ජයනෙත්ති"],
    "composer": ["ඩිල්ශාන් සිල්වා"],
    "album": "අලේ මල්",
    "year": "2022",
    "lyrics": "  සංසාරේ මා හද ගැස්ම සොයන්නම වාගේ ආ ආවා ශෘංගාරේ පෑ හිත හීන මවන්නම් රහසේ පා පායා   ආලේ මල් පිපුණිද මේ දවල් අත අල්ලාගෙන ආවේ ඔයාදෝ   හාද වෙලා පියඹාලා සුළං රැල් අතර මගේ අසලින් හිඳින්කෝ ඔයාදෝ   ආඩම්බරේ මා අම්බරේ තරුවක් වගේ ඉන්නම් හැන්දෑකරේ අන්ධකාරේ හැංගී හිනා වෙන්නම්   ඒ හීනය නතුකර ඔබගේ පාමුල තියා මා ඔබ සතු වන්නට නොඉඳුල් හිත පේ වීලා සැබැවින් රන් නොපලන්දා ප්‍රේමයනම් නම් අත් වින්දා මේ ආශා දැහැනේ නිද්රාගත වෙම් මා   ආලේ මල් පිපුණිද මේ දවල් අත අල්ලාගෙන ආවේ ඔයාදෝ   හාද වෙලා පියඹාලා සුළං රැල් අතර මගේ අසලින් හිඳින්කෝ   සගමප ග රි සගමනි ප ම සගමප ගරිසනි ස ඔයාදෝ   ආලේ මල් අත අල්ලාගෙන ආවේ ඔයාදෝ   හාද වෙලා පියඹාලා සුළං රැල් අතර මගේ අසලින් හිඳින්කෝ   ආලේ මල් පිපුණිද මේ දවල් අත අල්ලාගෙන ආවේ ඔයාදෝ   හාද වෙලා පියඹාලා සුළං රැල් අතර මගේ අසලින් හිඳින්කෝ     ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සංසාරේ මා හද ගැස්ම",
            "target": "ආදරය",
            "interpretation": "ආදරය"
        },
        {
            "domain": "ආදරය",
            "source": "ආලේ මල් පිපුණිද",
            "target": "හැගීම්",
            "interpretation": "ආදර හැගීම්"
        },
        {
            "domain": "ආදරය",
            "source": "රන් නොපලන්දා",
            "target": "විවහ නොවී",
            "interpretation": "විවහ නොවී"
        }
    ]
},
{
    "title": "කරකාරෙ බදින්නට",
    "singer": ["කාන්චනා අනුරාදි"],
    "lyricist": ["උපාලි කන්නන්ගර"],
    "composer": ["උපාලි කන්නන්ගර"],
    "album": "කරකාරෙ බදින්නට",
    "year": "2022",
    "lyrics": "  කරකාරෙ බඳින්නට කාලෙ හොඳා බහ දුන්නොතින් ආල හිතින් කරකාරෙ බඳින්නට කාලෙ හොඳා බහ දුන්නොතින් ආල හිතින් මනලෝල රුවැත්තියෙ කෝල නොවී මගෙ මූණ බලන්න කියන් මගෙ පුංචි පැළේ සිරි දේවි වෙලා නුඹ කැමතිද ඉන්න කියන් මගෙ පුංචි පැළේ සිරි දේවි වෙලා නුඹ කැමතිද ඉන්න කියන්   නෑදෑයෝ බලන්නට ජෝඩු වෙලා අපි බක්කි කරත්තෙන් යන් මන් රත්තපුරෙන් මගෙ මැණිකෙට ඕනෙ හැම දේම ගෙනත් දෙන්නම් පන තියෙන තුරාවට හැමදේම දෙන්නෙමි සත්තයි දිව්රමි මන් අනෙ සත්තයි දිව්රමි මන්   කරකාරෙ බඳින්නට කාලෙ හොඳා බහ දුන්නොතින් ආල හිතින් කරකාරෙ බඳින්නට කාලෙ හොඳා බහ දුන්නොතින් ආල හිතින් මනලෝල රුවැත්තියෙ කෝල නොවී මගෙ මූණ බලන්න කියන් මගෙ පුංචි පැළේ සිරි දේවි වෙලා නුඹ කැමතිද ඉන්න කියන් මගෙ පුංචි පැළේ සිරි දේවි වෙලා නුඹ කැමතිද ඉන්න කියන්   මුතු මාල පොටක් ඔය ගෙල පළඳින්නට හීන බැලුවේ මන් මනමාලි කරන් නුඹ කැන්දන් යන්නට පෙරුම් පිරූවේ මන් පුර පෝයට ඉස්සර කූඩු වෙන්න අපි නැකතක් බලමුද දැන් අනෙ නැකතක් බලමුද දැන්   කරකාරෙ බඳින්නට කාලෙ හොඳා බහ දුන්නොතින් ආල හිතින් කරකාරෙ බඳින්නට කාලෙ හොඳා බහ දුන්නොතින් ආල හිතින් මනලෝල රුවැත්තියෙ කෝල නොවී මගෙ මූණ බලන්න කියන් මගෙ පුංචි පැළේ සිරි දේවි වෙලා නුඹ කැමතිද ඉන්න කියන් මගෙ පුංචි පැළේ සිරි දේවි වෙලා නුඹ කැමතිද ඉන්න කියන් ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සිරි දේවි",
            "target": "බිරිඳ",
            "interpretation": "සැප සම්පත් ගෙන දෙන බිරිඳ"
        },
        {
            "domain": "ආදරය",
            "source": "කූඩු වෙන්න",
            "target": "විවාහ",
            "interpretation": "විවාහ"
        }
    ]
},
{
    "title": "කාලි",
    "singer": ["කාන්චනා අනුරාදි"],
    "lyricist": ["රුහුනුකෙත දම්මදෙව"],
    "composer": ["තරින්දු දම්සර"],
    "album": "කාලි",
    "year": "2020",
    "lyrics": "  ප්‍රාණ සම පෙම ද්‍රෝහි වූ දා ආත්මය විය කඨෝර  සිහින් කෙඳිරිලි කෝල හසරැලි දවයි මා හද කුටීර  ඇනුම් හී වර්ෂා මැදින් ළය දෙපළු කෙරුවා කෙඨේර  වෛරයත් පිරුණාම වැඩියෙන් ගලන්යනවා පිටාර   ඵල තියෙන ගස් වටිනවාමයි සැකක් නෑ එය ඇත්තයි  වඳබැහැපු මං කොහොඹ ගානයි කදුරු වාගේ තිත්තයි  බුදු පුදට වුව වරම් ලද්දේ මලින් සැරසුනු ඉත්තයි  මගේ හිමි ට මං පණ ඇරලා පෙම් කළා සමිදුනි සත්තයි   සත් කඩක් සේ පැළුනු හෘදය කොහොම හරි මම මහන්නම්  කෝන්තර වල කැළැල් නුඹ ගේ දෙපා මුලදිම වහන්නම්  සසර දුරවූවාට කම් නෑ යශෝදරා මුණ ගැහෙන්නම්  ඈව තනිකර සමිඳු ගිය දුක දරාගත් හැටි අහන්නම්",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "ඵල තියෙන ගස්",
            "target": "ආදරවන්තිය",
            "interpretation": "ගත යුත්තක් ඇති"
        },
        {
            "domain": "විරහව",
            "source": "කදුරු වාගේ තිත්තයි",
            "target": "විරහව",
            "interpretation": "වටිනාකමක් නැති"
        },
        {
            "domain": "විරහව",
            "source": "ඇනුම් හී වර්ෂා මැදින්",
            "target": "බැනීම",
            "interpretation": "නොනවත්වා බැනීම"
        }
    ]
},
{
    "title": "පොඩ්ඩියෙ",
    "singer": ["සාදර බන්ඩාර,"],
    "lyricist": ["ටිම්‍රන් කීර්ති"],
    "composer": ["සාදර බන්ඩාර"],
    "album": "පොඩ්ඩියෙ",
    "year": "2020",
    "lyrics": "  පොඩ්ඩියේ අම්මා අම්මාමයි තාම.. වැරදුනේ අපි නිසයි ඈ වැරදිද කෝම.. බක්මහේ කොවුල් බිජු පුපුරණ දාක.. නංගියෙ අම්මගෙන් උඹ ඉල්ලනවද ගේම..   තනේ කඩා විසිකර පත්තිනි වේ නම්.. අනේ හාමතේ අපි මැරිලා එහෙනම්.. වනේ පාරන්නෙ වන ඵල විස වී නම්.. නගේ දැන් යමං පඬි පුර ගිනි තියපන්..   සතා කියා ඉඳහිටක දි ඇහුනාට.. කතා හදන උන් සේරම බෝසත් ද.. යකා වැහෙන්නට පෙර උඹෙ අයියාට.. කතන්දර එපා වැඳපන් අම්මාට..   දන් කඳ නැතිදාට රන්කඳ වී පෙනිලා.. ලොකු හැමුදුරුවො අණකර බණ පද එව්වා.. මුචලින්දගෙ ඇහේ නයි කඳුලක් නැටුවා.. අපෙ අම්මා බණ කතාවක් බුදුගෙයි ලිව්වා..   රත්වුන යකඩ ලෝකුරු ගෑණුත් තැලුවා.. මත්වුණු බමරු ඉටිමල් පොකුරෙත් වැහුවා.. ඇත්තට ලෝකෙ ගැන උඹ දන්නෙ ද මොනවා.. පත්තිනි සළුවලත් ඇත් තුත්තිරි තිබුණා..   සතා කියා ඉඳහිටක දි ඇහුනාට.. කතා හදන උන් සේරම බෝසත් ද.. යකා වැහෙන්නට පෙර උඹෙ අයියාට.. කතන්දර එපා වැඳපන් අම්මාට.. ",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "දන් කඳ නැතිදාට රන්කඳ වී පෙනිලා",
            "target": "අම්මා",
            "interpretation": "ආත්මාර්තකාමී"
        },
        {
            "domain": "ජීවිතය",
            "source": "මුචලින්දගෙ ඇහේ නයි කඳුලක් නැටුවා",
            "target": "බොරු සිල්වතුන්",
            "interpretation": "බොරු අනුකම්පාව"
        },
        {
            "domain": "ජීවිතය",
            "source": "රත්වුන යකඩ ලෝකුරු ගෑණුත් තැලුවා",
            "target": "සාර්තක පුද්ගලයන්",
            "interpretation": "සාර්තක පුද්ගලයන් වුනත් මුලාවේ වටුනා"
        },
        {
            "domain": "ජීවිතය",
            "source": "පත්තිනි සළුවලත් ඇත් තුත්තිරි තිබුණා",
            "target": "සාර්තක පුද්ගලයන්",
            "interpretation": "කිසියම් වැරද්දක්"
        }
    ]
},
{
    "title": "ප්‍රේමය නම් ආගම",
    "singer": ["සාදර බන්ඩාර"],
    "lyricist": ["ටිම්‍රන් කීර්ති"],
    "composer": ["සාදර බන්ඩාර"],
    "album": "ප්‍රේමය නම් ආගම",
    "year": "2020",
    "lyrics": "  වෙඩි බෙහෙත් අහිංසකයි   ජිනදාස කොල්ලෝ ඔයා සිංහලේ ගියා ද? ලැජ්ජයි ජේසු දාස අයියො ඔයා දැන් දාසයෙක් වෙලා ද? ලැජ්ජයි හසන් රාසා දෙයියනේ ඔයා ජිහාඩ් කඩුව හලාල් කෙරුව ද?   ඔයාලට දැන් සනීප ද?   ගිනි ගත්ත දේව මැදුරේ රතු ලේ විලක් මැද පොඩි දුවක් වැටිලා හිටියා ඇස් දෙක පියාගෙන   පුපුර වන්න ලොවෙත් බැරි එක ප්‍රේමය නම් ආගම ඔයාලා දැක්ක ද පොඩි එකාගේ කිරි දත් සෙට් එක   රෝස නිම්නය පෙනි පෙනී සමනලුන්ට වෙඩි වදී පෑදි දියමත පා වෙවී ස්වර්ගයට යයි මලමිනී   අල්ලාහ් නැවත එන්න ජේසුනී නැවත එන්න මිනිසුන්ට කියල දෙන්න ප්‍රේමය නම් ආගම   පිරිත් පැන් බීලයි සුදු මකරු ගිනි පිඹින්නේ කුරුස දලු දාලයි බයිබලේ ටිකෙන් ටික වැහෙන්න අබායාවක් මැද පලුවකි මැදෙන්නේ   කවුද හත් දෙයියනේ ස්වර්ගෙට යන හරිම පාර කියන්නේ   රාසා රාසා මැරෙනවානම් අපි මැරෙමු මචං පුපුරන් වෙඩි නූල ගෙනත් මගෙ පපුවේ හරි මැදම බැදපං පුපුරනා දේ අපේ ලෝකෙට මවපු කෙනා හොයපං   වෙඩි බෙහෙත් අහින්සකයි දරුණුයි අපේ ආගම් වෙඩි බෙහෙත් අහින්සකයි දරුණුයි අපේ ආගම් වෙඩි බෙහෙත් අහින්සකයි දරුණුයි අපේ ආගම්   රෝස නිම්නය පෙනි පෙනී සමනලුන්ට වෙඩි වදී පෑදි දියමත පා වෙවී ස්වර්ගයට යයි මලමිනී   අල්ලාහ් නැවත එන්න ජේසුනී නැවත එන්න මිනිසුන්ට කියල දෙන්න ප්‍රේමය නම් ආගම ",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "රෝස නිම්නය",
            "target": "ජීවිතය",
            "interpretation": "සුන්දර ජීවිතය"
        },
        {
            "domain": "ජීවිතය",
            "source": "සමනලුන්",
            "target": "ලමයින්",
            "interpretation": "අහින්සක ලමයින්"
        },
        {
            "domain": "ජීවිතය",
            "source": "සුදු මකරු ගිනි පිඹින්නේ",
            "target": "මිනිසුන්",
            "interpretation": "කපටි මිනිසුන්"
        }
    ]
},
{
    "title": "මා වෙත එන්න",
    "singer": ["කාන්චනා අනුරාදි"],
    "lyricist": ["කමල් ගුනරත්න"],
    "composer": ["සුරෙශ් මාලියද්ද"],
    "album": "මා වෙත එන්න",
    "year": "2022",
    "lyrics": "  මව්බිම රකින්නේ ජවයේ බලයෙන්ය යෝධ ජවය ලැබුනේ දෙවි පිහිටෙන්ය දහදුක් විදෙන්නේ අප සැම වෙනුවෙන්ය මා ජීවත් වුනේ ලද පියසෙනෙහෙන්ය   මොලකැටි වදන් ඔබේ සවට තෙපලන්න මා හඩනා විට තුරුලට අරගන්න   ඔබ දන ගැසූවිට අලියා පිට යන්න මතකයි බලා උන් හැටි මා නැලවෙන්න   තුරුලට වෙලා පිය උනුහුම විදගන්න පින් මදිවෙන්නැති උකුලට වී ඉන්න   එල්ලී ඇගිල්ලේ ඉස්කෝලෙට යන්න මැව්වෙමි සිහින සගවා කදුලැලි ගොන්න   තව තව ජවය ලැබ සතුරන් මැඩලන්න මව්බිම රැකගන්න එහි කිසරිදු වන්න   මා තුරුලට අරන් පිය උනුහුම දෙන්න මගේ ලෝකයේ හිරු වී මා වෙත එන්න මගේ ලෝකයේ හිරු වී මා වෙත එන්න ",
    "metaphors": [{
        "domain": "ආදරය",
        "source": "මගේ ලෝකයේ හිරු වී",
        "target": "පියා",
        "interpretation": "හරි මග කීයාදීම"
    }]
},
{
    "title": "හැඩකාරි නාරි",
    "singer": ["දිනෙශ් ගමගේ"],
    "lyricist": ["මනුරන්ග විජේසේකර"],
    "composer": ["තුසිත් නිරොශන"],
    "album": "හැඩකාරි නාරි",
    "year": "2022",
    "lyrics": "  වගතුග කොහොම කියා ඇහුවට උත්තර නෑ මගතොට දකින නිසා හිත තව ඉවසන්නෑ ඉගසුග පැද්දී පොලවත් යයි පැද්දී නුඹ ලග ඉද්දී මගේ හිත සුරලෝකේ   යමු අපි දෙන්නා ලස්සන සලුපිලි ගත දවටාලා සුර ලොව පෙන්නා ඉමු අපි අපේම වෙලා   මේ නාරී නාරී මගේ භාරී භාරී මගේ භාරී භාරී හැඩකාරී නාරී   මේ නාරී නාරී මගේ භාරී භාරී මගේ භාරී භාරී හැඩකාරී නාරී   හේ තංගච්චි සිංහල තෙරියම ද ඉන යට වංගෙඩියක් හංගලා ද කිරි කිරි ගානව ඉන පදදලම ඇත්ත කියහං ගෙදරින් ඔයා බැන්දුවාද   නැත්නම් මම වෙන්නම් හස්බන්ඩ් අනිත් කෙල්ලො ටික ගන්න වෙයි හැබයි ඩස්ට්පෑන් සිංදුවකුත් කියන්නම් බීබර් වගේ ජස්ටින් පස්සේ කැමතිනම් කරමුද අපි ඩිස්ටි ඩි ඩිං   උණු වැඩි වුන විටක් වගේ හාදුවෙන් පිච්චුව ඇය කටත් මගේ එකෙන් අරගත්තේ ඇදුම ඇගේ හුළගට ලෙල දෙද්දී නම් ශෝයි අනේ   යමු අපි දෙන්නා ලස්සන සලුපිලි ගත දවටාලා සුර ලොව පෙන්නා ඉමු අපි අපේම වෙලා   දැක්කම මේ නාරී නාරී කරගත්තම මගේ භාරී භාරී දැන් වෙනවද මගේ භාරී භාරී සිප ගන්නකන් හැඩකාරී නාරී   දැක්කම මේ නාරී නාරී කරගත්තම මගේ භාරී භාරී දැන් වෙනවද මගේ භාරී භාරී සිප ගන්නකන් හැඩකාරී නාරී ",
    "metaphors": [{
        "domain": "ආදරය",
        "source": "ඉන යට වංගෙඩියක් හංගලා ද",
        "target": "උකුල",
        "interpretation": "පුලුල් උකුල"
    }]
},
{
    "title": "සෙබල පුතු",
    "singer": ["බාතිය සන්තුශ්", "ධනිත් ශ්‍රී"],
    "lyricist": ["කමල් ගුනරත්න"],
    "composer": ["ධනිත් ශ්‍රී"],
    "album": "සෙබල පුතු",
    "year": "2020",
    "lyrics": "නැති වුවත්‌ මවු බිමේ අහලක්‌ තමන්ගේ යැයි කීමට නුඹයි හැම බිම්‌ අඟලක්ම නිදහස්‌ කලේ ලක්‌ මෑණිට ජිවිනේ හැම මිහිරි දේවල්‌ අහිමි චූවත්‌ ඔබ හට දිවි පරදු කර සටන්‌ කෙරුවේ. ලක්‌ මචුන්‌ රැක ගැනුමට...  රට නසන්නට සතූරු කැල අවි දරා ආවිට දස දෙසින්‌ අප පුතූන්‌ ඉදිරියට ආවේ මච්බිමට ඇති සෙනෙහසින්‌ කොතෙක්‌ සිටියද මෙහෙයවන්නට යුද්දයේ සෙන්පති වරුන්‌ රටට ණය නැති සෙබල පුත නුඹ තමයි කණ්ඩුල ඇත්‌ රජුන්‌  (දශක ගණනක්‌ අපේ මින්සුන්‌ විඳි අපා දුක්‌ යුද බියෙන්‌ තුරන්‌ කල ඔබ සදා නොමියෙන අපේ විරුවකි හදවතින්‌ ඉදිරි දිවියම ඇඳට වී ඔබ ගත කළත්‌ අප හඬවමින්‌ වැය කලේ ඔබ ඔබේ අද දින අපේ හෙට දින සුරකිමින.. ..//)  සෙනෙවියන්‌ සෙන්පනතිවරුන්‌ යුධ මෙහෙයවූවත්‌ අණ දෙමින්‌ නොහැක මේ නිදහස ලබන්නට නොගහිටියා නම්‌ මේ පුතූන්‌ කැප කලේ මුළු තරුණ දිවියම දෙඇස්‌ අනත්‌ පා දන්‌ දෙමින්‌ සෙබල පුත නුඹ චැදු මව චෙනු ඇතිය මෙපිනින්‌ මතු බුදුන්‌",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "ලක්‌ මචුන්‌",
            "target": "උපන්බිම",
            "interpretation": "උපන්බිම අවශ්‍ය් සැප සම්පත් ආරක්ශාව ලබාදීම"
        },
        {
            "domain": "ආදරය",
            "source": "නුඹ තමයි කණ්ඩුල ඇත්‌ රජුන්‌",
            "target": "සෙබලෙක්",
            "interpretation": "ශක්තිවන්ත"
        }
    ]
},
{
    "title": "සුරත් සුවය",
    "singer": ["සුපුන් පෙරේරා"],
    "lyricist": ["සාදර බන්ඩාර"],
    "composer": ["සරිත එදිරිසින්ඝෙ"],
    "album": "සුරත් සුවය",
    "year": "2018",
    "lyrics": " නිල් වරල පුරා මල් අතුරලා බිඟුන් මත් කරන රන් මුව මඩලින් රැස් විසිරුවා තොඩුන් දිදුලවන නිම් නාද දී යන සත් ස්වරයෙන් දෙසවන් සිල් බිඳින හදසෙන් වැදී ගජසෙන් මඬිනා දෙව්ලියේ ඔබ කවුද? ඕ, ශෘංගාරී මගේ හද විල් තීරයෙන් බැස කිමිදෙන්න දැහැනින් බැඳවුන් සලෙලුන් මුදමින් සුරත් සුවය විඳගන්න මල් මකරන්දයෙන් නා දලු තෙමා මීවිත බොන්න පෝ සඳ අසලින් පුන් සඳ තියා සාවුන් සිපගන්න හද-හද බැඳී ගත-ගත වෙලී යන මේ රැය පුරාවට වීණා වැයුමට සකි පන්සිළු හට ඇරයුම් කරන්නද? ඕ, ශෘංගාරී මගේ හද විල් තීරයෙන් බැස කිමිදෙන්න දැහැනින් බැඳවුන් සලෙලුන් මුදමින් සුරත් සුවය විඳගන්න මේ නදුන් උද්යානයේ දැහැනින් සුවය වින්ද සිත බොලඳ වෙයි සසැලෙයි සොඳුරියේ නුඹ නිසාමද? ඕ, ශෘංගාරී මගේ හද විල් තීරයේ කිමිදෙන්න දැහැනින් බැඳවුන් සලෙලුන් මුදමින් විඳගන්න",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "රන් මුව මඩලින් රැස් විසිරුවා",
            "target": "සිනහව",
            "interpretation": "ලස්සන සිනහවක්"
        },
        {
            "domain": "ආදරය",
            "source": "සත් ස්වරයෙන් දෙසවන් සිල් බිඳින",
            "target": "හඬ",
            "interpretation": "මියුරු හඬ"
        },
        {
            "domain": "ආදරය",
            "source": "හද විල් තීරයෙන් බැස කිමිදෙන්න",
            "target": "කාන්තාව",
            "interpretation": "දැඩි කැමැත්ත"
        },
        {
            "domain": "ආදරය",
            "source": "නා දලු",
            "target": "දෙතොල්",
            "interpretation": "තියුණු දෙතොල්"
        }
    ]
},
{
    "title": "රාදාවනි",
    "singer": ["සුපුන් පෙරේරා"],
    "lyricist": ["චන්ද්‍රසේන තලන්ගම"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "රාදාවනි",
    "year": "2020",
    "lyrics": " නීල නුවන් සනසන්නම් රාධාවණී, මා එන්නම් වීණා සරින් නලවන්නම් රාධාවණී, මා එන්නම් මියුරු හඬින් මා වෙත ළං, ළං වෙන්නා තුරුලු වෙලා මුව සිපගන්නම් මා නුරාගිනීයේ නේක අනන්තවු ගී ස්වර ගයන්නම් දෙඅදර සඳ කැන් දහර ඉසින්නී සොඳුරු සරාගී නෙත ලෙලවන්නී රූබර රාධා, මා මන බන්ඳා හැරදා යනු බෑ, මා ප්රිය රාධා නීල නුවන් සනසන්නම් රාධාවණී, මා එන්නම් වීණා සරින් නලවන්නම් රාධාවණී, මා එන්නම් මියුරු හඬින් මා වෙත ළං, ළං වෙන්නා තුරුලු වෙලා මුව සිපගන්නම් මා නුරාගිනීයේ නේක අනන්තවු ගී ස්වර ගයන්නම්",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සඳ කැන් දහර ඉසින්නී",
            "target": "ආදරය",
            "interpretation": "සිත කුල්මත් කරවන ආදරය ලබාදීම"
        },
        {
            "domain": "ආදරය",
            "source": "නීල නුවන්",
            "target": "ඇස්",
            "interpretation": "ලස්සන ඇස්"
        }
    ]
},
{
    "title": "චාරිකාව",
    "singer": ["සුපුන් පෙරේරා"],
    "lyricist": ["සමිත් ගොමස්"],
    "composer": ["ලහිරු සන්දීප්"],
    "album": "චාරිකාව",
    "year": "2018",
    "lyrics": " ඇවිලුනා ගිනි ඉසිඹුලනදා නිවන්න හීතල පොදක් නැති දා මග නොමග පා උමතුවෙන් තබන පියවර සීරුවෙන් අමාවක දිනෙක බොහෝ රෑ වී පියාපත් වැහැරී අමාවක දිනෙක බොහෝ රෑ වී පියාපත් වැහැරී අතරමග ගමනේ  වහන් ආ දෙනෙත් ඇරන් බලන යාත්රිකයා මා කෙලෙස් තුල කොටු වී ඉන්න යාන්ත්රිකයා හා, සතපා මිහි මත දිවි කත සමඟින් පිරිසත් ලබා තිරිසන් අතර බවක් මිනිසත් පැදන් චාරිකාව කෙලවරක් හොයන් කළුවරක් මැදන් අඳුරින් කවුරු බේරගන්න ඒවීද මාව උරුම උඩ බලන් යැද්දටත් සසරමයි තිසරණ සරණ ගියත් තාමත් මං අසරණයි අසරණයි, ගැටගහන් පණ ඇහුවා බණත් පිනෙව්වා කනත් බලන් පෑදෙනකන්ම නැණත් බව දුක් නිසාම රැය පුරාම ඉඳන් මා ලොවක කාම වපුරන් කමතෙත් අකුසල් තාම දකින හීන පසෙකින තබාගෙන ඇදන් දුවන ගැලක බැඳි ගවෙකු හට පෑදෙයිද නුවණ දැනුමෙන් දිළිඳු මනසින් බිලිඳු දකින මිරිඟු අතැර යන විට යයි කරන් ආත්මයම කිළිිටු අසරණයි, අසරණයි ඇවිලුනා ගිනි ඉසිඹුලනදා නිවන්න හීතල පොදක් නැති දා මග නොමග පා උමතුවෙන් තබන පියවර සීරුවෙන් අමාවක දිනෙක බොහෝ රෑ වී පියාපත් වැහැරී අමාවක දිනෙක බොහෝ රෑ වී පියාපත් වැහැරී අතරමග ගමනේ නිමාවක් නැතිව ඇවිදන් හැමදාමත් හොයන් ගියත් නොදැන් හසරක් රියන් හතරක් තාමත් උරුම වැසෙන තුරුම ඇස් හවුහරනක් හොයන් ගව් ගණනක් ගියත් නොපෙනුනත් ඇත මං තුලම හා, ඇරඹුමට කලින් අත හැරීම තවත් ඇයත් ලං වී ඉඳී මටත් නොදැනීම වන්දනාව අතරමග කෙලෙස් මන් අසලමයි පිරුනත් සැපයෙන් දෑත තමත් මං අසරණයි, අසරණයි අතු පතර ගෙවා යමින් කතර උනත් ලොව පතල කරයි ද මමත් නතර නෑ, මං අසල නෑ කෙනෙක් එතෙර වුනු එමෙන්ම ගෙවෙන දිවියෙන් ගැලවීමක් නුදුරින් නෑ ප්රෙහේලිකාවක් අතේ තියන් හැමදාමත් මන් මාවත් මත දුවමින් ගියත් මං ගාවත් මදි පිං ඉන්නේ මං දුරින් බොහොමයක් චාරිකවේ මැද හිඳන් ඇඟිලි ගනිමින් වැලපෙයි ඉතින්",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "වහන් ආ දෙනෙත් ඇරන් බලන යාත්රිකයා",
            "target": "මුලාවූ පුද්ගලයා",
            "interpretation": "සත්‍ය සොයයෑමට උත්සහ කරන මුලාවූ පුද්ගලයා"
        },
        {
            "domain": "ජීවිතය",
            "source": "කෙලවරක් හොයන් කළුවරක් මැදන්",
            "target": "සසර",
            "interpretation": "නිමාවක් නැති සසර"
        },
        {
            "domain": "ජීවිතය",
            "source": "දුවන ගැලක බැඳි ගවෙකු",
            "target": "දැනුමෙන් දිළිඳු මනසින්",
            "interpretation": "රැවටී දැනුමෙන් දිළිඳු මනසින්"
        }
    ]
},
{
    "title": "සන්දවතියෙ",
    "singer": ["රිද්ම වීරවර්දෙන"],
    "lyricist": ["නන්දන වික්‍රමගේ"],
    "composer": ["චරිත අත්තලගේ "],
    "album": "සන්දවතියෙ",
    "year": "2017",
    "lyrics": " සඳවතියේ ඔබ මගේම යැයි කියාලා මං අහස බලා උන්නා අහස බලා උන්නා ඇසිපිය හෙලනා ඒ සුළු මොහොතේ පවා මා වලාකුළට ඔබ මුවා වෙලා ඇයි මගේ සඳවතියේ සඳවතියේ ඔබ මගේම යැයි කියාලා මං අහස බලා උන්නා මං අහස බලා උන්නා ඇසිපිය හෙලනා ඒ සුළු මොහොතේ පවා මා වලාකුළට ඔබ මුවා වෙලා ඇයි මගේ සඳවතියේ රැඳෙන්නෑ මා නෙත් මානයේ නිවෙන්නේ ඇයි මේ යාමයේ මා රිදවනු ඇයි, මා හඬවනු ඇයි සඳවතියේ මා ඇයි තනිකෙරුවේ සඳවතියේ ඔබ මගේම යැයි කියාලා මං අහස බලා උන්නා අහස බලා ඇසිපිය හෙලනා ඒ සුළු මොහොතේ පවා මා වලාකුළට ඔබ මුවා වෙලා ඇයි මගේ සඳවතියේ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සඳවතියේ",
            "target": "ආදරවන්තිය",
            "interpretation": "සිත නිවාලන සහ ලස්සන"
        },
        {
            "domain": "ආදරය",
            "source": "වලාකුළට ඔබ මුවා",
            "target": "හැරදා යාම",
            "interpretation": "කෙටි කාලීන ප්‍රේමය"
        }
    ]
},
{
    "title": "විරාමයෙ",
    "singer": ["රිද්ම වීරවර්දෙන"],
    "lyricist": ["තිලින බොරලැස්ස"],
    "composer": ["තිලින බොරලැස්ස"],
    "album": "විරාමයෙ",
    "year": "2022",
    "lyrics": " ක්ෂිතිජය මායිමේ පාමින් සිත් රටා ඈතින් සිහිනයේ ගිලෙනා දිනයක හමුවෙනා දිනයක වෙන්වෙනා හීනෙක ජීවිතේ තවරා මතකේ ඈත ඉවුරේ යාවී පෙනෙන්නේ ඒ හීනේ විරාමයයි දිනයක හමුවෙනා දිනයක වෙන්වෙනා හීනෙක ජීවිතේ පවරා අහසට ළංවෙලා සයුරට ළංවෙලා මා හදේ ඇඳි රූ රටා ක්ෂිතිජය මායිමේ දිනයක හමුවෙනා හීනෙක ජීවිතේ තවරා ඒ විරාමයේ හමුවී නැවතී හිත සොරාගත්තා දෝ දැනුනී ඒ විරාමයේ හමුවී නැවතී හිත සොරාගත්තා දෝ දැනුනී හිත සොරාගත්තා දෝ දැනුනී ඒ විරාමයේ හමුවී නැවතී",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "ක්ෂිතිජය මායිමේ පාමින් සිත් රටා",
            "target": "පරිකල්පනය",
            "interpretation": "කිසිදා සිදුනොවන පරිකල්පන"
        },
        {
            "domain": "ආදරය",
            "source": "හදේ ඇඳි රූ රටා ",
            "target": "බලාපොරොත්තු",
            "interpretation": "සොදුරු බලාපොරොත්තු"
        }
    ]
},
{
    "title": "මාරුතෙ",
    "singer": ["රිද්ම වීරවර්දෙන"],
    "lyricist": ["අන්සාෆ් අමීර්"],
    "composer": ["විලියම් ෆ්‍රැන්සිස්"],
    "album": "මාරුතෙ",
    "year": "2022",
    "lyrics": " මාරුතේ හමනා මේ තුරු සිහිලෙන් වස්සානේ ජීවිතේ දැනෙනා මේ හැගුමන් නිල් වරුසාවේ  නීල දෑස බලලා හීනේ දෑත පටලා මාගේ වෙන්න පතලා ආදරෙන් වෙලා  රහසින් මා පෙම් කරනා නෙත් හොරැහින් ඉගි මරනා මොහොතින් මහොතක් ගෙවෙනා කාලෙට හිමිකම් කියනා  රෑ තුන් යාමේ මැවෙනා රුව තරුවක් වී දිලෙනා තවමත් නුහුරුයි කියලා හැගුමෙන් මා වෙලුනා  ලෙංගතු වී ලා මා හා නෙතගින් බස් කොදුරාවී මල් මදහාසෙන් සරසා ලූ ඈ පෙම් අගනාවී  සදවත ආදරෙයි කියා කියන් මට නීල ආකාසේ පේන මානයේ රැදී පෙම් හීන ගංගාවේ මේ භවේ පුරා පතාම ආ ආලේ  රහසින් මා පෙම් කරනා නෙත් හොරැහින් ඉගි මරනා මොහොතින් මහොතක් ගෙවෙනා කාලෙට හිමිකම් කියනා  රෑ තුන් යාමේ මැවෙනා රුව තරුවක් වී දිලෙනා තවමත් නුහුරුයි කියලා හැගුමෙන් මා වෙලුනා",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "හැගුමන් නිල් වරුසාවේ",
            "target": "හැගුමන්",
            "interpretation": "උද්යෝගිමත් හැගුමන්"
        },
        {
            "domain": "ආදරය",
            "source": "රුව තරුවක්",
            "target": "රූපය",
            "interpretation": "දිදුලන රුව"
        },
        {
            "domain": "ආදරය",
            "source": "පෙම් හීන ගංගාවේ",
            "target": "බලාපොරොත්තු",
            "interpretation": "නොනිමෙන බලාපොරොත්තු"
        }
    ]
},
{
    "title": "සොයා ආව",
    "singer": ["රිද්ම වීරවර්දෙන"],
    "lyricist": ["චන්ද්‍රසේන තලන්ගම"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "සොයා ආව",
    "year": "2019",
    "lyrics": "සදා කාලේ මා…  හදේ වීනා  මවා පෑ සිනා  මගේ හීනේ මා…  සොයා ආවා…  පැතූ සේ එදා…   කොයිද ඔබ මා…  ලොවේ කිසිදා…  අසා නෑ මා…  හදේ ඇදුනා…  හිතේ රැදුනා…  ඔබේ රුව මා…   මගේ ගීතේ මා…  එදා කීවා…  හදේ පෑරෙනා…  ඔබේ දෑ සේ ගී පොතේ වූ වා  මගේ චේතනා…   ඇයි ද ගොලු වී…  බලා නොබලා…  සිනා පානා…  සොයා ආවා…  සොයා ආවා…  එදා මෙන් මා…   නෑ…සීලා සද රේකා…  සිසිලේ නෑ වේවා…  මුහුනේ ගෑ ආලේ…  සොදුරේ මා වේවා…  ඉතිරේවා…සැමදා සෙනේ…  මා පැතුවා හදින්…  සමාවී අසන්…  අදුරේ මා නොහෙලා ඉතින්…  සිනා පා ඉදින් සදා මා ලගින්…   මගේ ගීතේ මා…  එදා කීවා…  හදේ පෑරෙනා…  ඔබේ දෑ සේ ගී පොතේ වූ වා  මගේ චේතනා…   ඇයි ද ගොලු වී…  බලා නොබලා…  සිනා පානා…  සොයා ආවා…  සොයා ආවා…  එදා මෙන් මා… ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "හදේ වීනා  මවා පෑ සිනා",
            "target": "සිනහව",
            "interpretation": "සිත පුබුදු වන සිනහව"
        },
        {
            "domain": "ආදරය",
            "source": "ඔබේ දෑ සේ ගී පොතේ",
            "target": "සිතුවිලි",
            "interpretation": "අප්‍රකාශිත සිතුවිලි"
        },
        {
            "domain": "ආදරය",
            "source": "අදුරේ මා නොහෙලා",
            "target": "තනිකම",
            "interpretation": "හැරදායාම"
        }
    ]
},
{
    "title": "තෙරුනාදො විසල් ආදරෙ",
    "singer": ["යසස් මැදගෙදර"],
    "lyricist": ["ශෙහාන් ගලහිටියාව"],
    "composer": ["යසස් මැදගෙදර"],
    "album": "තෙරුනාදො විසල් ආදරෙ",
    "year": "2021",
    "lyrics": "  තේරුනාදෝ විසල් ආදරේ පෑරී රිදුනා සුසුම් ආකහේ සද නිව්නා සුපෙම් ජීවිතේ පෑරුනාදෝ ඔබෙත් මා වගේ   දෑස රුව අහසේ පායා දෑස මත සේදී සේයා සිත සිරවී සොයයි ආදරේ..   බිදුන සිත රහසේ පාරා කදුළු පිනි දෑසේ රූරා සිහිනදෝ මේ සොයයි ආදරේ..   ලංවෙවී පෙම් රුවී පෑරුවේ පාරා සිතින් මා සදා ආදරේ මා රුතේ වෑහුනී පාවුනී වෙන් වී හැගුම් වියැකී ගියා සිහින ගානේ සුසුම් ගී තියා අහස මානේ පහන්වී ගියා   තේරුනාදෝ විසල් ආදරේ පෑරී රිදුනා සුසුම් ආකහේ සද නිව්නා සුපෙම් ජීවිතේ පෑරුනාදෝ ඔබෙත් මා වගේ   දෑස රුව අහසේ පායා දෑස මත සේදී සේයා සිත සිරවී සොයයි ආදරේ..   සිත සිරවී සොයයි ආදරේ සිත සිරවී සොයයි ආදරේ ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "දෑස රුව අහසේ පායා",
            "target": "සිහිවීම",
            "interpretation": "නිතර සිහිවීම"
        },
        {
            "domain": "ආදරය",
            "source": "සද නිව්නා සුපෙම් ජීවිතේ",
            "target": "දුක",
            "interpretation": "මහත් විරහ වේදනව"
        }
    ]
},
{
    "title": "දෙතොල්",
    "singer": ["බාශි දෙවන්ග"],
    "lyricist": ["බාශි දෙවන්ග"],
    "composer": ["බාශි දෙවන්ග"],
    "album": "දෙතොල්",
    "year": "2021",
    "lyrics": "  දෙතෝලේ සියුමැලි දෙතොලේ හිනාවී බලා ඉන්න සිපගන්නම් රහසින්   ඈගේ සියුමැලි දෑතේ වෙලී ඉන්න ඇත්නම් දෙනෙත පියවිලා දෙතොල් සිහි වුනා ඈගේ ගෙවුනු කාලේ   ලා දම් පාටින් අහස පායන්න වාගේ තියේ මේ පෙම්වත් කතාවේ   ආශා කරන සිත් ආලේ හොයන දැන් සිත්තම් හීන පේන දැන් ගේන සේයාව දෑසේ ඇදුනු පෙම් තාලෙන් දැනුන දෙතොල් සිපගන්න නුඹේ මං   හිනැහෙමුද ආයෙත් වරක් මුන ගැහුනු තැන් පහු කරන් ඇවිත් හිත සන්සුන් කරනා ගමන්   දෙනෙත පියවිලා දෙතොල් සිහි වුනා ඈගේ ගෙවුනු කාලේ   ලා දම් පාටින් අහස පායන්න වාගේ තියේ මේ පෙම්වත් කතාවේ   ආශා කරන සිත් ආලේ හොයන දැන් සිත්තම් හීන පේන දැන් ගේන සේයාව දෑසේ ඇදුනු පෙම් තාලෙන් දැනුන දෙතොල් සිපගන්න නුඹේ මං ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සිත්තම් හීන පේන",
            "target": "බලාපොරොත්තු",
            "interpretation": "මනන්කල්පිත බලාපොරොත්තු"
        },
        {
            "domain": "ආදරය",
            "source": "දෑසේ ඇදුනු පෙම් තාලෙන්",
            "target": "ආදරය",
            "interpretation": "නව ආදරය"
        }
    ]
},
{
    "title": "විරාමයක්",
    "singer": ["බාශි දෙවන්ග"],
    "lyricist": ["නිසල් ගමගේ"],
    "composer": ["බාශි දෙවන්ග"],
    "album": "විරාමයක්",
    "year": "2020",
    "lyrics": "  පෙම්වන්තී අතීතය විරාමයක් දෙසිත් නතරකල පෙම්වත්වී ගෙවූ ඒ සුයාමයත් ඒද මතකෙට නෑසේවා බිඳක් බිඳී සැලෙයි සුසුම් ද සිර කල නුදුරේ මා වුවත් දුරක් ගියේ ඔබයි නිහඬවම   හිත බැඳි ස්නේහවන්ති නුඹ වැඩිපුර ආලවන්ත වුන උනුහුම් තාල ගේන හිත හෙමින් සැලුනා පෙමින් වෙලුනා   විරසක හීන මංසලක නැවතුනේ මා නොවෙයි එ ඔබ නුහුරු නුපුරුදුව ඈත දුර ගිහින් තිබුනා පෙමින් මිදුනා   විඳගත් හාදුවේ දුන් නිකැළැල් ආදරේ බිඳුවක් මා ළයේ නුඹ සොයනා ඇරයුම් නොකළ පෙම් සාදේ නුඹ කෝ අහිමි සඳ මාගේ පිලියම් සොයමි තුන් යාමේ තහනම් වචනය කි ආලේ ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "උනුහුම් තාල ගේන හිත",
            "target": "හැගීම්",
            "interpretation": "නැවුම් හැගීම්"
        },
        {
            "domain": "ආදරය",
            "source": "විරසක හීන මංසලක",
            "target": "විරහව",
            "interpretation": "බිදුනු පෙම"
        },
        {
            "domain": "ආදරය",
            "source": "ඇරයුම් නොකළ පෙම් සාදේ",
            "target": "ආදරය",
            "interpretation": " අනපෙක්ශිත ආදරය"
        }
    ]
},
{
    "title": "ශාරදා",
    "singer": ["ලහිරු ලියනගෙ"],
    "lyricist": ["ශෙහාන් ගලහිටියාව"],
    "composer": ["යසස් මැදගෙදර"],
    "album": "ශාරදා",
    "year": "2019",
    "lyrics": "  දිසි හීන ගානේ උපනා විමානේ ඇසි මීන තීරේ ඉගි තාල තේරේ ආශා රසේ වෑහෙනා නාරී දෙතොල් ලං වෙනා   දිසි හීන ගානේ උපනා විමානේ ඇසි මීන තීරේ ඉගි තාල තේරේ ආශා රසේ වෑහෙනා නාරී දෙතොල් ලං වෙනා   කප් තුරක් සේම මා වෙලා ඉගි සුසුම් සේල යා වෙනා සුර ලොව ඉදන් ආවාද ශාරධා   නෙත් සරින් මාව ඇහැරවා සද හැගුම් යායේ පා වෙනා දෙව් ලොව හැගුම් මේවාද ශාරධා කාරණා තේරුණා ශාරධා   උපමා කථාවේ දෙව් ලියය මාගේ සැලෙනා නෙතේ සුව ගවසා ආදරේ මියෙනා තුරාවේ සුර දේහී මාගේ උපනා භවේ යලි බැදෙමු මේ වගේ ඇසි පිය සේලේ සලා පැතු හීනේ සේයා මවා දෙව් ලොව හැගුම් මේවාද ශාරධා කාරණා තේරුණා ශාරධා ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "කප් තුරක් සේම මා වෙලා ",
            "target": "ආදරවන්තිය",
            "interpretation": "වටිනා"
        },
        {
            "domain": "ආදරය",
            "source": "නෙත් සරින් මාව ඇහැරවා",
            "target": "ආදරවන්තිය",
            "interpretation": "ප්‍රබොධමත් කරන"
        },
        {
            "domain": "ආදරය",
            "source": "සද හැගුම් යායේ පා වෙනා",
            "target": "ආදරවන්තිය",
            "interpretation": "හැමවිට ආදරය හිතෙන"
        }
    ]
},
{
    "title": "සෙනෙහයෙ ප්‍රතිමුර්තිය අම්මා",
    "singer": ["සහන් රශ්මික", " යසස් මැදගෙදර"],
    "lyricist": ["යසස් මැදගෙදර"],
    "composer": ["යසස් මැදගෙදර"],
    "album": "සෙනෙහයෙ ප්‍රතිමුර්තිය අම්මා",
    "year": "2019",
    "lyrics": "  සෙනේහයේ ප්‍රතිමුර්තිය සිහි කරනෙමි පෙම්මා ලේ කිරිවුණු හදවත තුල දරුපෙම නැත නිම්මා කඳුළු දරා සුසුම් දරා විඳි දුක් කන්ද රෑ දිවා මෙතේ බුදුන් දැක නිවනට යනු මැන මගේ අම්මා   සාගර ජලය තරමට දුක වෙලාගෙන දෑසේ කඳුළු රහසෙම බිම හෙලාගෙන විශාකාව සේ පියවර තබාගෙන නා කපනා වැහි බීරම දරාගෙන   ඈ හද මඩල දුක් ගිනිකඳ නිවේවා…. ගෙවෙන ගෙවෙන මොහොතෙම සැප වැඩේවා…. ආයුවර්ණ ප්‍රඤ්ඤා බල වැඩේවා…. අම්මට මගේ නිවනට දොර මැවේවා…. ",
    "metaphors": [{
            "domain": "මවුපිය ගුණ",
            "source": "සාගර ජලය තරමට දුක",
            "target": "දුක",
            "interpretation": ""
        },
        {
            "domain": "මවුපිය ගුණ",
            "source": "විශාකාව සේ",
            "target": "අම්මා",
            "interpretation": "දන් දෙන"
        },
        {
            "domain": "මවුපිය ගුණ",
            "source": "නා කපනා වැහි බීරම",
            "target": "ප්‍රශ්න",
            "interpretation": " බොහො ප්‍රශ්න"
        }
    ]
},
{
    "title": "සන්සාරිනි",
    "singer": ["යසස් මැදගෙදර"],
    "lyricist": ["සජිත් අක්මීමන"],
    "composer": ["යසස් මැදගෙදර"],
    "album": "සන්සාරිනි",
    "year": "2019",
    "lyrics": "  කඳුලයි පවසන්නේ සැඟවූ ඒ ආදරේ අදමයි මා දන්නේ නොකියූ ඒ ආදරේ   සඳේ මං කෙසේ කියන්නේ හිතේ තියෙන ඒ ආදරය මා මන්මත් කෙරූවා කියා ඔබ දුටූදා නෙතේ වේදනා නිවෙන්නේ ඔබේ රූ නිසා හිත පාවෙලා දුර ගියා   පෙම් වර්ෂා වහී මා තෙමා සිත් සංඛා නිවී යයි මෙදා   සංසාරිණී මගේ නන්නාඳුනන්නියේ මා මවනා හීනයේ ඔබ ඉන්නවා වගේ සංසාරිණී මගේ නන්නාඳුනන්නියේ මා මවනා හීනයේ ඔබ ඉන්නවා වගේ   දේදුන්නේ පවා නැති සොබා රූපේ හැංගෙන්නේ ඔබේ ලඟ තමා කුළුඳුලේ මාගේ ප්‍රේමාදරේ නේක වාරේ බැඳේ හදවතේ   පෙම් වර්ෂා වහී මා තෙමා සිත් සංඛා නිවී යයි මෙදා   සංසාරිණී මගේ නන්නාඳුනන්නියේ මා මවනා හීනයේ ඔබ ඉන්නවා වගේ සංසාරිණී මගේ නන්නාඳුනන්නියේ මා මවනා හීනයේ ඔබ ඉන්නවා වගේ ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "නෙතේ වේදනා නිවෙන්නේ",
            "target": "ආදරවන්තිය",
            "interpretation": "ලස්සන සිත වසග කරන"
        },
        {
            "domain": "ආදරය",
            "source": "පෙම් වර්ෂා වහී",
            "target": "ආදර සිතුවිලි",
            "interpretation": "නොනවතින ආදර සිතුවිලි"
        },
        {
            "domain": "ආදරය",
            "source": "දේදුන්නේ පවා නැති සොබා",
            "target": "ආදරවන්තිය",
            "interpretation": "සුවිශේෂී ලස්සන"
        }
    ]
},
{
    "title": "චන්ද්‍රපානි",
    "singer": ["යසස් මැදගෙදර"],
    "lyricist": ["ශෙහාන් ගලහිටියාව"],
    "composer": ["යසස් මැදගෙදර"],
    "album": "චන්ද්‍රපානි",
    "year": "2021",
    "lyrics": "  සප්න ගානේ දෑස පේනා චන්ද්‍රයා මේ පහස ගේනා චන්ද්‍රපාණි ආදරෙන් වෙලා ස්වර්ග ප්‍රේමේ නෙත්සරේ පානා   හුස්ම සේලේ රැස්ම ආශා මන්දහාසේ ආ සඳේ මා ඉන්ද්‍රජාලි ප්‍රේමයේ හොවා හර්දේ වෑහී රූ හැඟුම් සේනා   රෑ දිවා ඈ නිසා ආශා තේරුනා මේ සොබා රෑ දිවා මා බලාලා ප්‍රේමිනා ඈ සිනා දෑස ළංවීලා   රෑ දවා සිත් පෙලා ඉන්නෙ කෝමදෝ වෙන්වීලා දෑස මානෙ දාලා වෙන්ව යන්නෙ නෑ හැරදා එන්න ප්‍රේමියේ ඉන්න ළංවීලා මා හා බැල්ම මානා එන්න ළංවී ආදරෙන් පාලා ආදරෙන් දෑස ළංවීලා ආදරෙන් ආදරේ වීලා   රෑ පුරා පෑ නුරා රෑම සිත්තම් වේ පෙම් සීලා අහස වාගේ සිහින මැව්වේ රෑ පුර නොනිදා හුස්ම ගානෙ ගැස්ම යාවීලා මා හා බැල්ම මානා එන්න ළංවී ආදරෙන් පාලා ආදරෙන් දෑත ළංවීලා ආදරෙන් ආදරේ වීලා   සප්න ගානෙ දෑස පේනා චන්ද්‍රයා මේ පහස ගේනා චන්ද්‍රපාණි ආදරෙන් වෙලා ස්වර්ග ප්‍රේමේ නෙත්සරේ පානා   හුස්ම සේලේ රැස්ම ආශා මන්දහාසේ ආ සඳේ මා ඉන්ද්‍රජාලි ප්‍රේමයේ හොවා හර්දෙ වෑහී රූ හැඟුම් සේනා   රෑ දිව ඈ නිසා අශා තේරුනා මේ සොබා රෑ දිවා මා බලාලා ප්‍රේමිනා ඈ සිනා දෑස ළංවීලා ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සප්න ගානේ දෑස පේනා",
            "target": "ආදරය",
            "interpretation": "සන්සාරික ආදරය"
        },
        {
            "domain": "ආදරය",
            "source": "ඉන්ද්‍රජාලි ප්‍රේමයේ හොවා හර්දේ",
            "target": "ආදරය",
            "interpretation": "පුදුම හිතෙන ආදරය"
        },
        {
            "domain": "ආදරය",
            "source": "අහස වාගේ සිහින මැව්වේ",
            "target": "බලාපොරොත්තු",
            "interpretation": "සිදුනොවන බලාපොරොත්තු"
        }
    ]
},
{
    "title": "මනරම්ය රාදා",
    "singer": ["චන්දන සිල්වා", "යසස් මැදගෙදර"],
    "lyricist": ["ශෙහාන් ගලහිටියාව"],
    "composer": ["යසස් මැදගෙදර"],
    "album": "මනරම්ය රාදා",
    "year": "2020",
    "lyrics": "  මන රම්‍ය රාධා නෙතු කැල්ම මානා සඳ කැන් සිනා වෑහෙනා ආනන්ද ආශා නෙතු යුග්ම ගේනා සඳ රෑ පුරා සිහිවෙනා සැලීලා මා රෑ හීන පීරා රූ සේද සීරා මන මත් කළා මාව රාධා උන්මාද ආශා මා සංතානෙ යාවීලා සිතුවම් මවා හීන සේනා සන්තාප සේදීලා සෘන්ගාරෙ නැහැවීලා හැඟුමන් පවා මෝදු වීලා රෑ හීන පීරා රූ සේද සීරා මන මත් කළා මාව රාධා වස්සානෙ නෙත් දීලා ගිම්හානෙ ළංවීලා සුසුමන් සලා හාද වීලා මධ්‍යාහ්නෙ යා වීලා සන්ද්‍යාවෙ පාවීලා පැතු පෙම් සිනා පාට වීලා රෑ හීන පීරා රූ සේද සීරා මන මත් කළා මාව රාධා    ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සඳ කැන් සිනා",
            "target": "සිනහව",
            "interpretation": "ලස්සන සිනහව"
        },
        {
            "domain": "ආදරය",
            "source": "සිතුවම් මවා හීන සේනා",
            "target": "බලාපොරොත්තු",
            "interpretation": "මනන්කල්පිත බලාපොරොත්තු"
        },
        {
            "domain": "ආදරය",
            "source": "පෙම් සිනා පාට වීලා",
            "target": "ආදරය",
            "interpretation": "ආදරය හටගැනීම"
        }
    ]
},
{
    "title": "යන්නම් මතකෙන්",
    "singer": ["රිද්ම වීරවර්දෙන"],
    "lyricist": ["තිලින බොරලැස්ස"],
    "composer": ["තිලින බොරලැස්ස"],
    "album": "යන්නම් මතකෙන්",
    "year": "2021",
    "lyrics": "  සරා සදේ ලියා මාගේ හීනේ   හදේ රැදී මා ඒ ආදරේ මේ යාමයේ යන්නම් මතකෙන් හැබැහින් ආදරෙන් යන්නම් මතකෙන් ආදරෙන්   තරුපායා තිබුනත් ‍රෑ අහස පාලුවට ගිහින් නුඹත් යන්න ගිහින් වත් දෝ අමාවක වගේ   සදේ අහපන් මේ රෑ යාමේ මාගේ අන්දරේ සදේ සදේ නුඹ කොහිදයි කියපන් මේ රෑ යාමේ මා තනියෙන් උන්නේ   සරා සදේ ලියා මාගේ හීනේ   හදේ රැදී මා ඒ ආදරේ මේ යාමයේ යන්නම් මතකෙන් හැබැහින් ආදරෙන් යන්නම් මතකෙන් ආදරෙන්   සදේ ඉදපං තව වරුවක් ඇවිදින් ලගින් සදේ සදේ නුඹ කොයිබද කියපං මේ රෑ යාමේ මා තනියෙන් මේ ඉවුරේ    යන්නම් මතකෙන් ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සදේ නුඹ",
            "target": "ආදරවන්තිය",
            "interpretation": "ජීවිතයට ආලොකය ලබාදීම"
        },
        {
            "domain": "විරහව",
            "source": "යන්න ගිහින් වත් දෝ අමාවක වගේ",
            "target": "හැරගිය ප්‍රේමය",
            "interpretation": "හැරගිය ප්‍රේමය නිසා ඇතිවු අඩුව"
        }
    ]
},
{
    "title": "මන්දාරම් එලි",
    "singer": ["බාශි දෙවන්ග"],
    "lyricist": ["බාශි දෙවන්ග"],
    "composer": ["යුකි නවරත්න"],
    "album": "මන්දාරම් එලි",
    "year": "2022",
    "lyrics": "  මන්දාරම් එළියෙන් හීන තනිවෙන්න නම් රෑ බෝ වී මත් වී ගන්දෑලේ ලං වී පාවියන් ගැහෙනා මහද නිවෙනා තෙක් නොබලන් මේ හිත සඟවන්   සන්ද්යාවේ දාක මා එන්නම් හාදු තියලා රුව ගස්සන් නාරි සෙල්ලක්කාර මායම් රෑනේ හා කෝ එන්නම් ඉන්න දිලිසෙන තරු දෙන්නම් මා තනිවෙන්න පෙර සේ මා   එන්න එක්කං යන්නම් මං එන්න එක්කං යන්නම් මං දෑතින් අල්ලන් ඉන්නම් දැන් යහන සරසන්න නම් ශෘගාරී ළං වෙන්න දැන් රෑක රැඟුමන් හංගන් පාට තවරා මල්දම් හාදු වැහි මංමාවත් දිගේ   දේහ වර්ණ ලඟ භාවනාවක් වාගේ ඔය රූ දැක්කත් මා දුරින් නිවෙන්නම් මා ඉතින් හීන පාරාදීසේ ඉන්නම් මා නුඹ එනකල් මං ආදරෙන්   ඕ… ඉන්නම් ආදරී ලංවී ලංවී මා ඉන්නම් තව ලංවී මා උණුහුම නොදැනෙම්ද නුඹ රැඳුනු දා එන්න යන් මා නොපෙනූ තැන් දිහා සඟවගෙන ආලේ   එන්න එක්කං යන්නම් මං එන්න එක්කං යන්නම් මං දෑතින් අල්ලන් ඉන්නම් දැන් යහන සරසන්න නම් ශෘගාරී ළං වෙන්න දැන් රෑක රැඟුමන් හංගන් පාට තවරා මල්දම් හාදු වැහි මංමාවත් දිගේ   යන්නම් මං එන්න එක්කං යන්නම් මං දෑතින් අල්ලන් ඉන්නම් දැන් යහන සරසන්න නම් ශෘගාරී ළං වෙන්න දැන් රෑක රැඟුමන් හංගන් පාට තවරා මල්දම් හාදු වැහි මංමාවත් දිගේ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "මල්දම් හාදු වැහි මංමාවත්",
            "target": "හාදු",
            "interpretation": "දිගු සිපගැනීම්"
        },
        {
            "domain": "ආදරය",
            "source": "දේහ වර්ණ ලඟ භාවනාවක් වාගේ",
            "target": "ආදරවන්තිය",
            "interpretation": "වශීවන ලස්සන"
        }
    ]
},
{
    "title": "අප්සරාවි",
    "singer": ["බාශි දෙවන්ග"],
    "lyricist": ["අමිතා ස්වර්නකාන්ති"],
    "composer": ["සන්ජුල හිමාල"],
    "album": "අප්සරාවි",
    "year": "2021",
    "lyrics": "  නොනිදා නොනිදා රැය පහන් වී සයනයේ මා නෙතු දෑලේ රැදිලා   නුඹගේ චායා පෙනී නොපෙනී වියැකී ගිය දා මා සිතේ තැවෙනා නුඹගේ   මා නෙත් මානේ රැදී තියේ නුඹේ සොදුරූ චායා මැකීයාවී දෝ මා නෙත් අප්සරාවී   චන්චන නුඹේ හද හදුනා නෑ මේ මහා සාගරේ වාගේ සෙනෙහේ වාගේ සෙනෙහේ නුඹේ හදවත ඇවිලේලා හිත පාරනා නුඹ මට හිමි නෑ මේ භවයේ සමුගන්නෙමී කදුලු සගවා මා නෙත් වල සගවා අප්සරාවී   හදුනා ගත්තේ නුඹගේ සෙනෙහේ හිරු දුටු පිණි වාගේ සුදු සද වතුරේ හිනැහෙන මා නෙතු දෑලේ කදුලු චායා වියැකී   නුඹ මට හිමි නෑ මේ භවයේ සමුගන්නෙමී කදුලු සගවා මා නෙත් වල සගවා අප්සරාවී ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "අප්සරාවී",
            "target": "ආදරවන්තිය",
            "interpretation": "බොහොම ලස්සන"
        },
        {
            "domain": "ආදරය",
            "source": "මහා සාගරේ වාගේ සෙනෙහේ ",
            "target": "ආදරය",
            "interpretation": "නිමක් නොවෙන"
        },
        {
            "domain": "ආදරය",
            "source": "සෙනෙහේ හිරු දුටු පිණි වාගේ",
            "target": "ආදරය",
            "interpretation": "ඉක්මනින් නැතිවු"
        }
    ]
},
{
    "title": "රතු මල් පොකුරු",
    "singer": ["බාශි දෙවන්ග"],
    "lyricist": ["බාශි දෙවන්ග"],
    "composer": ["යුකි නවරත්න"],
    "album": "රතු මල් පොකුරු",
    "year": "2021",
    "lyrics": "  නුබ මගේ හදේ රැදුනු මලක් උනේ මට නුබේ අගේ දැනුනේ එපමනක් නොවේ   නුබ පාවීලා ආවාට රහසේ මට හැකි වේද නුබේ වෙන්න ආයේ නුඹ හා තනිවෙන්න ඒ කදුලු කතරේ මට දෙනවාද නුබේ වෙන්න ආයේ   රතුමල් පොකුරු හැඩ බිදුනා නුබ හින්දා හිත හංගා මං තාමත් ඒ ආලේ කරනා නුබ මාගේ මනමාලී කවදාහෝ හිනැහේවී දැනුනානම් මා ගැන දැනුනානම්   නුබ මාගේද කාගේද නොදනී එදා නෙත් හැරුනාට මා දෙස බලා තව නොකියන්න හිත් පාරනා කාරනා නුඹ සනසන්න නෑ ලග මෙදා   නුබ පාවීලා ආවාට රහසේ මට හැකි වේද නුබේ වෙන්න ආයේ නුඹ හා තනිවෙන්න ඒ කදුලු කතරේ මට දෙනවාද නුබේ වෙන්න ආයේ   රතුමල් පොකුරු හැඩ බිදුනා නුබ හින්දා හිත හංගා මං තාමත් ඒ ආලේ කරනා නුබ මාගේ මනමාලී කවදාහෝ හිනැහේවී දැනුනානම් මා ගැන දැනුනානම් ",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "නුබ මගේ හදේ රැදුනු මලක්",
            "target": "ආදරවන්තිය",
            "interpretation": "නොමැකෙන ආදරය"
        },
        {
            "domain": "ආදරය",
            "source": "නුබ පාවීලා ආවාට",
            "target": "ආදරවන්තිය",
            "interpretation": "නොදෙනිම ලන්වීම"
        }
    ]
},
{
    "title": "මදුරභානි",
    "singer": ["යසස් මැදගෙදර"],
    "lyricist": ["ශෙහාන් ගලහිටියාව"],
    "composer": ["යසස් මැදගෙදර"],
    "album": "මදුරභානි",
    "year": "2021",
    "lyrics": "  ඒ දෑස පේනා රෑ හීන ගානේ දැනීලා කථා කල්පනාවේ සරා රෑ නින්ද නේනා ඈ දෑස මානේ මැවීලා නිසා රූ ඇගේ සිහිවුනා   මේ හීන ගානේ මං පෑ කෝල ආයාචනා පේන හීන නම් මං බොහොම ආශා කලා මධුරභාණී මගේ මට පෑහෙනා   ඒ දෑස පේනා රෑ හීන ගානේ දැනීලා කථා කල්පනාවේ සරා රෑ නින්ද නේනා ඈ දෑස මානේ මැවීලා නිසා රූ ඇගේ සිහිවුනා   මාරුතේ සිහින ගේනා රෑපුරා සිහින සේනා කාරනා තේරුනා ආදරේ හේතු ගේනා ජීවිතේ ඈත පේනා ආදරී ලං උනා   මේ හීන ගානේ මං පෑ කෝල ආයාචනා පේන හීන නම් මං බොහොම ආශා කලා මධුරභාණී මගේ මට පෑහෙනා   ඒ දෑස පේනා රෑ හීන ගානේ දැනීලා කථා කල්පනාවේ සරා රෑ නින්ද නේනා ඈ දෑස මානේ මැවීලා නිසා රූ ඇගේ සිහිවුනා   මධුරභාණී මගේ මට පෑහෙනා   ඒ දෑස පේනා රෑ හීන ගානේ දැනීලා කථා කල්පනාවේ සරා රෑ නින්ද නේනා ඈ දෑස මානේ මැවීලා නිසා රූ ඇගේ සිහිවුනා ",
    "metaphors": [{
        "domain": "ආදරය",
        "source": "මාරුතේ සිහින ගේනා",
        "target": "බලාපොරොත්තු",
        "interpretation": "අවසානයක් නැති බලාපොරොත්තු"
    }]
},
{
    "title": "මොන අලවන්තකම් දො නගා",
    "singer": ["රිද්ම වීරවර්දෙන"],
    "lyricist": ["චන්ද්‍රසේන තලන්ගම"],
    "composer": ["චරිත අත්තලගේ "],
    "album": "මොන අලවන්තකම් දො නගා",
    "year": "2019",
    "lyrics": " ඉරේ රැවුම් දැක බයවීලා වැවේ උගුර කට වේලීලා ගඩා ගෙඩිත් හාමතයෙන් උන්නා මොන ආලවන්තකම් දෝ නගා මොන ආලවන්තකම් දෝ නගා ඉරේ රැවුම් දැක බයවීලා වැවේ උගුර කට වේලීලා ගඩා ගෙඩිත් හාමතයෙන් උන්නා මොන ආලවන්තකම් දෝ නගා මොන ආලවන්තකම් දෝ නගා බලාපන්කෝ නුඹ කේඬෑරි වීලා වේයන් කෑව වැට ඉන්න වගේ එන පෝයට වැහි වහීද මන්දා තෙමිල මැරෙන්නට උනත් හිතේ තෙමිල මැරෙන්නට උනත් හිතේ ඉරේ රැවුම් දැක බයවීලා වැවේ උගුර කට වේලීලා ගඩා ගෙඩිත් හාමතයෙන් උන්නා මොන ආලවන්තකම් දෝ නගා මොන ආලවන්තකම් දෝ නගා අව්කාස්ටකේ තද පෑවිල්ලයි රැලි දිදී නැගෙන මේ දූවිල්ලයි එන වෙසක් මහේ වැස්සොත් අගනෙයි මංගල්ලේ එදාටයි නුඹෙයි මගෙයි මගුල එදාටයි නුඹෙයි මගෙයි ඉරේ රැවුම් දැක බයවීලා වැවේ උගුර කට වේලීලා ගඩා ගෙඩිත් හාමතයෙන් උන්නා මොන ආලවන්තකම් දෝ නගා මොන ආලවන්තකම් දෝ නගා මොන ආලවන්තකම් දෝ නගා මොන ආලවන්තකම් දෝ නගා",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "වේයන් කෑව වැට ඉන්න වගේ",
            "target": "කාන්තාවක්",
            "interpretation": "කෙට්ටු"
        },
        {
            "domain": "ජීවිතය",
            "source": "ගඩා ගෙඩිත් හාමතයෙන් උන්නා",
            "target": "කාලරාමුව",
            "interpretation": "දුශ්කර කාලරාමුව"
        }
    ]
},
{
    "title": "සොන්දුරු සිත්තම්",
    "singer": ["රිද්ම වීරවර්දෙන"],
    "lyricist": ["චමින්ද ගමගේ"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "සොන්දුරු සිත්තම්",
    "year": "2020",
    "lyrics": " මුවගේ හස කැන් දිලුණේ නෙතගේ කඳුළැල් නිවුණේ හදෙහී පැතුමන් පිපුණේ සැනසූ වදනින් දෙඩුවේ දසුනින් නොමැකී රැඳුණේ රිදෙනා සිතමයි හැදුණේ නොබිඳී සසරේ බැඳුණේ ඇසුරේ ඔබමයි පැතුවේ එකසේ දෙහදක් පිදුණේ ආදරෙන් මා වෙලා සොඳුරු සිත්තම් යොදා සිහිනයක මා තබා ඇරයුම් කළා විකසිතව ළං වෙලා සුවඳකට මුසු වෙලා රහස කොඳුරා කියා ඔච්චම් කළා නොගැයූ කවියක් වාගේ නොලියූ පදවැල් මාගේ මේ දිවි ගමනේ ඔබගෙනි ඇසුණේ මතකේ රඳවා සොඳුරු ම යාමේ හමනා පවනක් වාගේ සිසිලයි ඔබ ගෙන ආවේ කතරට වැටෙනා පොද වැහි වාගේ දෙහදක් පතලා සිත් මල් යාමේ පියමැන අපි යමු පැහැසර යාමේ ආදරෙන් මා වෙලා සොඳුරු සිත්තම් යොදා සිහිනයක මා තබා ඇරයුම් කළා විකසිතව ළං වෙලා සුවඳකට මුසු වෙලා රහස කොඳුරා කියා ඔච්චම් කළා",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "සොඳුරු සිත්තම්",
            "target": "සිහින",
            "interpretation": "සොඳුරු සිහින"
        },
        {
            "domain": "ආදරය",
            "source": "කතරට වැටෙනා පොද වැහි",
            "target": "ආදරය",
            "interpretation": "ජීවිතය නිවාලන ආදරය"
        },
        {
            "domain": "ආදරය",
            "source": "හමනා පවනක් වාගේ",
            "target": "ආදරය",
            "interpretation": "ජීවිතය නිවාලන ආදරය"
        }
    ]
},
{
    "title": "පුන්චි අත්තටු",
    "singer": ["රිද්ම වීරවර්දෙන"],
    "lyricist": ["චන්ද්‍රසේන තලන්ගම"],
    "composer": ["චරිත අත්තලගේ"],
    "album": "පුන්චි අත්තටු",
    "year": "2021",
    "lyrics": " පුංචි අත්තටු සිඳින්නෙපා පුංචි අත්තටු සිඳින්නෙපා අපේ සතුටට ගීතයක් ලියා නොමැතිද කිවිඳුනේ ලොවේ විඩා නිවනට කවිපෙලක් අසා නොමැතිද ජීවිතේ අපේ පාසලේ සීනු හඬ නැතේ සෙල්ලමයි අපේ පුංචි කාසිය රවුමට මවනා ජීවිතේ පුංචි අත්තටු සිඳින්නෙපා කැකුළු මල් පෙති තලන්නෙපා බඹර ගී ගොළු කරන්නෙපා සෙල්ලම් ගෙයි බිඳින්නෙපා",
    "metaphors": [{
            "domain": "ලමයින්",
            "source": "පුංචි අත්තටු",
            "target": "කුඩා ලමයින්",
            "interpretation": "පිවිතුරු සුසිනිදු ලමයින්"
        },
        {
            "domain": "ලමයින්",
            "source": "කැකුළු මල් පෙති",
            "target": "කුඩා ලමයින්",
            "interpretation": "අහින්සක ලමයින්"
        }
    ]
},
{
    "title": "විහගුන්ය අපි",
    "singer": ["දිනුපා කොදගොඩ"],
    "lyricist": ["දිනුපා කොදගොඩ"],
    "composer": ["නදික වෙලිගොඩපොල"],
    "album": "විහගුන්ය අපි",
    "year": "2022",
    "lyrics": " විහඟුන්ය අපි.. අහස හිමි නැති.. විහඟුන්ය අපි.. සියොත් රෑනක ඉගිලෙන්න තහනම්.. තැලුණු පොඩි වුණු තටු විහිදා පියඹන්න තතනනා... විහඟුන්ය අපි.. අහස හිමි නැති  ගී ගයන බස වෙනස් යදින දෙවියන් වෙනස් ඇඳුම අබරණ වෙනස් සිරිත් පැවතුම් වෙනස්.. නමුදු සකියනි විවර කළ හද ගලන රතු ලේ නෑ වෙනස් බලන් සකියනි සිනහ කඳුළු ද සිහින පැතුමන් නෑ වෙනස් විහඟුන්ය අපි එකම රෑනේ පියඹන්න තතනනා  පියාසැරියේ වරම ජයගන්ට නැගෙන වුන් තටු කපන පණ නසන ඉතිහාස වරනැගුම කියාදෙන්නේ අපට රෑනේ පියඹා.. නිල් අහස පවරාගන්න..  සුසුම් ලන්න සිනාසෙන්න නිදහසේ තටු විදාලන්න නොරිදවා කිසිවෙකුත් හද පිරී හැඟුමන් පොදී අහස් තලයට මුදා ලන්න නොරිදවා කිසිවෙකුත් සිහින දකිනා විහඟුන්ය අපි  අහස පවරාගන්න.. (විහඟුන්ය අපි) සුබ සිහින දකිනා..",
    "metaphors": [{
            "domain": "ජීවිතය",
            "source": "විහඟුන්ය අපි.. අහස හිමි නැති",
            "target": "මිනිසුන්",
            "interpretation": "නිදහස්ක් නැති මිනිසුන්"
        },
        {
            "domain": "ජීවිතය",
            "source": "එකම රෑනේ පියඹන්න",
            "target": "මිනිසුන්",
            "interpretation": "එකමුතු මිනිසුන්"
        }
    ]
},
{
    "title": "සීතල සුලන්ගෙ",
    "singer": ["යසස් මැදගෙදර"],
    "lyricist": ["අයොද්යා ප්‍රනාන්දු"],
    "composer": ["යසස් මැදගෙදර"],
    "album": "සීතල සුලන්ගෙ",
    "year": "2021",
    "lyrics": " සීතල සුළඟේ සැහැල්ලුවෙන් මං පිහාටුවක් සේ පාවෙලා දුර අහස සිසාරා එමි සිහිනෙක සිත මගෙ සෙමින් තියා සීතල සුළඟේ සැහැල්ලුවෙන් මං පිහාටුවක් සේ පාවෙලා දුර අහස සිසාරා එමි සිහිනෙක සිත මගෙ සෙමින් තියා  වළාපෙලක අතුරා සිහිනය දේදුනු පාට තියා මා ආවේ දෑස සොයා..  සඳ ඈත පේන රෑක හීන වපුරා සිත ආදරේ පෙරා ගෙනාවා හිමි දෑස ගැනම තාම හිතනවා…..  සීතල සුළඟේ සැහැල්ලුවෙන් මං පිහාටුවක් සේ පාවෙලා දුර අහස සිසාරා එමි සිහිනෙක සිත මගෙ සෙමින් තියා සීතල සුළඟේ සැහැල්ලුවෙන් මං පිහාටුවක් සේ පාවෙලා දුර අහස සිසාරා එමි සිහිනෙක සිත මගෙ සෙමින් තියා තරු රෑන ගාව ජීවිතේම තියලා එමි පාවෙලා සුළං සැරේ මා ඔබ කෝ කියා දෙනෙත් සොයනවා….  සුදු පාට මීදුමේ තෙමී තෙමීලා කඳු යාය පසු කළේ සෙමින් මෙමා සංසාරයේම මං ඉන්නවා…  සීතල සුළඟේ සැහැල්ලුවෙන් මං පිහාටුවක් සේ පාවෙලා දුර අහස සිසාරා එමි සිහිනෙක සිත මගෙ සෙමින් තියා සීතල සුළඟේ සැහැල්ලුවෙන් මං පිහාටුවක් සේ පාවෙලා දුර අහස සිසාරා එමි සිහිනෙක සිත මගෙ සෙමින් තියා",
    "metaphors": [{
            "domain": "ආදරය",
            "source": "පිහාටුවක් සේ පාවෙලා",
            "target": "ජීවිතය",
            "interpretation": "සැහැල්ලු ජීවිතය"
        },
        {
            "domain": "ආදරය",
            "source": "සිහිනය දේදුනු පාට තියා",
            "target": "බලපොරොත්තු",
            "interpretation": "විවිධ සුන්දර බලපොරොත්තු"
        }
    ]
},
{
    "title": "දවසක් එවි",
    "singer": ["පියත් රාජපක්ශ"],
    "lyricist": ["පියත් රාජපක්ශ"],
    "composer": ["පියත් රාජපක්ශ"],
    "album": "දවසක් එවි",
    "year": "2021",
    "lyrics": " සෙවනැල්ලත් මඟහැර යන අඳුරේදිත් මා ගාවින් රැඳී නුඹ හිටියද හැම සංසාරෙම මේ වාගේ මගෙ ලඟටම වී ඔබ හින්දා මං ගැයු පෙම් වදන් දෝරේ ගලා ගියා දැන් නුඹෙන් මං විඳිමි හැඟුමන් මා හද නිවාලනා දවසක් ඒවි අපිත් අපෙ හීන වලට යාවී ඒ හැම මොහොතේ ලඟින් නුඹ හිටියොතින් ඇතී දවසක් ඒවි අපිත් අපෙ හීන වලට යාවී ඒ හැම මොහොතේ ලඟින් නුඹ හිටියොතින් ඇතී ජීවිතයේ තැන් තිබුනා අපිටම අපිවම නැති වුන ඒ ගැන මං හිතනා විට කඳුලක් උනනවා මට නොදැනිම ඔබ හින්දා මං ගැයු පෙම් වදන් දෝරේ ගලා ගියා දැන් නුඹෙන් මං විඳිමි හැඟුමන් මා හද නිවාලනා දවසක් ඒවි අපිත් අපෙ හීන වලට යාවී ඒ හැම මොහොතේ ලඟින් නුඹ හිටියොතින් ඇතී දවසක් ඒවි අපිත් අපෙ හීන වලට යාවී ඒ හැම මොහොතේ ලඟින් නුඹ හිටියොතින් ඇතී සෙවනැල්ලත් මඟහැර යන අඳුරේදිත් මා ගාවින් රැඳී නුඹ හිටියද හැම සංසාරෙම මේ වාගේ මගෙ ලඟටම වී දවසක් ඒවි අපිත් (දවසක් ඒවි) අපෙ හීන වලට යාවී (හීන වලට යාවී) ඒ හැම මොහොතේ ලඟින් නුඹ හිටියොතින් ඇතී (නුඹ හිටියොතින් ඇතී) දවසක් ඒවි අපිත් (දවසක් ඒවි) අපෙ හීන වලට යාවී (හීන වලට යාවී) ඒ හැම මොහොතේ ලඟින් නුඹ හිටියොතින් ඇතී (නුඹ හිටියොතින් ඇතී)",
    "metaphors": [{
        "domain": "ආදරය",
        "source": "සෙවනැල්ලත් මඟහැර යන අඳුරේදිත් මා ගාවින් රැඳී",
        "target": "ආදරය",
        "interpretation": "ස්තිර ආදරය"
    }]
},
{
    "title": "අසීමාන්න්තික බැදීම්",
    "singer": ["නිසල් ගමගේ"],
    "lyricist": ["නිසල් ගමගේ"],
    "composer": ["අමිත් ගුරු"],
    "album": "අසීමාන්න්තික බැදීම්",
    "year": "2021",
    "lyrics": " අසීමාන්තික බැඳීම් සීමා සහිත වී මා දවයි මා දවයි බැඳෙමින් බිඳ වැටී බැඳෙමින් බිඳ වැටී  අසීමාන්තික බැඳීම් සීමා සහිත වී මා දවයි මා දවයි බැඳෙමින් බිඳ වැටී බැඳෙමින් බිඳ වැටී  ඉක්මවා යා නොහැකි තැන් පිරුනූ විසඳුම් ද නැතිවූ… නික්ම යා යුතු වුවද දැං සැඟවූ මතකය ම ඇවිලූ… නොදැනුවත් හීන ප්‍රාර්ථනා ගොන්න වාලුකාවෙන් වසා තියා යන්න කාලයක් ආලයක් වුනා සේ සතු..  එක්ව ආ ගිය මගද දැං ඇහිරූ දූවිල්ල මත වූ.. ආදරේ පා සටහනින් අසමූ මතකයට නගමු.. වේදනාවන් පිටාර දී උන්න වාර පාසා ම හේතු සැනසෙන්න මාවතක් ප්‍රේමයක් වුනා දෝ මතු ",
    "metaphors": [{
            "domain": "විරහව",
            "source": "හීන ප්‍රාර්ථනා ගොන්න වාලුකාවෙන් වසා",
            "target": "විරහව",
            "interpretation": "අතීතය අත්හැර"
        },
        {
            "domain": "විරහව",
            "source": "ඇහිරූ දූවිල්ල මත වූ.. ආදරේ පා සටහනින්",
            "target": "මතකයන්",
            "interpretation": "ඉක්මනින් මැකෙන මතකයන්"
        }
    ]
}
]
